ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
/**
 * \brief Component description for PIC32CX/0525SG12 ESPI_IO
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-04-24T21:15:30Z */
#ifndef _PIC32CX_0525SG12_ESPI_IO_COMPONENT_H_
#define _PIC32CX_0525SG12_ESPI_IO_COMPONENT_H_

/** \addtogroup PIC32CX_0525SG12_ESPI_IO The Enhanced Serial Peripheral Interface (eSPI) is used by the system host to configure the chip and communicate\n    with the logical devices implemented in the design through a series of read/write registers. It is Intel's successor to the\n    Low Pin Count (LPC) bus, used in previous devices to provide System Host access to devices internal to the Embedded Controller.\n    The I/O Component is one of two Logical Devices (along with the Memory Component) that provide access to all the registers in the device.
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR ESPI_IO */
/* ========================================================================== */

/* -------- ESPI_IO_INDEX : (ESPI_IO Offset: 0x00) (R/W 8) The INDEX register, which is part of the Configuration Port, is used as a pointer to a Configuration Register Address. -------- */

typedef union
{
  uint8_t  w;
} __ESPI_IO_INDEX_bits_t;
#define ESPI_IO_INDEX_RESETVALUE            (0x00U)                                       /**<  (ESPI_IO_INDEX) The INDEX register, which is part of the Configuration Port, is used as a pointer to a Configuration Register Address.  Reset Value */

#define ESPI_IO_INDEX_Msk                     (0x00000000UL)                                 /**< (ESPI_IO_INDEX) Register Mask  */

/* -------- ESPI_IO_DATA_REG : (ESPI_IO Offset: 0x01) (R/W 8) The DATA register, which is part of the Configuration Port, is used to read or write data to the register currently being selected by the INDEX Register. -------- */

typedef union
{
  uint8_t  w;
} __ESPI_IO_DATA_REG_bits_t;
#define ESPI_IO_DATA_REG_RESETVALUE         (0x00U)                                       /**<  (ESPI_IO_DATA_REG) The DATA register, which is part of the Configuration Port, is used to read or write data to the register currently being selected by the INDEX Register.  Reset Value */

#define ESPI_IO_DATA_REG_Msk                  (0x00000000UL)                                 /**< (ESPI_IO_DATA_REG) Register Mask  */

/* -------- ESPI_IO_PC_LAST_CYCLE_DW0 : (ESPI_IO Offset: 0x100) (R/ 32) Peripheral Channel Last Cycle Register (DWord 0) -------- */

typedef union
{
  struct
  {
    uint32_t PC_ADDRESS_LSDW:32;        /**< bit:  0..31  This field records bits[31:0] of the 64 bit address of the most recent eSPI transaction. */
  };
  uint32_t w;
} __ESPI_IO_PC_LAST_CYCLE_DW0_bits_t;
#define ESPI_IO_PC_LAST_CYCLE_DW0_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_PC_LAST_CYCLE_DW0) Peripheral Channel Last Cycle Register (DWord 0)  Reset Value */

#define ESPI_IO_PC_LAST_CYCLE_DW0_PC_ADDRESS_LSDW_Pos (0)                                            /**< (ESPI_IO_PC_LAST_CYCLE_DW0) This field records bits[31:0] of the 64 bit address of the most recent eSPI transaction. Position */
#define ESPI_IO_PC_LAST_CYCLE_DW0_PC_ADDRESS_LSDW_Msk (0xFFFFFFFFU << ESPI_IO_PC_LAST_CYCLE_DW0_PC_ADDRESS_LSDW_Pos)  /**< (ESPI_IO_PC_LAST_CYCLE_DW0) This field records bits[31:0] of the 64 bit address of the most recent eSPI transaction. Mask */
#define ESPI_IO_PC_LAST_CYCLE_DW0_PC_ADDRESS_LSDW(value) (ESPI_IO_PC_LAST_CYCLE_DW0_PC_ADDRESS_LSDW_Msk & ((value) << ESPI_IO_PC_LAST_CYCLE_DW0_PC_ADDRESS_LSDW_Pos))
#define ESPI_IO_PC_LAST_CYCLE_DW0_Msk         (0xFFFFFFFFUL)                                 /**< (ESPI_IO_PC_LAST_CYCLE_DW0) Register Mask  */

/* -------- ESPI_IO_PC_LAST_CYCLE_DW1 : (ESPI_IO Offset: 0x104) (R/ 32) Peripheral Channel Last Cycle Register (DWord 1) -------- */

typedef union
{
  struct
  {
    uint32_t PC_ADDRESS_MSDW:32;        /**< bit:  0..31  This field records bits[63:32] of the 64 bit address of the most recent eSPI transaction. */
  };
  uint32_t w;
} __ESPI_IO_PC_LAST_CYCLE_DW1_bits_t;
#define ESPI_IO_PC_LAST_CYCLE_DW1_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_PC_LAST_CYCLE_DW1) Peripheral Channel Last Cycle Register (DWord 1)  Reset Value */

#define ESPI_IO_PC_LAST_CYCLE_DW1_PC_ADDRESS_MSDW_Pos (0)                                            /**< (ESPI_IO_PC_LAST_CYCLE_DW1) This field records bits[63:32] of the 64 bit address of the most recent eSPI transaction. Position */
#define ESPI_IO_PC_LAST_CYCLE_DW1_PC_ADDRESS_MSDW_Msk (0xFFFFFFFFU << ESPI_IO_PC_LAST_CYCLE_DW1_PC_ADDRESS_MSDW_Pos)  /**< (ESPI_IO_PC_LAST_CYCLE_DW1) This field records bits[63:32] of the 64 bit address of the most recent eSPI transaction. Mask */
#define ESPI_IO_PC_LAST_CYCLE_DW1_PC_ADDRESS_MSDW(value) (ESPI_IO_PC_LAST_CYCLE_DW1_PC_ADDRESS_MSDW_Msk & ((value) << ESPI_IO_PC_LAST_CYCLE_DW1_PC_ADDRESS_MSDW_Pos))
#define ESPI_IO_PC_LAST_CYCLE_DW1_Msk         (0xFFFFFFFFUL)                                 /**< (ESPI_IO_PC_LAST_CYCLE_DW1) Register Mask  */

/* -------- ESPI_IO_PC_LAST_CYCLE_DW2 : (ESPI_IO Offset: 0x108) (R/ 32) Peripheral Channel Last Cycle Register (DWord 2) -------- */

typedef union
{
  struct
  {
    uint32_t PC_LENGTH:12;              /**< bit:  0..11  This field records the length of the most recent eSPI transaction. */
    uint32_t PC_CYCLE_TYPE:8;           /**< bit: 12..19  This field records the cycle type of the most recent eSPI transaction. */
    uint32_t PC_TAG:4;                  /**< bit: 20..23  This field records the tag of the most recent eSPI transaction. */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_PC_LAST_CYCLE_DW2_bits_t;
#define ESPI_IO_PC_LAST_CYCLE_DW2_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_PC_LAST_CYCLE_DW2) Peripheral Channel Last Cycle Register (DWord 2)  Reset Value */

#define ESPI_IO_PC_LAST_CYCLE_DW2_PC_LENGTH_Pos (0)                                            /**< (ESPI_IO_PC_LAST_CYCLE_DW2) This field records the length of the most recent eSPI transaction. Position */
#define ESPI_IO_PC_LAST_CYCLE_DW2_PC_LENGTH_Msk (0xFFFU << ESPI_IO_PC_LAST_CYCLE_DW2_PC_LENGTH_Pos)  /**< (ESPI_IO_PC_LAST_CYCLE_DW2) This field records the length of the most recent eSPI transaction. Mask */
#define ESPI_IO_PC_LAST_CYCLE_DW2_PC_LENGTH(value) (ESPI_IO_PC_LAST_CYCLE_DW2_PC_LENGTH_Msk & ((value) << ESPI_IO_PC_LAST_CYCLE_DW2_PC_LENGTH_Pos))
#define ESPI_IO_PC_LAST_CYCLE_DW2_PC_CYCLE_TYPE_Pos (12)                                           /**< (ESPI_IO_PC_LAST_CYCLE_DW2) This field records the cycle type of the most recent eSPI transaction. Position */
#define ESPI_IO_PC_LAST_CYCLE_DW2_PC_CYCLE_TYPE_Msk (0xFFU << ESPI_IO_PC_LAST_CYCLE_DW2_PC_CYCLE_TYPE_Pos)  /**< (ESPI_IO_PC_LAST_CYCLE_DW2) This field records the cycle type of the most recent eSPI transaction. Mask */
#define ESPI_IO_PC_LAST_CYCLE_DW2_PC_CYCLE_TYPE(value) (ESPI_IO_PC_LAST_CYCLE_DW2_PC_CYCLE_TYPE_Msk & ((value) << ESPI_IO_PC_LAST_CYCLE_DW2_PC_CYCLE_TYPE_Pos))
#define ESPI_IO_PC_LAST_CYCLE_DW2_PC_TAG_Pos  (20)                                           /**< (ESPI_IO_PC_LAST_CYCLE_DW2) This field records the tag of the most recent eSPI transaction. Position */
#define ESPI_IO_PC_LAST_CYCLE_DW2_PC_TAG_Msk  (0xFU << ESPI_IO_PC_LAST_CYCLE_DW2_PC_TAG_Pos)  /**< (ESPI_IO_PC_LAST_CYCLE_DW2) This field records the tag of the most recent eSPI transaction. Mask */
#define ESPI_IO_PC_LAST_CYCLE_DW2_PC_TAG(value) (ESPI_IO_PC_LAST_CYCLE_DW2_PC_TAG_Msk & ((value) << ESPI_IO_PC_LAST_CYCLE_DW2_PC_TAG_Pos))
#define ESPI_IO_PC_LAST_CYCLE_DW2_Msk         (0x00FFFFFFUL)                                 /**< (ESPI_IO_PC_LAST_CYCLE_DW2) Register Mask  */

/* -------- ESPI_IO_PC_ERROR_ADDRESS_DW0 : (ESPI_IO Offset: 0x10c) (R/ 32) Peripheral Channel Error Address Register (DWord 0) -------- */

typedef union
{
  struct
  {
    uint32_t PC_ERROR_ADDRESS_LSDW:32;  /**< bit:  0..31  This field records bits[31:0] of the 64 bit address of the most recent eSPI transaction that incurred an error. */
  };
  uint32_t w;
} __ESPI_IO_PC_ERROR_ADDRESS_DW0_bits_t;
