ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
#define ESPI_IO_PC_ERROR_ADDRESS_DW0_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_PC_ERROR_ADDRESS_DW0) Peripheral Channel Error Address Register (DWord 0)  Reset Value */

#define ESPI_IO_PC_ERROR_ADDRESS_DW0_PC_ERROR_ADDRESS_LSDW_Pos (0)                                            /**< (ESPI_IO_PC_ERROR_ADDRESS_DW0) This field records bits[31:0] of the 64 bit address of the most recent eSPI transaction that incurred an error. Position */
#define ESPI_IO_PC_ERROR_ADDRESS_DW0_PC_ERROR_ADDRESS_LSDW_Msk (0xFFFFFFFFU << ESPI_IO_PC_ERROR_ADDRESS_DW0_PC_ERROR_ADDRESS_LSDW_Pos)  /**< (ESPI_IO_PC_ERROR_ADDRESS_DW0) This field records bits[31:0] of the 64 bit address of the most recent eSPI transaction that incurred an error. Mask */
#define ESPI_IO_PC_ERROR_ADDRESS_DW0_PC_ERROR_ADDRESS_LSDW(value) (ESPI_IO_PC_ERROR_ADDRESS_DW0_PC_ERROR_ADDRESS_LSDW_Msk & ((value) << ESPI_IO_PC_ERROR_ADDRESS_DW0_PC_ERROR_ADDRESS_LSDW_Pos))
#define ESPI_IO_PC_ERROR_ADDRESS_DW0_Msk      (0xFFFFFFFFUL)                                 /**< (ESPI_IO_PC_ERROR_ADDRESS_DW0) Register Mask  */

/* -------- ESPI_IO_PC_ERROR_ADDRESS_DW1 : (ESPI_IO Offset: 0x110) (R/ 32) Peripheral Channel Error Address Register (DWord 1) -------- */

typedef union
{
  struct
  {
    uint32_t PC_ERROR_ADDRESS_MSDW:32;  /**< bit:  0..31  This field records bits[63:32] of the 64 bit  address of the most recent eSPI transaction that incurred an error. */
  };
  uint32_t w;
} __ESPI_IO_PC_ERROR_ADDRESS_DW1_bits_t;
#define ESPI_IO_PC_ERROR_ADDRESS_DW1_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_PC_ERROR_ADDRESS_DW1) Peripheral Channel Error Address Register (DWord 1)  Reset Value */

#define ESPI_IO_PC_ERROR_ADDRESS_DW1_PC_ERROR_ADDRESS_MSDW_Pos (0)                                            /**< (ESPI_IO_PC_ERROR_ADDRESS_DW1) This field records bits[63:32] of the 64 bit  address of the most recent eSPI transaction that incurred an error. Position */
#define ESPI_IO_PC_ERROR_ADDRESS_DW1_PC_ERROR_ADDRESS_MSDW_Msk (0xFFFFFFFFU << ESPI_IO_PC_ERROR_ADDRESS_DW1_PC_ERROR_ADDRESS_MSDW_Pos)  /**< (ESPI_IO_PC_ERROR_ADDRESS_DW1) This field records bits[63:32] of the 64 bit  address of the most recent eSPI transaction that incurred an error. Mask */
#define ESPI_IO_PC_ERROR_ADDRESS_DW1_PC_ERROR_ADDRESS_MSDW(value) (ESPI_IO_PC_ERROR_ADDRESS_DW1_PC_ERROR_ADDRESS_MSDW_Msk & ((value) << ESPI_IO_PC_ERROR_ADDRESS_DW1_PC_ERROR_ADDRESS_MSDW_Pos))
#define ESPI_IO_PC_ERROR_ADDRESS_DW1_Msk      (0xFFFFFFFFUL)                                 /**< (ESPI_IO_PC_ERROR_ADDRESS_DW1) Register Mask  */

/* -------- ESPI_IO_PC_STATUS : (ESPI_IO Offset: 0x114) (R/W 32) Peripheral Channel Status Register -------- */

typedef union
{
  struct
  {
    uint32_t PC_VIRTUAL_READ:1;         /**< bit:      0  This bit is set whenever a eSPI read transaction targeting a Logical Device with an I/O BAR or a Memory BAR in which the VIRTUALIZED bit\n      is set. (R/WC) */
    uint32_t PC_VIRTUAL_WRITE:1;        /**< bit:      1  This bit is set whenever a eSPI write transaction targeting a Logical Device with an I/O BAR or a Memory BAR in which the VIRTUALIZED bit\n      is set. (R/WC) */
    uint32_t PC_VIRTUAL_TYPE:1;         /**< bit:      2  This bit returns the type of Virtualized eSPI transaction that is\n      1=Peripheral Channel Memory Address access\n      0=Peripheral Channel I/O Address access. */
    uint32_t :5;                        /**< bit:   3..7  Reserved                                      */
    uint32_t PC_VIRTUAL_BAR_LDN:6;      /**< bit:  8..13  This field returns the Logical Device Number of the device targeted by the most recent virtual transaction. */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t PC_BUS_ERROR:1;            /**< bit:     16  This bit is set to '1' whenever an eSPI access causes an internal bus error. Once set, it remains set until cleared by being written\n      with a 1. (R/WC) */
    uint32_t BAR_CONFLICT:1;            /**< bit:     17  This bit is set to '1' whenever a BAR conflict occurs on an eSPI address. A BAR conflict occurs when more than one BAR matches\n      the address of an eSPI transaction. Once set, it remains set until cleared by being written with a 1. (R/WC) */
    uint32_t :6;                        /**< bit: 18..23  Reserved                                      */
    uint32_t PC_CHANNEL_ENABLE_STATUS:1;  /**< bit:     24  This bit reflects the Host writable configuration field. */
    uint32_t PC_ENABLE_CHANGE:1;        /**< bit:     25  This bit is set to '1' whenever the field PC_CHANNEL_ENABLE_STATUS in this register changes. Once set, it remains set until cleared by being written with a 1. (R/WC) */
    uint32_t :1;                        /**< bit:     26  Reserved                                      */
    uint32_t PC_MASTERING_ENABLE_STATUS:1;  /**< bit:     27  This bit is 1 if three bits in the Peripheral Channel Capabilities and Configurations register, Peripheral Channel Mastering Enable,\n      Peripheral Channel Ready and Peripheral Channel Enable, are all 1, and 0 otherwise. */
    uint32_t PC_MASTERING_ENABLE_CHANGE:1;  /**< bit:     28  This bit is set to '1' whenever the field PC_MASTERING_ENABLE_STATUS in this register changes. Once set, it remains set until cleared by being written with a 1 (R/WC) */
    uint32_t :3;                        /**< bit: 29..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_PC_STATUS_bits_t;
#define ESPI_IO_PC_STATUS_RESETVALUE        (0x00U)                                       /**<  (ESPI_IO_PC_STATUS) Peripheral Channel Status Register  Reset Value */

#define ESPI_IO_PC_STATUS_PC_VIRTUAL_READ_Pos (0)                                            /**< (ESPI_IO_PC_STATUS) This bit is set whenever a eSPI read transaction targeting a Logical Device with an I/O BAR or a Memory BAR in which the VIRTUALIZED bit\n      is set. (R/WC) Position */
#define ESPI_IO_PC_STATUS_PC_VIRTUAL_READ_Msk (0x1U << ESPI_IO_PC_STATUS_PC_VIRTUAL_READ_Pos)  /**< (ESPI_IO_PC_STATUS) This bit is set whenever a eSPI read transaction targeting a Logical Device with an I/O BAR or a Memory BAR in which the VIRTUALIZED bit\n      is set. (R/WC) Mask */
#define ESPI_IO_PC_STATUS_PC_VIRTUAL_WRITE_Pos (1)                                            /**< (ESPI_IO_PC_STATUS) This bit is set whenever a eSPI write transaction targeting a Logical Device with an I/O BAR or a Memory BAR in which the VIRTUALIZED bit\n      is set. (R/WC) Position */
#define ESPI_IO_PC_STATUS_PC_VIRTUAL_WRITE_Msk (0x1U << ESPI_IO_PC_STATUS_PC_VIRTUAL_WRITE_Pos)  /**< (ESPI_IO_PC_STATUS) This bit is set whenever a eSPI write transaction targeting a Logical Device with an I/O BAR or a Memory BAR in which the VIRTUALIZED bit\n      is set. (R/WC) Mask */
#define ESPI_IO_PC_STATUS_PC_VIRTUAL_TYPE_Pos (2)                                            /**< (ESPI_IO_PC_STATUS) This bit returns the type of Virtualized eSPI transaction that is\n      1=Peripheral Channel Memory Address access\n      0=Peripheral Channel I/O Address access. Position */
#define ESPI_IO_PC_STATUS_PC_VIRTUAL_TYPE_Msk (0x1U << ESPI_IO_PC_STATUS_PC_VIRTUAL_TYPE_Pos)  /**< (ESPI_IO_PC_STATUS) This bit returns the type of Virtualized eSPI transaction that is\n      1=Peripheral Channel Memory Address access\n      0=Peripheral Channel I/O Address access. Mask */
#define ESPI_IO_PC_STATUS_PC_VIRTUAL_BAR_LDN_Pos (8)                                            /**< (ESPI_IO_PC_STATUS) This field returns the Logical Device Number of the device targeted by the most recent virtual transaction. Position */
#define ESPI_IO_PC_STATUS_PC_VIRTUAL_BAR_LDN_Msk (0x3FU << ESPI_IO_PC_STATUS_PC_VIRTUAL_BAR_LDN_Pos)  /**< (ESPI_IO_PC_STATUS) This field returns the Logical Device Number of the device targeted by the most recent virtual transaction. Mask */
#define ESPI_IO_PC_STATUS_PC_VIRTUAL_BAR_LDN(value) (ESPI_IO_PC_STATUS_PC_VIRTUAL_BAR_LDN_Msk & ((value) << ESPI_IO_PC_STATUS_PC_VIRTUAL_BAR_LDN_Pos))
#define ESPI_IO_PC_STATUS_PC_BUS_ERROR_Pos    (16)                                           /**< (ESPI_IO_PC_STATUS) This bit is set to '1' whenever an eSPI access causes an internal bus error. Once set, it remains set until cleared by being written\n      with a 1. (R/WC) Position */
#define ESPI_IO_PC_STATUS_PC_BUS_ERROR_Msk    (0x1U << ESPI_IO_PC_STATUS_PC_BUS_ERROR_Pos)   /**< (ESPI_IO_PC_STATUS) This bit is set to '1' whenever an eSPI access causes an internal bus error. Once set, it remains set until cleared by being written\n      with a 1. (R/WC) Mask */
#define ESPI_IO_PC_STATUS_BAR_CONFLICT_Pos    (17)                                           /**< (ESPI_IO_PC_STATUS) This bit is set to '1' whenever a BAR conflict occurs on an eSPI address. A BAR conflict occurs when more than one BAR matches\n      the address of an eSPI transaction. Once set, it remains set until cleared by being written with a 1. (R/WC) Position */
#define ESPI_IO_PC_STATUS_BAR_CONFLICT_Msk    (0x1U << ESPI_IO_PC_STATUS_BAR_CONFLICT_Pos)   /**< (ESPI_IO_PC_STATUS) This bit is set to '1' whenever a BAR conflict occurs on an eSPI address. A BAR conflict occurs when more than one BAR matches\n      the address of an eSPI transaction. Once set, it remains set until cleared by being written with a 1. (R/WC) Mask */
#define ESPI_IO_PC_STATUS_PC_CHANNEL_ENABLE_STATUS_Pos (24)                                           /**< (ESPI_IO_PC_STATUS) This bit reflects the Host writable configuration field. Position */
#define ESPI_IO_PC_STATUS_PC_CHANNEL_ENABLE_STATUS_Msk (0x1U << ESPI_IO_PC_STATUS_PC_CHANNEL_ENABLE_STATUS_Pos)  /**< (ESPI_IO_PC_STATUS) This bit reflects the Host writable configuration field. Mask */
#define ESPI_IO_PC_STATUS_PC_ENABLE_CHANGE_Pos (25)                                           /**< (ESPI_IO_PC_STATUS) This bit is set to '1' whenever the field PC_CHANNEL_ENABLE_STATUS in this register changes. Once set, it remains set until cleared by being written with a 1. (R/WC) Position */
#define ESPI_IO_PC_STATUS_PC_ENABLE_CHANGE_Msk (0x1U << ESPI_IO_PC_STATUS_PC_ENABLE_CHANGE_Pos)  /**< (ESPI_IO_PC_STATUS) This bit is set to '1' whenever the field PC_CHANNEL_ENABLE_STATUS in this register changes. Once set, it remains set until cleared by being written with a 1. (R/WC) Mask */
#define ESPI_IO_PC_STATUS_PC_MASTERING_ENABLE_STATUS_Pos (27)                                           /**< (ESPI_IO_PC_STATUS) This bit is 1 if three bits in the Peripheral Channel Capabilities and Configurations register, Peripheral Channel Mastering Enable,\n      Peripheral Channel Ready and Peripheral Channel Enable, are all 1, and 0 otherwise. Position */
#define ESPI_IO_PC_STATUS_PC_MASTERING_ENABLE_STATUS_Msk (0x1U << ESPI_IO_PC_STATUS_PC_MASTERING_ENABLE_STATUS_Pos)  /**< (ESPI_IO_PC_STATUS) This bit is 1 if three bits in the Peripheral Channel Capabilities and Configurations register, Peripheral Channel Mastering Enable,\n      Peripheral Channel Ready and Peripheral Channel Enable, are all 1, and 0 otherwise. Mask */
#define ESPI_IO_PC_STATUS_PC_MASTERING_ENABLE_CHANGE_Pos (28)                                           /**< (ESPI_IO_PC_STATUS) This bit is set to '1' whenever the field PC_MASTERING_ENABLE_STATUS in this register changes. Once set, it remains set until cleared by being written with a 1 (R/WC) Position */
#define ESPI_IO_PC_STATUS_PC_MASTERING_ENABLE_CHANGE_Msk (0x1U << ESPI_IO_PC_STATUS_PC_MASTERING_ENABLE_CHANGE_Pos)  /**< (ESPI_IO_PC_STATUS) This bit is set to '1' whenever the field PC_MASTERING_ENABLE_STATUS in this register changes. Once set, it remains set until cleared by being written with a 1 (R/WC) Mask */
#define ESPI_IO_PC_STATUS_Msk                 (0x1B033F07UL)                                 /**< (ESPI_IO_PC_STATUS) Register Mask  */

/* -------- ESPI_IO_PC_INT_ENABLE : (ESPI_IO Offset: 0x118) (R/W 32) Peripheral Channel Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t PC_VIRTUAL_READ_ENABLE:1;  /**< bit:      0  When this bit is '1' an interrupt is generated when the bit PC_VIRTUAL_READ in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. */
    uint32_t PC_VIRTUAL_WRITE_ENABLE:1;  /**< bit:      1  When this bit is '1' an interrupt is generated when the bit PC_VIRTUAL_WRITE in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. */
    uint32_t :14;                       /**< bit:  2..15  Reserved                                      */
    uint32_t PC_BUS_ERROR_ENABLE:1;     /**< bit:     16  When this bit is '1' an interrupt is generated when the bit PC_BUS_ERROR in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. */
    uint32_t BAR_CONFLICT_ENABLE:1;     /**< bit:     17  When this bit is '1' an interrupt is generated when the bit BAR_CONFLICT in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. */
    uint32_t :7;                        /**< bit: 18..24  Reserved                                      */
    uint32_t PC_ENABLE_CHANGE_ENABLE:1;  /**< bit:     25  When this bit is '1' an interrupt is generated when the bit PC_ENABLE_CHANGE in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. */
    uint32_t :2;                        /**< bit: 26..27  Reserved                                      */
    uint32_t PC_MASTERING_ENABLE_CHANGE_ENABLE:1;  /**< bit:     28  When this bit is '1' an interrupt is generated when the bit PC_MASTERING_ENABLE_CHANGE in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. */
    uint32_t :3;                        /**< bit: 29..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_PC_INT_ENABLE_bits_t;
#define ESPI_IO_PC_INT_ENABLE_RESETVALUE    (0x00U)                                       /**<  (ESPI_IO_PC_INT_ENABLE) Peripheral Channel Interrupt Enable Register  Reset Value */

#define ESPI_IO_PC_INT_ENABLE_PC_VIRTUAL_READ_ENABLE_Pos (0)                                            /**< (ESPI_IO_PC_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit PC_VIRTUAL_READ in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. Position */
#define ESPI_IO_PC_INT_ENABLE_PC_VIRTUAL_READ_ENABLE_Msk (0x1U << ESPI_IO_PC_INT_ENABLE_PC_VIRTUAL_READ_ENABLE_Pos)  /**< (ESPI_IO_PC_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit PC_VIRTUAL_READ in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. Mask */
#define ESPI_IO_PC_INT_ENABLE_PC_VIRTUAL_WRITE_ENABLE_Pos (1)                                            /**< (ESPI_IO_PC_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit PC_VIRTUAL_WRITE in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. Position */
#define ESPI_IO_PC_INT_ENABLE_PC_VIRTUAL_WRITE_ENABLE_Msk (0x1U << ESPI_IO_PC_INT_ENABLE_PC_VIRTUAL_WRITE_ENABLE_Pos)  /**< (ESPI_IO_PC_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit PC_VIRTUAL_WRITE in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. Mask */
#define ESPI_IO_PC_INT_ENABLE_PC_BUS_ERROR_ENABLE_Pos (16)                                           /**< (ESPI_IO_PC_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit PC_BUS_ERROR in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. Position */
#define ESPI_IO_PC_INT_ENABLE_PC_BUS_ERROR_ENABLE_Msk (0x1U << ESPI_IO_PC_INT_ENABLE_PC_BUS_ERROR_ENABLE_Pos)  /**< (ESPI_IO_PC_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit PC_BUS_ERROR in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. Mask */
#define ESPI_IO_PC_INT_ENABLE_BAR_CONFLICT_ENABLE_Pos (17)                                           /**< (ESPI_IO_PC_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit BAR_CONFLICT in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. Position */
#define ESPI_IO_PC_INT_ENABLE_BAR_CONFLICT_ENABLE_Msk (0x1U << ESPI_IO_PC_INT_ENABLE_BAR_CONFLICT_ENABLE_Pos)  /**< (ESPI_IO_PC_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit BAR_CONFLICT in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. Mask */
#define ESPI_IO_PC_INT_ENABLE_PC_ENABLE_CHANGE_ENABLE_Pos (25)                                           /**< (ESPI_IO_PC_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit PC_ENABLE_CHANGE in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. Position */
#define ESPI_IO_PC_INT_ENABLE_PC_ENABLE_CHANGE_ENABLE_Msk (0x1U << ESPI_IO_PC_INT_ENABLE_PC_ENABLE_CHANGE_ENABLE_Pos)  /**< (ESPI_IO_PC_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit PC_ENABLE_CHANGE in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. Mask */
#define ESPI_IO_PC_INT_ENABLE_PC_MASTERING_ENABLE_CHANGE_ENABLE_Pos (28)                                           /**< (ESPI_IO_PC_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit PC_MASTERING_ENABLE_CHANGE in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. Position */
#define ESPI_IO_PC_INT_ENABLE_PC_MASTERING_ENABLE_CHANGE_ENABLE_Msk (0x1U << ESPI_IO_PC_INT_ENABLE_PC_MASTERING_ENABLE_CHANGE_ENABLE_Pos)  /**< (ESPI_IO_PC_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit PC_MASTERING_ENABLE_CHANGE in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. Mask */
#define ESPI_IO_PC_INT_ENABLE_Msk             (0x12030003UL)                                 /**< (ESPI_IO_PC_INT_ENABLE) Register Mask  */

