ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
/* -------- ESPI_IO_BAR_INHIBIT_DW0 : (ESPI_IO Offset: 0x120) (R/W 32) BAR Inhibit Register (DWord 0) -------- */

typedef union
{
  struct
  {
    uint32_t BAR_INHIBIT_LSDW:32;       /**< bit:  0..31  When bit Di of BAR_Inhibit is 1, the BAR for Logical Device i is disabled and its addresses will not be claimed on the eSPI\n      bus, independent of the value of the Valid bit in the BAR. The BAR Inhibit function applies to both I/O transactions and Memory transactions. */
  };
  uint32_t w;
} __ESPI_IO_BAR_INHIBIT_DW0_bits_t;
#define ESPI_IO_BAR_INHIBIT_DW0_RESETVALUE  (0x00U)                                       /**<  (ESPI_IO_BAR_INHIBIT_DW0) BAR Inhibit Register (DWord 0)  Reset Value */

#define ESPI_IO_BAR_INHIBIT_DW0_BAR_INHIBIT_LSDW_Pos (0)                                            /**< (ESPI_IO_BAR_INHIBIT_DW0) When bit Di of BAR_Inhibit is 1, the BAR for Logical Device i is disabled and its addresses will not be claimed on the eSPI\n      bus, independent of the value of the Valid bit in the BAR. The BAR Inhibit function applies to both I/O transactions and Memory transactions. Position */
#define ESPI_IO_BAR_INHIBIT_DW0_BAR_INHIBIT_LSDW_Msk (0xFFFFFFFFU << ESPI_IO_BAR_INHIBIT_DW0_BAR_INHIBIT_LSDW_Pos)  /**< (ESPI_IO_BAR_INHIBIT_DW0) When bit Di of BAR_Inhibit is 1, the BAR for Logical Device i is disabled and its addresses will not be claimed on the eSPI\n      bus, independent of the value of the Valid bit in the BAR. The BAR Inhibit function applies to both I/O transactions and Memory transactions. Mask */
#define ESPI_IO_BAR_INHIBIT_DW0_BAR_INHIBIT_LSDW(value) (ESPI_IO_BAR_INHIBIT_DW0_BAR_INHIBIT_LSDW_Msk & ((value) << ESPI_IO_BAR_INHIBIT_DW0_BAR_INHIBIT_LSDW_Pos))
#define ESPI_IO_BAR_INHIBIT_DW0_Msk           (0xFFFFFFFFUL)                                 /**< (ESPI_IO_BAR_INHIBIT_DW0) Register Mask  */

/* -------- ESPI_IO_BAR_INHIBIT_DW1 : (ESPI_IO Offset: 0x124) (R/W 32) BAR Inhibit Register (DWord 1) -------- */

typedef union
{
  struct
  {
    uint32_t BAR_INHIBIT_MSDW:32;       /**< bit:  0..31  When bit Di of BAR_Inhibit is 1, the BAR for Logical Device i is disabled and its addresses will not be claimed on the eSPI\n      bus, independent of the value of the Valid bit in the BAR. The BAR Inhibit function applies to both I/O transactions and Memory transactions. */
  };
  uint32_t w;
} __ESPI_IO_BAR_INHIBIT_DW1_bits_t;
#define ESPI_IO_BAR_INHIBIT_DW1_RESETVALUE  (0x00U)                                       /**<  (ESPI_IO_BAR_INHIBIT_DW1) BAR Inhibit Register (DWord 1)  Reset Value */

#define ESPI_IO_BAR_INHIBIT_DW1_BAR_INHIBIT_MSDW_Pos (0)                                            /**< (ESPI_IO_BAR_INHIBIT_DW1) When bit Di of BAR_Inhibit is 1, the BAR for Logical Device i is disabled and its addresses will not be claimed on the eSPI\n      bus, independent of the value of the Valid bit in the BAR. The BAR Inhibit function applies to both I/O transactions and Memory transactions. Position */
#define ESPI_IO_BAR_INHIBIT_DW1_BAR_INHIBIT_MSDW_Msk (0xFFFFFFFFU << ESPI_IO_BAR_INHIBIT_DW1_BAR_INHIBIT_MSDW_Pos)  /**< (ESPI_IO_BAR_INHIBIT_DW1) When bit Di of BAR_Inhibit is 1, the BAR for Logical Device i is disabled and its addresses will not be claimed on the eSPI\n      bus, independent of the value of the Valid bit in the BAR. The BAR Inhibit function applies to both I/O transactions and Memory transactions. Mask */
#define ESPI_IO_BAR_INHIBIT_DW1_BAR_INHIBIT_MSDW(value) (ESPI_IO_BAR_INHIBIT_DW1_BAR_INHIBIT_MSDW_Msk & ((value) << ESPI_IO_BAR_INHIBIT_DW1_BAR_INHIBIT_MSDW_Pos))
#define ESPI_IO_BAR_INHIBIT_DW1_Msk           (0xFFFFFFFFUL)                                 /**< (ESPI_IO_BAR_INHIBIT_DW1) Register Mask  */

/* -------- ESPI_IO_ESPI_BAR_INIT : (ESPI_IO Offset: 0x128) (R/W 32) eSPI BAR Init Register -------- */

typedef union
{
  struct
  {
    uint32_t BAR_INIT:16;               /**< bit:  0..15  This field is loaded into the Base Address Register register for Logical Device Ch (eSPI, I/O Configuration Port) on RESET_SIO. */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_ESPI_BAR_INIT_bits_t;
#define ESPI_IO_ESPI_BAR_INIT_RESETVALUE    (0x2EU)                                       /**<  (ESPI_IO_ESPI_BAR_INIT) eSPI BAR Init Register  Reset Value */

#define ESPI_IO_ESPI_BAR_INIT_BAR_INIT_Pos    (0)                                            /**< (ESPI_IO_ESPI_BAR_INIT) This field is loaded into the Base Address Register register for Logical Device Ch (eSPI, I/O Configuration Port) on RESET_SIO. Position */
#define ESPI_IO_ESPI_BAR_INIT_BAR_INIT_Msk    (0xFFFFU << ESPI_IO_ESPI_BAR_INIT_BAR_INIT_Pos)  /**< (ESPI_IO_ESPI_BAR_INIT) This field is loaded into the Base Address Register register for Logical Device Ch (eSPI, I/O Configuration Port) on RESET_SIO. Mask */
#define ESPI_IO_ESPI_BAR_INIT_BAR_INIT(value) (ESPI_IO_ESPI_BAR_INIT_BAR_INIT_Msk & ((value) << ESPI_IO_ESPI_BAR_INIT_BAR_INIT_Pos))
#define ESPI_IO_ESPI_BAR_INIT_Msk             (0x0000FFFFUL)                                 /**< (ESPI_IO_ESPI_BAR_INIT) Register Mask  */

/* -------- ESPI_IO_EC_IRQ : (ESPI_IO Offset: 0x12c) (R/W 32) EC IRQ Register -------- */

typedef union
{
  struct
  {
    uint32_t EC_IRQ:1;                  /**< bit:      0  This bit can be used as a firmware-controlled interrupt source for the EC. When the EC entry in the IRQ Assignment Table is set to a\n      valid IRQ number, changes in this bit will be transmitted to the Host over a Virtual Wire IRQ channel. */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_EC_IRQ_bits_t;
#define ESPI_IO_EC_IRQ_RESETVALUE           (0x2EU)                                       /**<  (ESPI_IO_EC_IRQ) EC IRQ Register  Reset Value */

#define ESPI_IO_EC_IRQ_EC_IRQ_Pos             (0)                                            /**< (ESPI_IO_EC_IRQ) This bit can be used as a firmware-controlled interrupt source for the EC. When the EC entry in the IRQ Assignment Table is set to a\n      valid IRQ number, changes in this bit will be transmitted to the Host over a Virtual Wire IRQ channel. Position */
#define ESPI_IO_EC_IRQ_EC_IRQ_Msk             (0x1U << ESPI_IO_EC_IRQ_EC_IRQ_Pos)            /**< (ESPI_IO_EC_IRQ) This bit can be used as a firmware-controlled interrupt source for the EC. When the EC entry in the IRQ Assignment Table is set to a\n      valid IRQ number, changes in this bit will be transmitted to the Host over a Virtual Wire IRQ channel. Mask */
#define ESPI_IO_EC_IRQ_Msk                    (0x00000001UL)                                 /**< (ESPI_IO_EC_IRQ) Register Mask  */

/* -------- ESPI_IO_BASE_ADDRESS : (ESPI_IO Offset: 0x134) (R/W 32) eSPI I/O Base Address Register -------- */

typedef union
{
  struct
  {
    uint32_t MASK:8;                    /**< bit:   0..7  These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. */
    uint32_t LOGICAL_DEVICE_NUMBER:6;   /**< bit:  8..13  These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t VIRTUALIZED:1;             /**< bit:     16  1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. */
    uint32_t :15;                       /**< bit: 17..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_BASE_ADDRESS_bits_t;
