ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
/* -------- ESPI_IO_PORT80_1_BASE_ADDRESS : (ESPI_IO Offset: 0x178) (R/W 32) I/O Base Address Register -------- */

typedef union
{
  struct
  {
    uint32_t MASK:8;                    /**< bit:   0..7  These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. */
    uint32_t LOGICAL_DEVICE_NUMBER:6;   /**< bit:  8..13  These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t VIRTUALIZED:1;             /**< bit:     16  1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. */
    uint32_t :15;                       /**< bit: 17..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_PORT80_1_BASE_ADDRESS_bits_t;
#define ESPI_IO_PORT80_1_BASE_ADDRESS_RESETVALUE (0x2100U)                                     /**<  (ESPI_IO_PORT80_1_BASE_ADDRESS) I/O Base Address Register  Reset Value */

#define ESPI_IO_PORT80_1_BASE_ADDRESS_MASK_Pos (0)                                            /**< (ESPI_IO_PORT80_1_BASE_ADDRESS) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Position */
#define ESPI_IO_PORT80_1_BASE_ADDRESS_MASK_Msk (0xFFU << ESPI_IO_PORT80_1_BASE_ADDRESS_MASK_Pos)  /**< (ESPI_IO_PORT80_1_BASE_ADDRESS) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Mask */
#define ESPI_IO_PORT80_1_BASE_ADDRESS_MASK(value) (ESPI_IO_PORT80_1_BASE_ADDRESS_MASK_Msk & ((value) << ESPI_IO_PORT80_1_BASE_ADDRESS_MASK_Pos))
#define ESPI_IO_PORT80_1_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos (8)                                            /**< (ESPI_IO_PORT80_1_BASE_ADDRESS) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Position */
#define ESPI_IO_PORT80_1_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Msk (0x3FU << ESPI_IO_PORT80_1_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos)  /**< (ESPI_IO_PORT80_1_BASE_ADDRESS) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Mask */
#define ESPI_IO_PORT80_1_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER(value) (ESPI_IO_PORT80_1_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Msk & ((value) << ESPI_IO_PORT80_1_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos))
#define ESPI_IO_PORT80_1_BASE_ADDRESS_VIRTUALIZED_Pos (16)                                           /**< (ESPI_IO_PORT80_1_BASE_ADDRESS) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Position */
#define ESPI_IO_PORT80_1_BASE_ADDRESS_VIRTUALIZED_Msk (0x1U << ESPI_IO_PORT80_1_BASE_ADDRESS_VIRTUALIZED_Pos)  /**< (ESPI_IO_PORT80_1_BASE_ADDRESS) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Mask */
#define ESPI_IO_PORT80_1_BASE_ADDRESS_Msk     (0x00013FFFUL)                                 /**< (ESPI_IO_PORT80_1_BASE_ADDRESS) Register Mask  */

/* -------- ESPI_IO_RTC_BASE_ADDRESS : (ESPI_IO Offset: 0x17c) (R/W 32) I/O Base Address Register -------- */

typedef union
{
  struct
  {
    uint32_t MASK:8;                    /**< bit:   0..7  These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. */
    uint32_t LOGICAL_DEVICE_NUMBER:6;   /**< bit:  8..13  These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t VIRTUALIZED:1;             /**< bit:     16  1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. */
    uint32_t :15;                       /**< bit: 17..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_RTC_BASE_ADDRESS_bits_t;
#define ESPI_IO_RTC_BASE_ADDRESS_RESETVALUE (0x141FU)                                     /**<  (ESPI_IO_RTC_BASE_ADDRESS) I/O Base Address Register  Reset Value */

#define ESPI_IO_RTC_BASE_ADDRESS_MASK_Pos     (0)                                            /**< (ESPI_IO_RTC_BASE_ADDRESS) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Position */
#define ESPI_IO_RTC_BASE_ADDRESS_MASK_Msk     (0xFFU << ESPI_IO_RTC_BASE_ADDRESS_MASK_Pos)   /**< (ESPI_IO_RTC_BASE_ADDRESS) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Mask */
#define ESPI_IO_RTC_BASE_ADDRESS_MASK(value)  (ESPI_IO_RTC_BASE_ADDRESS_MASK_Msk & ((value) << ESPI_IO_RTC_BASE_ADDRESS_MASK_Pos))
#define ESPI_IO_RTC_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos (8)                                            /**< (ESPI_IO_RTC_BASE_ADDRESS) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Position */
#define ESPI_IO_RTC_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Msk (0x3FU << ESPI_IO_RTC_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos)  /**< (ESPI_IO_RTC_BASE_ADDRESS) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Mask */
#define ESPI_IO_RTC_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER(value) (ESPI_IO_RTC_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Msk & ((value) << ESPI_IO_RTC_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos))
#define ESPI_IO_RTC_BASE_ADDRESS_VIRTUALIZED_Pos (16)                                           /**< (ESPI_IO_RTC_BASE_ADDRESS) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Position */
#define ESPI_IO_RTC_BASE_ADDRESS_VIRTUALIZED_Msk (0x1U << ESPI_IO_RTC_BASE_ADDRESS_VIRTUALIZED_Pos)  /**< (ESPI_IO_RTC_BASE_ADDRESS) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Mask */
#define ESPI_IO_RTC_BASE_ADDRESS_Msk          (0x00013FFFUL)                                 /**< (ESPI_IO_RTC_BASE_ADDRESS) Register Mask  */

/* -------- ESPI_IO_UART_2_BASE_ADDRESS : (ESPI_IO Offset: 0x188) (R/W 32) I/O Base Address Register -------- */

typedef union
{
  struct
  {
    uint32_t MASK:8;                    /**< bit:   0..7  These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. */
    uint32_t LOGICAL_DEVICE_NUMBER:6;   /**< bit:  8..13  These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t VIRTUALIZED:1;             /**< bit:     16  1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. */
    uint32_t :15;                       /**< bit: 17..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_UART_2_BASE_ADDRESS_bits_t;
#define ESPI_IO_UART_2_BASE_ADDRESS_RESETVALUE (0xB07U)                                      /**<  (ESPI_IO_UART_2_BASE_ADDRESS) I/O Base Address Register  Reset Value */

#define ESPI_IO_UART_2_BASE_ADDRESS_MASK_Pos  (0)                                            /**< (ESPI_IO_UART_2_BASE_ADDRESS) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Position */
#define ESPI_IO_UART_2_BASE_ADDRESS_MASK_Msk  (0xFFU << ESPI_IO_UART_2_BASE_ADDRESS_MASK_Pos)  /**< (ESPI_IO_UART_2_BASE_ADDRESS) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Mask */
#define ESPI_IO_UART_2_BASE_ADDRESS_MASK(value) (ESPI_IO_UART_2_BASE_ADDRESS_MASK_Msk & ((value) << ESPI_IO_UART_2_BASE_ADDRESS_MASK_Pos))
#define ESPI_IO_UART_2_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos (8)                                            /**< (ESPI_IO_UART_2_BASE_ADDRESS) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Position */
#define ESPI_IO_UART_2_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Msk (0x3FU << ESPI_IO_UART_2_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos)  /**< (ESPI_IO_UART_2_BASE_ADDRESS) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Mask */
#define ESPI_IO_UART_2_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER(value) (ESPI_IO_UART_2_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Msk & ((value) << ESPI_IO_UART_2_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos))
#define ESPI_IO_UART_2_BASE_ADDRESS_VIRTUALIZED_Pos (16)                                           /**< (ESPI_IO_UART_2_BASE_ADDRESS) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Position */
#define ESPI_IO_UART_2_BASE_ADDRESS_VIRTUALIZED_Msk (0x1U << ESPI_IO_UART_2_BASE_ADDRESS_VIRTUALIZED_Pos)  /**< (ESPI_IO_UART_2_BASE_ADDRESS) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Mask */
#define ESPI_IO_UART_2_BASE_ADDRESS_Msk       (0x00013FFFUL)                                 /**< (ESPI_IO_UART_2_BASE_ADDRESS) Register Mask  */

/* -------- ESPI_IO_GLUE_BASE_ADDRESS : (ESPI_IO Offset: 0x18c) (R/W 32) I/O Base Address Register -------- */

typedef union
{
  struct
  {
    uint32_t MASK:8;                    /**< bit:   0..7  These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. */
    uint32_t LOGICAL_DEVICE_NUMBER:6;   /**< bit:  8..13  These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t VIRTUALIZED:1;             /**< bit:     16  1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. */
    uint32_t :15;                       /**< bit: 17..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_GLUE_BASE_ADDRESS_bits_t;
#define ESPI_IO_GLUE_BASE_ADDRESS_RESETVALUE (0xF1FU)                                      /**<  (ESPI_IO_GLUE_BASE_ADDRESS) I/O Base Address Register  Reset Value */

