ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
#define ESPI_IO_GLUE_BASE_ADDRESS_MASK_Pos    (0)                                            /**< (ESPI_IO_GLUE_BASE_ADDRESS) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Position */
#define ESPI_IO_GLUE_BASE_ADDRESS_MASK_Msk    (0xFFU << ESPI_IO_GLUE_BASE_ADDRESS_MASK_Pos)  /**< (ESPI_IO_GLUE_BASE_ADDRESS) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Mask */
#define ESPI_IO_GLUE_BASE_ADDRESS_MASK(value) (ESPI_IO_GLUE_BASE_ADDRESS_MASK_Msk & ((value) << ESPI_IO_GLUE_BASE_ADDRESS_MASK_Pos))
#define ESPI_IO_GLUE_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos (8)                                            /**< (ESPI_IO_GLUE_BASE_ADDRESS) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Position */
#define ESPI_IO_GLUE_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Msk (0x3FU << ESPI_IO_GLUE_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos)  /**< (ESPI_IO_GLUE_BASE_ADDRESS) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Mask */
#define ESPI_IO_GLUE_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER(value) (ESPI_IO_GLUE_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Msk & ((value) << ESPI_IO_GLUE_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos))
#define ESPI_IO_GLUE_BASE_ADDRESS_VIRTUALIZED_Pos (16)                                           /**< (ESPI_IO_GLUE_BASE_ADDRESS) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Position */
#define ESPI_IO_GLUE_BASE_ADDRESS_VIRTUALIZED_Msk (0x1U << ESPI_IO_GLUE_BASE_ADDRESS_VIRTUALIZED_Pos)  /**< (ESPI_IO_GLUE_BASE_ADDRESS) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Mask */
#define ESPI_IO_GLUE_BASE_ADDRESS_Msk         (0x00013FFFUL)                                 /**< (ESPI_IO_GLUE_BASE_ADDRESS) Register Mask  */

/* -------- ESPI_IO_LTR_PERIPHERAL_STATUS : (ESPI_IO Offset: 0x220) (R/W 32) LTR Peripheral Status Register -------- */

typedef union
{
  struct
  {
    uint32_t TRANSMIT_DONE_STATUS:1;    /**< bit:      0  This bit is set to '1' whenever a Transmit operation terminates (the TRANSMIT_DONE bit in this register goes from 1 to 0). (R/WC) */
    uint32_t :2;                        /**< bit:   1..2  Reserved                                      */
    uint32_t START_OVERRUN_STATUS:1;    /**< bit:      3  A Start was attempted while the TRANSMIT_BUSY bit in this register was '1'. Any Transmit in progress is immediately terminated. (R/WC) */
    uint32_t DISABLED_BY_HOST_STATUS:1;  /**< bit:      4  A '1' in this bit indicates that the last requested Transmit operation was aborted because Bus Mastering has been disabled by the Host.\n      Bus Mastering is disabled whenever the Peripheral Channel Mastering Enable bit in that register is '0', or the Peripheral Channel Enable bit is '0'. */
    uint32_t :3;                        /**< bit:   5..7  Reserved                                      */
    uint32_t TRANSMIT_BUSY:1;           /**< bit:      8  This bit is set to '1' when firmware writes '1' to the LTR_START (ltr_initiate) bit in the LTR Peripheral Control Register. It is cleared\n      by hardware when the transfer is sufficiently complete so that another packet can be transmitted. If the LTR_START bit is written to '1' while this bit\n      is also '1', then START_OVERRUN_STATUS in this register will be set to '1' and the transfer will terminate immediately. */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_LTR_PERIPHERAL_STATUS_bits_t;
#define ESPI_IO_LTR_PERIPHERAL_STATUS_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_LTR_PERIPHERAL_STATUS) LTR Peripheral Status Register  Reset Value */

#define ESPI_IO_LTR_PERIPHERAL_STATUS_TRANSMIT_DONE_STATUS_Pos (0)                                            /**< (ESPI_IO_LTR_PERIPHERAL_STATUS) This bit is set to '1' whenever a Transmit operation terminates (the TRANSMIT_DONE bit in this register goes from 1 to 0). (R/WC) Position */
#define ESPI_IO_LTR_PERIPHERAL_STATUS_TRANSMIT_DONE_STATUS_Msk (0x1U << ESPI_IO_LTR_PERIPHERAL_STATUS_TRANSMIT_DONE_STATUS_Pos)  /**< (ESPI_IO_LTR_PERIPHERAL_STATUS) This bit is set to '1' whenever a Transmit operation terminates (the TRANSMIT_DONE bit in this register goes from 1 to 0). (R/WC) Mask */
#define ESPI_IO_LTR_PERIPHERAL_STATUS_START_OVERRUN_STATUS_Pos (3)                                            /**< (ESPI_IO_LTR_PERIPHERAL_STATUS) A Start was attempted while the TRANSMIT_BUSY bit in this register was '1'. Any Transmit in progress is immediately terminated. (R/WC) Position */
#define ESPI_IO_LTR_PERIPHERAL_STATUS_START_OVERRUN_STATUS_Msk (0x1U << ESPI_IO_LTR_PERIPHERAL_STATUS_START_OVERRUN_STATUS_Pos)  /**< (ESPI_IO_LTR_PERIPHERAL_STATUS) A Start was attempted while the TRANSMIT_BUSY bit in this register was '1'. Any Transmit in progress is immediately terminated. (R/WC) Mask */
#define ESPI_IO_LTR_PERIPHERAL_STATUS_DISABLED_BY_HOST_STATUS_Pos (4)                                            /**< (ESPI_IO_LTR_PERIPHERAL_STATUS) A '1' in this bit indicates that the last requested Transmit operation was aborted because Bus Mastering has been disabled by the Host.\n      Bus Mastering is disabled whenever the Peripheral Channel Mastering Enable bit in that register is '0', or the Peripheral Channel Enable bit is '0'. Position */
#define ESPI_IO_LTR_PERIPHERAL_STATUS_DISABLED_BY_HOST_STATUS_Msk (0x1U << ESPI_IO_LTR_PERIPHERAL_STATUS_DISABLED_BY_HOST_STATUS_Pos)  /**< (ESPI_IO_LTR_PERIPHERAL_STATUS) A '1' in this bit indicates that the last requested Transmit operation was aborted because Bus Mastering has been disabled by the Host.\n      Bus Mastering is disabled whenever the Peripheral Channel Mastering Enable bit in that register is '0', or the Peripheral Channel Enable bit is '0'. Mask */
#define ESPI_IO_LTR_PERIPHERAL_STATUS_TRANSMIT_BUSY_Pos (8)                                            /**< (ESPI_IO_LTR_PERIPHERAL_STATUS) This bit is set to '1' when firmware writes '1' to the LTR_START (ltr_initiate) bit in the LTR Peripheral Control Register. It is cleared\n      by hardware when the transfer is sufficiently complete so that another packet can be transmitted. If the LTR_START bit is written to '1' while this bit\n      is also '1', then START_OVERRUN_STATUS in this register will be set to '1' and the transfer will terminate immediately. Position */
#define ESPI_IO_LTR_PERIPHERAL_STATUS_TRANSMIT_BUSY_Msk (0x1U << ESPI_IO_LTR_PERIPHERAL_STATUS_TRANSMIT_BUSY_Pos)  /**< (ESPI_IO_LTR_PERIPHERAL_STATUS) This bit is set to '1' when firmware writes '1' to the LTR_START (ltr_initiate) bit in the LTR Peripheral Control Register. It is cleared\n      by hardware when the transfer is sufficiently complete so that another packet can be transmitted. If the LTR_START bit is written to '1' while this bit\n      is also '1', then START_OVERRUN_STATUS in this register will be set to '1' and the transfer will terminate immediately. Mask */
#define ESPI_IO_LTR_PERIPHERAL_STATUS_Msk     (0x00000119UL)                                 /**< (ESPI_IO_LTR_PERIPHERAL_STATUS) Register Mask  */

