ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
/* -------- ESPI_IO_LTR_PERIPHERAL_ENABLE : (ESPI_IO Offset: 0x224) (R/W 32) LTR Peripheral Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t TRANSMIT_DONE_INT_ENABLE:1;  /**< bit:      0  When this bit is '1' an interrupt is generated when the bit TRANSMIT_DONE_STATUS in the LTR Peripheral Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_LTR_PERIPHERAL_ENABLE_bits_t;
#define ESPI_IO_LTR_PERIPHERAL_ENABLE_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_LTR_PERIPHERAL_ENABLE) LTR Peripheral Enable Register  Reset Value */

#define ESPI_IO_LTR_PERIPHERAL_ENABLE_TRANSMIT_DONE_INT_ENABLE_Pos (0)                                            /**< (ESPI_IO_LTR_PERIPHERAL_ENABLE) When this bit is '1' an interrupt is generated when the bit TRANSMIT_DONE_STATUS in the LTR Peripheral Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. Position */
#define ESPI_IO_LTR_PERIPHERAL_ENABLE_TRANSMIT_DONE_INT_ENABLE_Msk (0x1U << ESPI_IO_LTR_PERIPHERAL_ENABLE_TRANSMIT_DONE_INT_ENABLE_Pos)  /**< (ESPI_IO_LTR_PERIPHERAL_ENABLE) When this bit is '1' an interrupt is generated when the bit TRANSMIT_DONE_STATUS in the LTR Peripheral Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. Mask */
#define ESPI_IO_LTR_PERIPHERAL_ENABLE_Msk     (0x00000001UL)                                 /**< (ESPI_IO_LTR_PERIPHERAL_ENABLE) Register Mask  */

/* -------- ESPI_IO_LTR_PERIPHERAL_CONTROL : (ESPI_IO Offset: 0x228) (R/W 32) LTR Peripheral Control Register -------- */

typedef union
{
  struct
  {
    uint32_t LTR_START:1;               /**< bit:      0  Writing '1' to this bit triggers the transmission of an LTR packet defined by the LTR Peripheral Message register. Writing '0' to this bit has no effect.\n      The transmission will be inhibited if the Peripheral channel is not Ready, as defined in the eSPI Peripheral Channel Ready Register. */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t OUTGOING_TAG:4;            /**< bit:  8..11  This 4-bit value will be inserted as the TAG number in the next transmitted LTR packet. According to current understanding of Intel\n      specs, this field should be kept zero by firmware. */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_LTR_PERIPHERAL_CONTROL_bits_t;
#define ESPI_IO_LTR_PERIPHERAL_CONTROL_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_LTR_PERIPHERAL_CONTROL) LTR Peripheral Control Register  Reset Value */

#define ESPI_IO_LTR_PERIPHERAL_CONTROL_LTR_START_Pos (0)                                            /**< (ESPI_IO_LTR_PERIPHERAL_CONTROL) Writing '1' to this bit triggers the transmission of an LTR packet defined by the LTR Peripheral Message register. Writing '0' to this bit has no effect.\n      The transmission will be inhibited if the Peripheral channel is not Ready, as defined in the eSPI Peripheral Channel Ready Register. Position */
#define ESPI_IO_LTR_PERIPHERAL_CONTROL_LTR_START_Msk (0x1U << ESPI_IO_LTR_PERIPHERAL_CONTROL_LTR_START_Pos)  /**< (ESPI_IO_LTR_PERIPHERAL_CONTROL) Writing '1' to this bit triggers the transmission of an LTR packet defined by the LTR Peripheral Message register. Writing '0' to this bit has no effect.\n      The transmission will be inhibited if the Peripheral channel is not Ready, as defined in the eSPI Peripheral Channel Ready Register. Mask */
#define ESPI_IO_LTR_PERIPHERAL_CONTROL_OUTGOING_TAG_Pos (8)                                            /**< (ESPI_IO_LTR_PERIPHERAL_CONTROL) This 4-bit value will be inserted as the TAG number in the next transmitted LTR packet. According to current understanding of Intel\n      specs, this field should be kept zero by firmware. Position */
#define ESPI_IO_LTR_PERIPHERAL_CONTROL_OUTGOING_TAG_Msk (0xFU << ESPI_IO_LTR_PERIPHERAL_CONTROL_OUTGOING_TAG_Pos)  /**< (ESPI_IO_LTR_PERIPHERAL_CONTROL) This 4-bit value will be inserted as the TAG number in the next transmitted LTR packet. According to current understanding of Intel\n      specs, this field should be kept zero by firmware. Mask */
#define ESPI_IO_LTR_PERIPHERAL_CONTROL_OUTGOING_TAG(value) (ESPI_IO_LTR_PERIPHERAL_CONTROL_OUTGOING_TAG_Msk & ((value) << ESPI_IO_LTR_PERIPHERAL_CONTROL_OUTGOING_TAG_Pos))
#define ESPI_IO_LTR_PERIPHERAL_CONTROL_Msk    (0x00000F01UL)                                 /**< (ESPI_IO_LTR_PERIPHERAL_CONTROL) Register Mask  */

/* -------- ESPI_IO_LTR_PERIPHERAL_MESSAGE : (ESPI_IO Offset: 0x22c) (R/W 32) LTR Peripheral Message Register -------- */

typedef union
{
  struct
  {
    uint32_t VALUE:10;                  /**< bit:   0..9  This field declares a time, in units expressed by the Scale field. Zero in both this field and the Scale field (zero time) demands best\n      possible effort (minimal latency) by the chipset. */
    uint32_t SCALE:3;                   /**< bit: 10..12  This field declares the time unit expressed by each count of the Value field of this register. */
    uint32_t RESERVED_TRANSMITTED_BITS:2;  /**< bit: 13..14  These bits are Read/Write, but are undefined in the 16-bit LTR message format. These bits are transmitted, but according to current\n      specs they must always be kept as zeros when writing this register. */
    uint32_t REQUIRED_BIT:1;            /**< bit:     15  1 = Maximum latency tolerated is defined by the Scale and Length fields of this register. 0 = No Requirement. Infinite latency tolerated. (Default). */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_LTR_PERIPHERAL_MESSAGE_bits_t;
#define ESPI_IO_LTR_PERIPHERAL_MESSAGE_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_LTR_PERIPHERAL_MESSAGE) LTR Peripheral Message Register  Reset Value */

#define ESPI_IO_LTR_PERIPHERAL_MESSAGE_VALUE_Pos (0)                                            /**< (ESPI_IO_LTR_PERIPHERAL_MESSAGE) This field declares a time, in units expressed by the Scale field. Zero in both this field and the Scale field (zero time) demands best\n      possible effort (minimal latency) by the chipset. Position */
#define ESPI_IO_LTR_PERIPHERAL_MESSAGE_VALUE_Msk (0x3FFU << ESPI_IO_LTR_PERIPHERAL_MESSAGE_VALUE_Pos)  /**< (ESPI_IO_LTR_PERIPHERAL_MESSAGE) This field declares a time, in units expressed by the Scale field. Zero in both this field and the Scale field (zero time) demands best\n      possible effort (minimal latency) by the chipset. Mask */
#define ESPI_IO_LTR_PERIPHERAL_MESSAGE_VALUE(value) (ESPI_IO_LTR_PERIPHERAL_MESSAGE_VALUE_Msk & ((value) << ESPI_IO_LTR_PERIPHERAL_MESSAGE_VALUE_Pos))
#define ESPI_IO_LTR_PERIPHERAL_MESSAGE_SCALE_Pos (10)                                           /**< (ESPI_IO_LTR_PERIPHERAL_MESSAGE) This field declares the time unit expressed by each count of the Value field of this register. Position */
#define ESPI_IO_LTR_PERIPHERAL_MESSAGE_SCALE_Msk (0x7U << ESPI_IO_LTR_PERIPHERAL_MESSAGE_SCALE_Pos)  /**< (ESPI_IO_LTR_PERIPHERAL_MESSAGE) This field declares the time unit expressed by each count of the Value field of this register. Mask */
#define ESPI_IO_LTR_PERIPHERAL_MESSAGE_SCALE(value) (ESPI_IO_LTR_PERIPHERAL_MESSAGE_SCALE_Msk & ((value) << ESPI_IO_LTR_PERIPHERAL_MESSAGE_SCALE_Pos))
#define ESPI_IO_LTR_PERIPHERAL_MESSAGE_RESERVED_TRANSMITTED_BITS_Pos (13)                                           /**< (ESPI_IO_LTR_PERIPHERAL_MESSAGE) These bits are Read/Write, but are undefined in the 16-bit LTR message format. These bits are transmitted, but according to current\n      specs they must always be kept as zeros when writing this register. Position */
#define ESPI_IO_LTR_PERIPHERAL_MESSAGE_RESERVED_TRANSMITTED_BITS_Msk (0x3U << ESPI_IO_LTR_PERIPHERAL_MESSAGE_RESERVED_TRANSMITTED_BITS_Pos)  /**< (ESPI_IO_LTR_PERIPHERAL_MESSAGE) These bits are Read/Write, but are undefined in the 16-bit LTR message format. These bits are transmitted, but according to current\n      specs they must always be kept as zeros when writing this register. Mask */
#define ESPI_IO_LTR_PERIPHERAL_MESSAGE_RESERVED_TRANSMITTED_BITS(value) (ESPI_IO_LTR_PERIPHERAL_MESSAGE_RESERVED_TRANSMITTED_BITS_Msk & ((value) << ESPI_IO_LTR_PERIPHERAL_MESSAGE_RESERVED_TRANSMITTED_BITS_Pos))
#define ESPI_IO_LTR_PERIPHERAL_MESSAGE_REQUIRED_BIT_Pos (15)                                           /**< (ESPI_IO_LTR_PERIPHERAL_MESSAGE) 1 = Maximum latency tolerated is defined by the Scale and Length fields of this register. 0 = No Requirement. Infinite latency tolerated. (Default). Position */
#define ESPI_IO_LTR_PERIPHERAL_MESSAGE_REQUIRED_BIT_Msk (0x1U << ESPI_IO_LTR_PERIPHERAL_MESSAGE_REQUIRED_BIT_Pos)  /**< (ESPI_IO_LTR_PERIPHERAL_MESSAGE) 1 = Maximum latency tolerated is defined by the Scale and Length fields of this register. 0 = No Requirement. Infinite latency tolerated. (Default). Mask */
#define ESPI_IO_LTR_PERIPHERAL_MESSAGE_Msk    (0x0000FFFFUL)                                 /**< (ESPI_IO_LTR_PERIPHERAL_MESSAGE) Register Mask  */

/* -------- ESPI_IO_OOB_RECEIVE_ADDRESS : (ESPI_IO Offset: 0x240) (R/W 32) OOB Channel Receive Address Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t RECEIVE_BUFFER_ADDRESS:30;  /**< bit:  2..31  This field must be initialized to contain the Base Address for accepting the next OOB packet. */
  };
  uint32_t w;
} __ESPI_IO_OOB_RECEIVE_ADDRESS_bits_t;
