ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
#define ESPI_IO_OOB_RECEIVE_ADDRESS_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_OOB_RECEIVE_ADDRESS) OOB Channel Receive Address Register  Reset Value */

#define ESPI_IO_OOB_RECEIVE_ADDRESS_RECEIVE_BUFFER_ADDRESS_Pos (2)                                            /**< (ESPI_IO_OOB_RECEIVE_ADDRESS) This field must be initialized to contain the Base Address for accepting the next OOB packet. Position */
#define ESPI_IO_OOB_RECEIVE_ADDRESS_RECEIVE_BUFFER_ADDRESS_Msk (0x3FFFFFFFU << ESPI_IO_OOB_RECEIVE_ADDRESS_RECEIVE_BUFFER_ADDRESS_Pos)  /**< (ESPI_IO_OOB_RECEIVE_ADDRESS) This field must be initialized to contain the Base Address for accepting the next OOB packet. Mask */
#define ESPI_IO_OOB_RECEIVE_ADDRESS_RECEIVE_BUFFER_ADDRESS(value) (ESPI_IO_OOB_RECEIVE_ADDRESS_RECEIVE_BUFFER_ADDRESS_Msk & ((value) << ESPI_IO_OOB_RECEIVE_ADDRESS_RECEIVE_BUFFER_ADDRESS_Pos))
#define ESPI_IO_OOB_RECEIVE_ADDRESS_Msk       (0xFFFFFFFCUL)                                 /**< (ESPI_IO_OOB_RECEIVE_ADDRESS) Register Mask  */

/* -------- ESPI_IO_OOB_TRANSMIT_ADDRESS : (ESPI_IO Offset: 0x248) (R/W 32) OOB Channel Transmit Address Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t TRANSMIT_BUFFER_ADDRESS:30;  /**< bit:  2..31  Before starting an OOB Transmit, this field must be initialized to contain the Base Address of the buffer in SRAM.\n      The contents of the transmit buffer should not be modified while TRANSMIT_BUSY is asserted. */
  };
  uint32_t w;
} __ESPI_IO_OOB_TRANSMIT_ADDRESS_bits_t;
#define ESPI_IO_OOB_TRANSMIT_ADDRESS_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_OOB_TRANSMIT_ADDRESS) OOB Channel Transmit Address Register  Reset Value */

#define ESPI_IO_OOB_TRANSMIT_ADDRESS_TRANSMIT_BUFFER_ADDRESS_Pos (2)                                            /**< (ESPI_IO_OOB_TRANSMIT_ADDRESS) Before starting an OOB Transmit, this field must be initialized to contain the Base Address of the buffer in SRAM.\n      The contents of the transmit buffer should not be modified while TRANSMIT_BUSY is asserted. Position */
#define ESPI_IO_OOB_TRANSMIT_ADDRESS_TRANSMIT_BUFFER_ADDRESS_Msk (0x3FFFFFFFU << ESPI_IO_OOB_TRANSMIT_ADDRESS_TRANSMIT_BUFFER_ADDRESS_Pos)  /**< (ESPI_IO_OOB_TRANSMIT_ADDRESS) Before starting an OOB Transmit, this field must be initialized to contain the Base Address of the buffer in SRAM.\n      The contents of the transmit buffer should not be modified while TRANSMIT_BUSY is asserted. Mask */
#define ESPI_IO_OOB_TRANSMIT_ADDRESS_TRANSMIT_BUFFER_ADDRESS(value) (ESPI_IO_OOB_TRANSMIT_ADDRESS_TRANSMIT_BUFFER_ADDRESS_Msk & ((value) << ESPI_IO_OOB_TRANSMIT_ADDRESS_TRANSMIT_BUFFER_ADDRESS_Pos))
#define ESPI_IO_OOB_TRANSMIT_ADDRESS_Msk      (0xFFFFFFFCUL)                                 /**< (ESPI_IO_OOB_TRANSMIT_ADDRESS) Register Mask  */

/* -------- ESPI_IO_OOB_RECEIVE_LENGTH : (ESPI_IO Offset: 0x250) (R/W 32) OOB Channel Receive Length Register -------- */

typedef union
{
  struct
  {
    uint32_t RECEIVED_MESSAGE_LENGTH:13;  /**< bit:  0..12  This 13-bit read-only field reports how many bytes were received into SRAM in the last packet. This is necessary, independent of\n      any 'byte count' in the packet itself to distinguish between an SMBus packet with or without a PEC byte. */
    uint32_t :3;                        /**< bit: 13..15  Reserved                                      */
    uint32_t RECEIVE_BUFFER_LENGTH:13;  /**< bit: 16..28  Before setting the Receive Enable bit to allow incoming traffic to the Receive Buffer area, this 13-bit field must be initialized to\n      contain the length in bytes of the receiving buffer in SRAM. This limits the number of bytes that can be received into SRAM. Any additional incoming\n      bytes must be discarded by hardware, posting the Data Overrun error flag. Practically, the maximum value that can be placed in this field is the\n      configured Max Packet Length. This limit, or anything higher, is legal, but will effectively disable the limit check. */
    uint32_t :3;                        /**< bit: 29..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_OOB_RECEIVE_LENGTH_bits_t;
#define ESPI_IO_OOB_RECEIVE_LENGTH_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_OOB_RECEIVE_LENGTH) OOB Channel Receive Length Register  Reset Value */

#define ESPI_IO_OOB_RECEIVE_LENGTH_RECEIVED_MESSAGE_LENGTH_Pos (0)                                            /**< (ESPI_IO_OOB_RECEIVE_LENGTH) This 13-bit read-only field reports how many bytes were received into SRAM in the last packet. This is necessary, independent of\n      any 'byte count' in the packet itself to distinguish between an SMBus packet with or without a PEC byte. Position */
#define ESPI_IO_OOB_RECEIVE_LENGTH_RECEIVED_MESSAGE_LENGTH_Msk (0x1FFFU << ESPI_IO_OOB_RECEIVE_LENGTH_RECEIVED_MESSAGE_LENGTH_Pos)  /**< (ESPI_IO_OOB_RECEIVE_LENGTH) This 13-bit read-only field reports how many bytes were received into SRAM in the last packet. This is necessary, independent of\n      any 'byte count' in the packet itself to distinguish between an SMBus packet with or without a PEC byte. Mask */
#define ESPI_IO_OOB_RECEIVE_LENGTH_RECEIVED_MESSAGE_LENGTH(value) (ESPI_IO_OOB_RECEIVE_LENGTH_RECEIVED_MESSAGE_LENGTH_Msk & ((value) << ESPI_IO_OOB_RECEIVE_LENGTH_RECEIVED_MESSAGE_LENGTH_Pos))
#define ESPI_IO_OOB_RECEIVE_LENGTH_RECEIVE_BUFFER_LENGTH_Pos (16)                                           /**< (ESPI_IO_OOB_RECEIVE_LENGTH) Before setting the Receive Enable bit to allow incoming traffic to the Receive Buffer area, this 13-bit field must be initialized to\n      contain the length in bytes of the receiving buffer in SRAM. This limits the number of bytes that can be received into SRAM. Any additional incoming\n      bytes must be discarded by hardware, posting the Data Overrun error flag. Practically, the maximum value that can be placed in this field is the\n      configured Max Packet Length. This limit, or anything higher, is legal, but will effectively disable the limit check. Position */
#define ESPI_IO_OOB_RECEIVE_LENGTH_RECEIVE_BUFFER_LENGTH_Msk (0x1FFFU << ESPI_IO_OOB_RECEIVE_LENGTH_RECEIVE_BUFFER_LENGTH_Pos)  /**< (ESPI_IO_OOB_RECEIVE_LENGTH) Before setting the Receive Enable bit to allow incoming traffic to the Receive Buffer area, this 13-bit field must be initialized to\n      contain the length in bytes of the receiving buffer in SRAM. This limits the number of bytes that can be received into SRAM. Any additional incoming\n      bytes must be discarded by hardware, posting the Data Overrun error flag. Practically, the maximum value that can be placed in this field is the\n      configured Max Packet Length. This limit, or anything higher, is legal, but will effectively disable the limit check. Mask */
#define ESPI_IO_OOB_RECEIVE_LENGTH_RECEIVE_BUFFER_LENGTH(value) (ESPI_IO_OOB_RECEIVE_LENGTH_RECEIVE_BUFFER_LENGTH_Msk & ((value) << ESPI_IO_OOB_RECEIVE_LENGTH_RECEIVE_BUFFER_LENGTH_Pos))
#define ESPI_IO_OOB_RECEIVE_LENGTH_Msk        (0x1FFF1FFFUL)                                 /**< (ESPI_IO_OOB_RECEIVE_LENGTH) Register Mask  */

/* -------- ESPI_IO_OOB_TRANSMIT_LENGTH : (ESPI_IO Offset: 0x254) (R/W 32) OOB Channel Transmit Length Register -------- */

typedef union
{
  struct
  {
    uint32_t TRANSMIT_MESSAGE_LENGTH:13;  /**< bit:  0..12  This 13-bit field declares how many bytes are to be transmitted from the Tramsit Buffer memory. A value of zero,\n      or a value greater than the defined Max Packet Size (73 decimal, or 4Dh, by default) is illegal, and will trigger Bad Request handling. */
    uint32_t :19;                       /**< bit: 13..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_OOB_TRANSMIT_LENGTH_bits_t;
#define ESPI_IO_OOB_TRANSMIT_LENGTH_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_OOB_TRANSMIT_LENGTH) OOB Channel Transmit Length Register  Reset Value */

#define ESPI_IO_OOB_TRANSMIT_LENGTH_TRANSMIT_MESSAGE_LENGTH_Pos (0)                                            /**< (ESPI_IO_OOB_TRANSMIT_LENGTH) This 13-bit field declares how many bytes are to be transmitted from the Tramsit Buffer memory. A value of zero,\n      or a value greater than the defined Max Packet Size (73 decimal, or 4Dh, by default) is illegal, and will trigger Bad Request handling. Position */
#define ESPI_IO_OOB_TRANSMIT_LENGTH_TRANSMIT_MESSAGE_LENGTH_Msk (0x1FFFU << ESPI_IO_OOB_TRANSMIT_LENGTH_TRANSMIT_MESSAGE_LENGTH_Pos)  /**< (ESPI_IO_OOB_TRANSMIT_LENGTH) This 13-bit field declares how many bytes are to be transmitted from the Tramsit Buffer memory. A value of zero,\n      or a value greater than the defined Max Packet Size (73 decimal, or 4Dh, by default) is illegal, and will trigger Bad Request handling. Mask */
#define ESPI_IO_OOB_TRANSMIT_LENGTH_TRANSMIT_MESSAGE_LENGTH(value) (ESPI_IO_OOB_TRANSMIT_LENGTH_TRANSMIT_MESSAGE_LENGTH_Msk & ((value) << ESPI_IO_OOB_TRANSMIT_LENGTH_TRANSMIT_MESSAGE_LENGTH_Pos))
#define ESPI_IO_OOB_TRANSMIT_LENGTH_Msk       (0x00001FFFUL)                                 /**< (ESPI_IO_OOB_TRANSMIT_LENGTH) Register Mask  */

/* -------- ESPI_IO_OOB_RECEIVE_CONTROL : (ESPI_IO Offset: 0x258) (R/W 32) OOB Channel Receive Control Register -------- */

typedef union
{
  struct
  {
    uint32_t SET_RECEIVE_AVAILABLE:1;   /**< bit:      0  Firmware sets this bit to '1' to indicate that an SRAM buffer is available to receive the next Down OOB packet. This\n      forces the bit RECEIVE_ENABLE bit in the OOB Channel Receive Status Register register to be set to '1'. The OOB Channel Receive\n      Address Register and OOB Channel Receive Length Register must have already been initialized before setting this bit. */
    uint32_t :8;                        /**< bit:   1..8  Reserved                                      */
    uint32_t OOB_CHANNEL_ENABLED:1;     /**< bit:      9  This allows firmware to read the OOB Message Channel Enabled field in the eSPI Configuration register. The Master\n      sets the bit to '1' to enable the OOB channel. */
    uint32_t :6;                        /**< bit: 10..15  Reserved                                      */
    uint32_t OOB_MAXIMUM_PAYLOAD_SIZE_SELECTED:3;  /**< bit: 16..18  This allows firmware to read the correspondingly-named field in the eSPI Configuration register. The 001b default\n      code selects 64-byte mode, which is actually a 73-byte max payload size for eSPI (64 bytes plus MCTP wrapper bytes). */
    uint32_t :13;                       /**< bit: 19..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_OOB_RECEIVE_CONTROL_bits_t;
#define ESPI_IO_OOB_RECEIVE_CONTROL_RESETVALUE (0x10000U)                                    /**<  (ESPI_IO_OOB_RECEIVE_CONTROL) OOB Channel Receive Control Register  Reset Value */

