ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
#define ESPI_IO_OOB_RECEIVE_CONTROL_SET_RECEIVE_AVAILABLE_Pos (0)                                            /**< (ESPI_IO_OOB_RECEIVE_CONTROL) Firmware sets this bit to '1' to indicate that an SRAM buffer is available to receive the next Down OOB packet. This\n      forces the bit RECEIVE_ENABLE bit in the OOB Channel Receive Status Register register to be set to '1'. The OOB Channel Receive\n      Address Register and OOB Channel Receive Length Register must have already been initialized before setting this bit. Position */
#define ESPI_IO_OOB_RECEIVE_CONTROL_SET_RECEIVE_AVAILABLE_Msk (0x1U << ESPI_IO_OOB_RECEIVE_CONTROL_SET_RECEIVE_AVAILABLE_Pos)  /**< (ESPI_IO_OOB_RECEIVE_CONTROL) Firmware sets this bit to '1' to indicate that an SRAM buffer is available to receive the next Down OOB packet. This\n      forces the bit RECEIVE_ENABLE bit in the OOB Channel Receive Status Register register to be set to '1'. The OOB Channel Receive\n      Address Register and OOB Channel Receive Length Register must have already been initialized before setting this bit. Mask */
#define ESPI_IO_OOB_RECEIVE_CONTROL_OOB_CHANNEL_ENABLED_Pos (9)                                            /**< (ESPI_IO_OOB_RECEIVE_CONTROL) This allows firmware to read the OOB Message Channel Enabled field in the eSPI Configuration register. The Master\n      sets the bit to '1' to enable the OOB channel. Position */
#define ESPI_IO_OOB_RECEIVE_CONTROL_OOB_CHANNEL_ENABLED_Msk (0x1U << ESPI_IO_OOB_RECEIVE_CONTROL_OOB_CHANNEL_ENABLED_Pos)  /**< (ESPI_IO_OOB_RECEIVE_CONTROL) This allows firmware to read the OOB Message Channel Enabled field in the eSPI Configuration register. The Master\n      sets the bit to '1' to enable the OOB channel. Mask */
#define ESPI_IO_OOB_RECEIVE_CONTROL_OOB_MAXIMUM_PAYLOAD_SIZE_SELECTED_Pos (16)                                           /**< (ESPI_IO_OOB_RECEIVE_CONTROL) This allows firmware to read the correspondingly-named field in the eSPI Configuration register. The 001b default\n      code selects 64-byte mode, which is actually a 73-byte max payload size for eSPI (64 bytes plus MCTP wrapper bytes). Position */
#define ESPI_IO_OOB_RECEIVE_CONTROL_OOB_MAXIMUM_PAYLOAD_SIZE_SELECTED_Msk (0x7U << ESPI_IO_OOB_RECEIVE_CONTROL_OOB_MAXIMUM_PAYLOAD_SIZE_SELECTED_Pos)  /**< (ESPI_IO_OOB_RECEIVE_CONTROL) This allows firmware to read the correspondingly-named field in the eSPI Configuration register. The 001b default\n      code selects 64-byte mode, which is actually a 73-byte max payload size for eSPI (64 bytes plus MCTP wrapper bytes). Mask */
#define ESPI_IO_OOB_RECEIVE_CONTROL_OOB_MAXIMUM_PAYLOAD_SIZE_SELECTED(value) (ESPI_IO_OOB_RECEIVE_CONTROL_OOB_MAXIMUM_PAYLOAD_SIZE_SELECTED_Msk & ((value) << ESPI_IO_OOB_RECEIVE_CONTROL_OOB_MAXIMUM_PAYLOAD_SIZE_SELECTED_Pos))
#define ESPI_IO_OOB_RECEIVE_CONTROL_Msk       (0x00070201UL)                                 /**< (ESPI_IO_OOB_RECEIVE_CONTROL) Register Mask  */

/* -------- ESPI_IO_OOB_RECEIVE_INT_ENABLE : (ESPI_IO Offset: 0x25c) (R/W 32) OOB Channel Receive Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t RECEIVE_INTERRUPT_ENABLE:1;  /**< bit:      0  When this bit is '1' an interrupt is generated when the bit RECEIVE_DONE_STATUS in the OOB Channel Receive Status\n      Register is 1. When this bit is '0', the status bit will not generate an interrupt. */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_OOB_RECEIVE_INT_ENABLE_bits_t;
#define ESPI_IO_OOB_RECEIVE_INT_ENABLE_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_OOB_RECEIVE_INT_ENABLE) OOB Channel Receive Interrupt Enable Register  Reset Value */

#define ESPI_IO_OOB_RECEIVE_INT_ENABLE_RECEIVE_INTERRUPT_ENABLE_Pos (0)                                            /**< (ESPI_IO_OOB_RECEIVE_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit RECEIVE_DONE_STATUS in the OOB Channel Receive Status\n      Register is 1. When this bit is '0', the status bit will not generate an interrupt. Position */
#define ESPI_IO_OOB_RECEIVE_INT_ENABLE_RECEIVE_INTERRUPT_ENABLE_Msk (0x1U << ESPI_IO_OOB_RECEIVE_INT_ENABLE_RECEIVE_INTERRUPT_ENABLE_Pos)  /**< (ESPI_IO_OOB_RECEIVE_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit RECEIVE_DONE_STATUS in the OOB Channel Receive Status\n      Register is 1. When this bit is '0', the status bit will not generate an interrupt. Mask */
#define ESPI_IO_OOB_RECEIVE_INT_ENABLE_Msk    (0x00000001UL)                                 /**< (ESPI_IO_OOB_RECEIVE_INT_ENABLE) Register Mask  */

/* -------- ESPI_IO_OOB_RECEIVE_STATUS : (ESPI_IO Offset: 0x260) (R/W 32) OOB Channel Receive Status Register -------- */

typedef union
{
  struct
  {
    uint32_t RECEIVE_DONE_STATUS:1;     /**< bit:      0  This bit is set to '1' whenever the RECEIVE_ENABLE bit in this register is cleared to '0' by hardware when an incoming\n      packet is completely transferred to SRAM. This bit is also set whenever either OVERRUN_STATUS or INTERNAL_BUS_ERROR_STATUS in\n      this register are set to '1'. (R/WC). */
    uint32_t INTERNAL_BUS_ERROR_STATUS:1;  /**< bit:      1  This bit is set to '1' whenever the channel tries to write an incoming byte into an invalid area of the internal\n      addressing space. This could happen if the OOB Channel Receive Address Register was set to something invalid by firmware. If\n      this error occurs mid-packet(crossing a boundary into an invalid space), then the remaining data is discarded. (R/WC). */
    uint32_t OVERRUN_STATUS:1;          /**< bit:      2  This bit is set to '1' whenever an incoming packet is truncated because it was longer than the RECEIVE_BUFFER_LENGTH\n      field. Incoming extra bytes are discarded when this error is triggered, but the buffer receives the data up to its limit, for\n      debugging purposes. (R/WC) */
    uint32_t RECEIVE_ENABLE:1;          /**< bit:      3  This bit is set to '1' when firmware sets the bit SET_RECEIVE_AVAILABLE in the OOB Channel Receive Control Register\n      to '1', to indicate that an SRAM buffer is available to receive the next Down OOB packet. The OOB Channel Receive Address\n      Register and OOB Channel Receive Length Register must have already been initialized before setting this bit.\n      This bit is cleared by hardware when the next packet is received. The RECEIVE_DONE_STATUS bit is set to '1' after this bit is\n      cleared. A '0' in this bit does not necessarily present 'Not Free' status to the eSPI Master. As long as FIFO space is available\n      for a complete OOB packet, the packet can be input and held in the FIFO until this bit is again set by firmware. */
    uint32_t :4;                        /**< bit:   4..7  Reserved                                      */
    uint32_t INCOMING_TAG:4;            /**< bit:  8..11  This field holds the 4-bit TAG in the last message received from the Master. */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_OOB_RECEIVE_STATUS_bits_t;
#define ESPI_IO_OOB_RECEIVE_STATUS_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_OOB_RECEIVE_STATUS) OOB Channel Receive Status Register  Reset Value */

