ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
#define ESPI_IO_OOB_RECEIVE_STATUS_RECEIVE_DONE_STATUS_Pos (0)                                            /**< (ESPI_IO_OOB_RECEIVE_STATUS) This bit is set to '1' whenever the RECEIVE_ENABLE bit in this register is cleared to '0' by hardware when an incoming\n      packet is completely transferred to SRAM. This bit is also set whenever either OVERRUN_STATUS or INTERNAL_BUS_ERROR_STATUS in\n      this register are set to '1'. (R/WC). Position */
#define ESPI_IO_OOB_RECEIVE_STATUS_RECEIVE_DONE_STATUS_Msk (0x1U << ESPI_IO_OOB_RECEIVE_STATUS_RECEIVE_DONE_STATUS_Pos)  /**< (ESPI_IO_OOB_RECEIVE_STATUS) This bit is set to '1' whenever the RECEIVE_ENABLE bit in this register is cleared to '0' by hardware when an incoming\n      packet is completely transferred to SRAM. This bit is also set whenever either OVERRUN_STATUS or INTERNAL_BUS_ERROR_STATUS in\n      this register are set to '1'. (R/WC). Mask */
#define ESPI_IO_OOB_RECEIVE_STATUS_INTERNAL_BUS_ERROR_STATUS_Pos (1)                                            /**< (ESPI_IO_OOB_RECEIVE_STATUS) This bit is set to '1' whenever the channel tries to write an incoming byte into an invalid area of the internal\n      addressing space. This could happen if the OOB Channel Receive Address Register was set to something invalid by firmware. If\n      this error occurs mid-packet(crossing a boundary into an invalid space), then the remaining data is discarded. (R/WC). Position */
#define ESPI_IO_OOB_RECEIVE_STATUS_INTERNAL_BUS_ERROR_STATUS_Msk (0x1U << ESPI_IO_OOB_RECEIVE_STATUS_INTERNAL_BUS_ERROR_STATUS_Pos)  /**< (ESPI_IO_OOB_RECEIVE_STATUS) This bit is set to '1' whenever the channel tries to write an incoming byte into an invalid area of the internal\n      addressing space. This could happen if the OOB Channel Receive Address Register was set to something invalid by firmware. If\n      this error occurs mid-packet(crossing a boundary into an invalid space), then the remaining data is discarded. (R/WC). Mask */
#define ESPI_IO_OOB_RECEIVE_STATUS_OVERRUN_STATUS_Pos (2)                                            /**< (ESPI_IO_OOB_RECEIVE_STATUS) This bit is set to '1' whenever an incoming packet is truncated because it was longer than the RECEIVE_BUFFER_LENGTH\n      field. Incoming extra bytes are discarded when this error is triggered, but the buffer receives the data up to its limit, for\n      debugging purposes. (R/WC) Position */
#define ESPI_IO_OOB_RECEIVE_STATUS_OVERRUN_STATUS_Msk (0x1U << ESPI_IO_OOB_RECEIVE_STATUS_OVERRUN_STATUS_Pos)  /**< (ESPI_IO_OOB_RECEIVE_STATUS) This bit is set to '1' whenever an incoming packet is truncated because it was longer than the RECEIVE_BUFFER_LENGTH\n      field. Incoming extra bytes are discarded when this error is triggered, but the buffer receives the data up to its limit, for\n      debugging purposes. (R/WC) Mask */
#define ESPI_IO_OOB_RECEIVE_STATUS_RECEIVE_ENABLE_Pos (3)                                            /**< (ESPI_IO_OOB_RECEIVE_STATUS) This bit is set to '1' when firmware sets the bit SET_RECEIVE_AVAILABLE in the OOB Channel Receive Control Register\n      to '1', to indicate that an SRAM buffer is available to receive the next Down OOB packet. The OOB Channel Receive Address\n      Register and OOB Channel Receive Length Register must have already been initialized before setting this bit.\n      This bit is cleared by hardware when the next packet is received. The RECEIVE_DONE_STATUS bit is set to '1' after this bit is\n      cleared. A '0' in this bit does not necessarily present 'Not Free' status to the eSPI Master. As long as FIFO space is available\n      for a complete OOB packet, the packet can be input and held in the FIFO until this bit is again set by firmware. Position */
#define ESPI_IO_OOB_RECEIVE_STATUS_RECEIVE_ENABLE_Msk (0x1U << ESPI_IO_OOB_RECEIVE_STATUS_RECEIVE_ENABLE_Pos)  /**< (ESPI_IO_OOB_RECEIVE_STATUS) This bit is set to '1' when firmware sets the bit SET_RECEIVE_AVAILABLE in the OOB Channel Receive Control Register\n      to '1', to indicate that an SRAM buffer is available to receive the next Down OOB packet. The OOB Channel Receive Address\n      Register and OOB Channel Receive Length Register must have already been initialized before setting this bit.\n      This bit is cleared by hardware when the next packet is received. The RECEIVE_DONE_STATUS bit is set to '1' after this bit is\n      cleared. A '0' in this bit does not necessarily present 'Not Free' status to the eSPI Master. As long as FIFO space is available\n      for a complete OOB packet, the packet can be input and held in the FIFO until this bit is again set by firmware. Mask */
#define ESPI_IO_OOB_RECEIVE_STATUS_INCOMING_TAG_Pos (8)                                            /**< (ESPI_IO_OOB_RECEIVE_STATUS) This field holds the 4-bit TAG in the last message received from the Master. Position */
#define ESPI_IO_OOB_RECEIVE_STATUS_INCOMING_TAG_Msk (0xFU << ESPI_IO_OOB_RECEIVE_STATUS_INCOMING_TAG_Pos)  /**< (ESPI_IO_OOB_RECEIVE_STATUS) This field holds the 4-bit TAG in the last message received from the Master. Mask */
#define ESPI_IO_OOB_RECEIVE_STATUS_INCOMING_TAG(value) (ESPI_IO_OOB_RECEIVE_STATUS_INCOMING_TAG_Msk & ((value) << ESPI_IO_OOB_RECEIVE_STATUS_INCOMING_TAG_Pos))
#define ESPI_IO_OOB_RECEIVE_STATUS_Msk        (0x00000F0FUL)                                 /**< (ESPI_IO_OOB_RECEIVE_STATUS) Register Mask  */

/* -------- ESPI_IO_OOB_TRANSMIT_CONTROL : (ESPI_IO Offset: 0x264) (R/W 32) OOB Channel Transmit Control Register -------- */

typedef union
{
  struct
  {
    uint32_t TRANSMIT_START:1;          /**< bit:      0  A write of '1' to this bit starts the transmission of an OOB packet defined by the OOB Channel Transmit Address Register and OOB\n      Channel Transmit Length Register registers. A write of '0' has no effect.\n      The transmission will be inhibited if the OOB channel is not Ready, as defined in the eSPI OOB Channel Ready Register. */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t OUTGOING_TAG:4;            /**< bit:  8..11  This 4-bit value will be inserted as the TAG number in the next transmitted OOB packet. This field must be 0. */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_OOB_TRANSMIT_CONTROL_bits_t;
#define ESPI_IO_OOB_TRANSMIT_CONTROL_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_OOB_TRANSMIT_CONTROL) OOB Channel Transmit Control Register  Reset Value */

#define ESPI_IO_OOB_TRANSMIT_CONTROL_TRANSMIT_START_Pos (0)                                            /**< (ESPI_IO_OOB_TRANSMIT_CONTROL) A write of '1' to this bit starts the transmission of an OOB packet defined by the OOB Channel Transmit Address Register and OOB\n      Channel Transmit Length Register registers. A write of '0' has no effect.\n      The transmission will be inhibited if the OOB channel is not Ready, as defined in the eSPI OOB Channel Ready Register. Position */
#define ESPI_IO_OOB_TRANSMIT_CONTROL_TRANSMIT_START_Msk (0x1U << ESPI_IO_OOB_TRANSMIT_CONTROL_TRANSMIT_START_Pos)  /**< (ESPI_IO_OOB_TRANSMIT_CONTROL) A write of '1' to this bit starts the transmission of an OOB packet defined by the OOB Channel Transmit Address Register and OOB\n      Channel Transmit Length Register registers. A write of '0' has no effect.\n      The transmission will be inhibited if the OOB channel is not Ready, as defined in the eSPI OOB Channel Ready Register. Mask */
#define ESPI_IO_OOB_TRANSMIT_CONTROL_OUTGOING_TAG_Pos (8)                                            /**< (ESPI_IO_OOB_TRANSMIT_CONTROL) This 4-bit value will be inserted as the TAG number in the next transmitted OOB packet. This field must be 0. Position */
#define ESPI_IO_OOB_TRANSMIT_CONTROL_OUTGOING_TAG_Msk (0xFU << ESPI_IO_OOB_TRANSMIT_CONTROL_OUTGOING_TAG_Pos)  /**< (ESPI_IO_OOB_TRANSMIT_CONTROL) This 4-bit value will be inserted as the TAG number in the next transmitted OOB packet. This field must be 0. Mask */
#define ESPI_IO_OOB_TRANSMIT_CONTROL_OUTGOING_TAG(value) (ESPI_IO_OOB_TRANSMIT_CONTROL_OUTGOING_TAG_Msk & ((value) << ESPI_IO_OOB_TRANSMIT_CONTROL_OUTGOING_TAG_Pos))
#define ESPI_IO_OOB_TRANSMIT_CONTROL_Msk      (0x00000F01UL)                                 /**< (ESPI_IO_OOB_TRANSMIT_CONTROL) Register Mask  */

/* -------- ESPI_IO_OOB_TRANSMIT_INT_ENABLE : (ESPI_IO Offset: 0x268) (R/W 32) OOB Channel Transmit Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t TRANSMIT_DONE_INTERRUPT_ENABLE:1;  /**< bit:      0  When this bit is '1' an interrupt is generated when the bit TRANSMIT_DONE_STATUS in the OOB Channel Transmit Status\n      Register is 1. When this bit is '0', the status bit will not generate an interrupt. */
    uint32_t CHANNEL_ENABLE_CHANGE_INTERRUPT_ENABLE:1;  /**< bit:      1  When this bit is '1' an interrupt is generated when the bit CHANNEL_ENABLE_CHANGE_STATUS in the OOB Channel Transmit\n      Status Register is 1. When this bit is '0', the status bit will not generate an interrupt. */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_OOB_TRANSMIT_INT_ENABLE_bits_t;
