ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
#define ESPI_IO_OOB_TRANSMIT_INT_ENABLE_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_OOB_TRANSMIT_INT_ENABLE) OOB Channel Transmit Interrupt Enable Register  Reset Value */

#define ESPI_IO_OOB_TRANSMIT_INT_ENABLE_TRANSMIT_DONE_INTERRUPT_ENABLE_Pos (0)                                            /**< (ESPI_IO_OOB_TRANSMIT_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit TRANSMIT_DONE_STATUS in the OOB Channel Transmit Status\n      Register is 1. When this bit is '0', the status bit will not generate an interrupt. Position */
#define ESPI_IO_OOB_TRANSMIT_INT_ENABLE_TRANSMIT_DONE_INTERRUPT_ENABLE_Msk (0x1U << ESPI_IO_OOB_TRANSMIT_INT_ENABLE_TRANSMIT_DONE_INTERRUPT_ENABLE_Pos)  /**< (ESPI_IO_OOB_TRANSMIT_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit TRANSMIT_DONE_STATUS in the OOB Channel Transmit Status\n      Register is 1. When this bit is '0', the status bit will not generate an interrupt. Mask */
#define ESPI_IO_OOB_TRANSMIT_INT_ENABLE_CHANNEL_ENABLE_CHANGE_INTERRUPT_ENABLE_Pos (1)                                            /**< (ESPI_IO_OOB_TRANSMIT_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit CHANNEL_ENABLE_CHANGE_STATUS in the OOB Channel Transmit\n      Status Register is 1. When this bit is '0', the status bit will not generate an interrupt. Position */
#define ESPI_IO_OOB_TRANSMIT_INT_ENABLE_CHANNEL_ENABLE_CHANGE_INTERRUPT_ENABLE_Msk (0x1U << ESPI_IO_OOB_TRANSMIT_INT_ENABLE_CHANNEL_ENABLE_CHANGE_INTERRUPT_ENABLE_Pos)  /**< (ESPI_IO_OOB_TRANSMIT_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit CHANNEL_ENABLE_CHANGE_STATUS in the OOB Channel Transmit\n      Status Register is 1. When this bit is '0', the status bit will not generate an interrupt. Mask */
#define ESPI_IO_OOB_TRANSMIT_INT_ENABLE_Msk   (0x00000003UL)                                 /**< (ESPI_IO_OOB_TRANSMIT_INT_ENABLE) Register Mask  */

/* -------- ESPI_IO_OOB_TRANSMIT_STATUS : (ESPI_IO Offset: 0x26c) (R/W 32) OOB Channel Transmit Status Register -------- */

typedef union
{
  struct
  {
    uint32_t TRANSMIT_DONE_STATUS:1;    /**< bit:      0  This bit is set to '1' whenever a Transmit operation terminates (TRANSMIT_BUSY in this register goes from '1' to '0'). (R/WC) */
    uint32_t CHANNEL_ENABLE_CHANGE_STATUS:1;  /**< bit:      1  This bit is set to '1' whenever the eSPI Master changes the state of the OOB Message Channel Enable bit in the OOB\n      Channel Capabilities and Configurations Master register. (R/WC). */
    uint32_t INTERNAL_BUS_ERROR_STATUS:1;  /**< bit:      2  This error flag indicates an internal bus violation occurred in trying to transmit. (R/WC) */
    uint32_t START_OVERRUN_STATUS:1;    /**< bit:      3  This error flag indicates a Start was attempted while the channel was Busy. Any Transmit in progress is\n      immediately halted. (R/WC) */
    uint32_t :1;                        /**< bit:      4  Reserved                                      */
    uint32_t BAD_REQUEST:1;             /**< bit:      5  This bit is intended for any situation where a firmware request cannot be started because it expresses\n      something impossible. This bit will be set for a request to Transmit 0 bytes or if a Transmit length is more than the\n      selected Max Payload Length. This condition brings the state machine to the Done state, as if something had actually\n      finished, with everything including the Done interrupt triggered. (R/WC) */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t TRANSMIT_BUSY:1;           /**< bit:      8  This bit is set to '1' when firmware writes '1' to the TRANSMIT_START bit. It is cleared by hardware when\n      the transfer is complete. If the TRANSMIT_START bit is written '1' while this bit is also '1', then this will set the\n      START_OVERRUN_STATUS bit to '1' and terminate the transfer attempt immediately (Transmit Done). */
    uint32_t OOB_CHANNEL_ENABLED_IMAGE:1;  /**< bit:      9  This bit is an image of the OOB Channel Enabled bit in the OOB Channel Receive Control Register register.\n      It is provided here so that it can be seen with the CHANNEL_ENABLE_CHANGE_STATUS Interrupt Status bit for efficiency. */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_OOB_TRANSMIT_STATUS_bits_t;
#define ESPI_IO_OOB_TRANSMIT_STATUS_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_OOB_TRANSMIT_STATUS) OOB Channel Transmit Status Register  Reset Value */

#define ESPI_IO_OOB_TRANSMIT_STATUS_TRANSMIT_DONE_STATUS_Pos (0)                                            /**< (ESPI_IO_OOB_TRANSMIT_STATUS) This bit is set to '1' whenever a Transmit operation terminates (TRANSMIT_BUSY in this register goes from '1' to '0'). (R/WC) Position */
#define ESPI_IO_OOB_TRANSMIT_STATUS_TRANSMIT_DONE_STATUS_Msk (0x1U << ESPI_IO_OOB_TRANSMIT_STATUS_TRANSMIT_DONE_STATUS_Pos)  /**< (ESPI_IO_OOB_TRANSMIT_STATUS) This bit is set to '1' whenever a Transmit operation terminates (TRANSMIT_BUSY in this register goes from '1' to '0'). (R/WC) Mask */
#define ESPI_IO_OOB_TRANSMIT_STATUS_CHANNEL_ENABLE_CHANGE_STATUS_Pos (1)                                            /**< (ESPI_IO_OOB_TRANSMIT_STATUS) This bit is set to '1' whenever the eSPI Master changes the state of the OOB Message Channel Enable bit in the OOB\n      Channel Capabilities and Configurations Master register. (R/WC). Position */
#define ESPI_IO_OOB_TRANSMIT_STATUS_CHANNEL_ENABLE_CHANGE_STATUS_Msk (0x1U << ESPI_IO_OOB_TRANSMIT_STATUS_CHANNEL_ENABLE_CHANGE_STATUS_Pos)  /**< (ESPI_IO_OOB_TRANSMIT_STATUS) This bit is set to '1' whenever the eSPI Master changes the state of the OOB Message Channel Enable bit in the OOB\n      Channel Capabilities and Configurations Master register. (R/WC). Mask */
#define ESPI_IO_OOB_TRANSMIT_STATUS_INTERNAL_BUS_ERROR_STATUS_Pos (2)                                            /**< (ESPI_IO_OOB_TRANSMIT_STATUS) This error flag indicates an internal bus violation occurred in trying to transmit. (R/WC) Position */
#define ESPI_IO_OOB_TRANSMIT_STATUS_INTERNAL_BUS_ERROR_STATUS_Msk (0x1U << ESPI_IO_OOB_TRANSMIT_STATUS_INTERNAL_BUS_ERROR_STATUS_Pos)  /**< (ESPI_IO_OOB_TRANSMIT_STATUS) This error flag indicates an internal bus violation occurred in trying to transmit. (R/WC) Mask */
#define ESPI_IO_OOB_TRANSMIT_STATUS_START_OVERRUN_STATUS_Pos (3)                                            /**< (ESPI_IO_OOB_TRANSMIT_STATUS) This error flag indicates a Start was attempted while the channel was Busy. Any Transmit in progress is\n      immediately halted. (R/WC) Position */
#define ESPI_IO_OOB_TRANSMIT_STATUS_START_OVERRUN_STATUS_Msk (0x1U << ESPI_IO_OOB_TRANSMIT_STATUS_START_OVERRUN_STATUS_Pos)  /**< (ESPI_IO_OOB_TRANSMIT_STATUS) This error flag indicates a Start was attempted while the channel was Busy. Any Transmit in progress is\n      immediately halted. (R/WC) Mask */
#define ESPI_IO_OOB_TRANSMIT_STATUS_BAD_REQUEST_Pos (5)                                            /**< (ESPI_IO_OOB_TRANSMIT_STATUS) This bit is intended for any situation where a firmware request cannot be started because it expresses\n      something impossible. This bit will be set for a request to Transmit 0 bytes or if a Transmit length is more than the\n      selected Max Payload Length. This condition brings the state machine to the Done state, as if something had actually\n      finished, with everything including the Done interrupt triggered. (R/WC) Position */
#define ESPI_IO_OOB_TRANSMIT_STATUS_BAD_REQUEST_Msk (0x1U << ESPI_IO_OOB_TRANSMIT_STATUS_BAD_REQUEST_Pos)  /**< (ESPI_IO_OOB_TRANSMIT_STATUS) This bit is intended for any situation where a firmware request cannot be started because it expresses\n      something impossible. This bit will be set for a request to Transmit 0 bytes or if a Transmit length is more than the\n      selected Max Payload Length. This condition brings the state machine to the Done state, as if something had actually\n      finished, with everything including the Done interrupt triggered. (R/WC) Mask */
#define ESPI_IO_OOB_TRANSMIT_STATUS_TRANSMIT_BUSY_Pos (8)                                            /**< (ESPI_IO_OOB_TRANSMIT_STATUS) This bit is set to '1' when firmware writes '1' to the TRANSMIT_START bit. It is cleared by hardware when\n      the transfer is complete. If the TRANSMIT_START bit is written '1' while this bit is also '1', then this will set the\n      START_OVERRUN_STATUS bit to '1' and terminate the transfer attempt immediately (Transmit Done). Position */
#define ESPI_IO_OOB_TRANSMIT_STATUS_TRANSMIT_BUSY_Msk (0x1U << ESPI_IO_OOB_TRANSMIT_STATUS_TRANSMIT_BUSY_Pos)  /**< (ESPI_IO_OOB_TRANSMIT_STATUS) This bit is set to '1' when firmware writes '1' to the TRANSMIT_START bit. It is cleared by hardware when\n      the transfer is complete. If the TRANSMIT_START bit is written '1' while this bit is also '1', then this will set the\n      START_OVERRUN_STATUS bit to '1' and terminate the transfer attempt immediately (Transmit Done). Mask */
#define ESPI_IO_OOB_TRANSMIT_STATUS_OOB_CHANNEL_ENABLED_IMAGE_Pos (9)                                            /**< (ESPI_IO_OOB_TRANSMIT_STATUS) This bit is an image of the OOB Channel Enabled bit in the OOB Channel Receive Control Register register.\n      It is provided here so that it can be seen with the CHANNEL_ENABLE_CHANGE_STATUS Interrupt Status bit for efficiency. Position */
#define ESPI_IO_OOB_TRANSMIT_STATUS_OOB_CHANNEL_ENABLED_IMAGE_Msk (0x1U << ESPI_IO_OOB_TRANSMIT_STATUS_OOB_CHANNEL_ENABLED_IMAGE_Pos)  /**< (ESPI_IO_OOB_TRANSMIT_STATUS) This bit is an image of the OOB Channel Enabled bit in the OOB Channel Receive Control Register register.\n      It is provided here so that it can be seen with the CHANNEL_ENABLE_CHANGE_STATUS Interrupt Status bit for efficiency. Mask */
#define ESPI_IO_OOB_TRANSMIT_STATUS_Msk       (0x0000032FUL)                                 /**< (ESPI_IO_OOB_TRANSMIT_STATUS) Register Mask  */

