ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
/* -------- ESPI_IO_FLASH_CH_FLASH_ADDRESS : (ESPI_IO Offset: 0x280) (R/W 32) Flash Access Channel Flash Address Register -------- */

typedef union
{
  struct
  {
    uint32_t FLASH_ADDRESS:32;          /**< bit:  0..31  Before starting a Flash access, this field must be initialized to contain the value used by eSPI for addressing the Flash contents. */
  };
  uint32_t w;
} __ESPI_IO_FLASH_CH_FLASH_ADDRESS_bits_t;
#define ESPI_IO_FLASH_CH_FLASH_ADDRESS_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_FLASH_CH_FLASH_ADDRESS) Flash Access Channel Flash Address Register  Reset Value */

#define ESPI_IO_FLASH_CH_FLASH_ADDRESS_FLASH_ADDRESS_Pos (0)                                            /**< (ESPI_IO_FLASH_CH_FLASH_ADDRESS) Before starting a Flash access, this field must be initialized to contain the value used by eSPI for addressing the Flash contents. Position */
#define ESPI_IO_FLASH_CH_FLASH_ADDRESS_FLASH_ADDRESS_Msk (0xFFFFFFFFU << ESPI_IO_FLASH_CH_FLASH_ADDRESS_FLASH_ADDRESS_Pos)  /**< (ESPI_IO_FLASH_CH_FLASH_ADDRESS) Before starting a Flash access, this field must be initialized to contain the value used by eSPI for addressing the Flash contents. Mask */
#define ESPI_IO_FLASH_CH_FLASH_ADDRESS_FLASH_ADDRESS(value) (ESPI_IO_FLASH_CH_FLASH_ADDRESS_FLASH_ADDRESS_Msk & ((value) << ESPI_IO_FLASH_CH_FLASH_ADDRESS_FLASH_ADDRESS_Pos))
#define ESPI_IO_FLASH_CH_FLASH_ADDRESS_Msk    (0xFFFFFFFFUL)                                 /**< (ESPI_IO_FLASH_CH_FLASH_ADDRESS) Register Mask  */

/* -------- ESPI_IO_FLASH_CH_BUFFER_ADDRESS : (ESPI_IO Offset: 0x288) (R/W 32) Flash Access Channel Buffer Address Register -------- */

typedef union
{
  struct
  {
    uint32_t BUFFER_ADDRESS:32;         /**< bit:  0..31  Before starting a Flash access, this field must be initialized with the address of the data buffer in the EC's memory space. */
  };
  uint32_t w;
} __ESPI_IO_FLASH_CH_BUFFER_ADDRESS_bits_t;
#define ESPI_IO_FLASH_CH_BUFFER_ADDRESS_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_FLASH_CH_BUFFER_ADDRESS) Flash Access Channel Buffer Address Register  Reset Value */

#define ESPI_IO_FLASH_CH_BUFFER_ADDRESS_BUFFER_ADDRESS_Pos (0)                                            /**< (ESPI_IO_FLASH_CH_BUFFER_ADDRESS) Before starting a Flash access, this field must be initialized with the address of the data buffer in the EC's memory space. Position */
#define ESPI_IO_FLASH_CH_BUFFER_ADDRESS_BUFFER_ADDRESS_Msk (0xFFFFFFFFU << ESPI_IO_FLASH_CH_BUFFER_ADDRESS_BUFFER_ADDRESS_Pos)  /**< (ESPI_IO_FLASH_CH_BUFFER_ADDRESS) Before starting a Flash access, this field must be initialized with the address of the data buffer in the EC's memory space. Mask */
#define ESPI_IO_FLASH_CH_BUFFER_ADDRESS_BUFFER_ADDRESS(value) (ESPI_IO_FLASH_CH_BUFFER_ADDRESS_BUFFER_ADDRESS_Msk & ((value) << ESPI_IO_FLASH_CH_BUFFER_ADDRESS_BUFFER_ADDRESS_Pos))
#define ESPI_IO_FLASH_CH_BUFFER_ADDRESS_Msk   (0xFFFFFFFFUL)                                 /**< (ESPI_IO_FLASH_CH_BUFFER_ADDRESS) Register Mask  */

/* -------- ESPI_IO_FLASH_CH_TRANSFER_LENGTH : (ESPI_IO Offset: 0x290) (R/W 32) Flash Access Channel Transfer Length Register -------- */

typedef union
{
  struct
  {
    uint32_t TRANSFER_LENGTH:32;        /**< bit:  0..31  Before starting a Flash access, this field must be initialized with the total number of bytes to be transferred in the\n      requested transaction sequence. If the Master attempts to transfer more bytes than this in Read Completions, the transfer is faulted\n      and the DATA_OVERRUN bit in the Flash Access Channel Status Register register is asserted. */
  };
  uint32_t w;
} __ESPI_IO_FLASH_CH_TRANSFER_LENGTH_bits_t;
#define ESPI_IO_FLASH_CH_TRANSFER_LENGTH_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_FLASH_CH_TRANSFER_LENGTH) Flash Access Channel Transfer Length Register  Reset Value */

#define ESPI_IO_FLASH_CH_TRANSFER_LENGTH_TRANSFER_LENGTH_Pos (0)                                            /**< (ESPI_IO_FLASH_CH_TRANSFER_LENGTH) Before starting a Flash access, this field must be initialized with the total number of bytes to be transferred in the\n      requested transaction sequence. If the Master attempts to transfer more bytes than this in Read Completions, the transfer is faulted\n      and the DATA_OVERRUN bit in the Flash Access Channel Status Register register is asserted. Position */
#define ESPI_IO_FLASH_CH_TRANSFER_LENGTH_TRANSFER_LENGTH_Msk (0xFFFFFFFFU << ESPI_IO_FLASH_CH_TRANSFER_LENGTH_TRANSFER_LENGTH_Pos)  /**< (ESPI_IO_FLASH_CH_TRANSFER_LENGTH) Before starting a Flash access, this field must be initialized with the total number of bytes to be transferred in the\n      requested transaction sequence. If the Master attempts to transfer more bytes than this in Read Completions, the transfer is faulted\n      and the DATA_OVERRUN bit in the Flash Access Channel Status Register register is asserted. Mask */
#define ESPI_IO_FLASH_CH_TRANSFER_LENGTH_TRANSFER_LENGTH(value) (ESPI_IO_FLASH_CH_TRANSFER_LENGTH_TRANSFER_LENGTH_Msk & ((value) << ESPI_IO_FLASH_CH_TRANSFER_LENGTH_TRANSFER_LENGTH_Pos))
#define ESPI_IO_FLASH_CH_TRANSFER_LENGTH_Msk  (0xFFFFFFFFUL)                                 /**< (ESPI_IO_FLASH_CH_TRANSFER_LENGTH) Register Mask  */

/* -------- ESPI_IO_FLASH_CH_CONTROL : (ESPI_IO Offset: 0x294) (R/W 32) Flash Access Channel Control Register -------- */

typedef union
{
  struct
  {
    uint32_t FLASH_START:1;             /**< bit:      0  A write of '1' to this bit starts the transmission and sets the Busy status bit. A write of '0' has no effect.\n      The transmission will be inhibited if the OOB channel is not Ready, as defined in the eSPI Flash Channel Ready Register. */
    uint32_t :1;                        /**< bit:      1  Reserved                                      */
    uint32_t FUNCTION:2;                /**< bit:   2..3  This bit selects the requested Flash function as follows:\n      11=Erase Flash Range=Larger of two ranges, if a choice exists\n      10=Erase Flash Range=Smaller of two ranges, if a choice exists\n      01=Write to Flash\n      00=Read from Flash. */
    uint32_t TAG:4;                     /**< bit:   4..7  This field should always be written to zero, which is the only expected Tag value for Flash Access traffic. It provides\n      the 4-bit TAG value in the eSPI Transaction Header sent by the EC. Completion traffic from the Master is required to match this field also. */
    uint32_t :8;                        /**< bit:  8..15  Reserved                                      */
    uint32_t ABORT_ACCESS:1;            /**< bit:     16  By writing '1' to this bit while Busy==1, the transaction sequence last triggered by the Start bit is terminated, and the\n      Busy bit is cleared, at the next protocol-compliant opportunity. The clearing of the Busy bit will set the DONE status bit and the\n      ABORTED_BY_SLAVE status bit is set to '1' to acknowledge this specific action as the cause. The action of writing '1' to this bit is\n      ignored while Busy==0. This bit reads as '0' always. */
    uint32_t :15;                       /**< bit: 17..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_FLASH_CH_CONTROL_bits_t;
