ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
#define ESPI_IO_FLASH_CH_CONTROL_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_FLASH_CH_CONTROL) Flash Access Channel Control Register  Reset Value */

#define ESPI_IO_FLASH_CH_CONTROL_FLASH_START_Pos (0)                                            /**< (ESPI_IO_FLASH_CH_CONTROL) A write of '1' to this bit starts the transmission and sets the Busy status bit. A write of '0' has no effect.\n      The transmission will be inhibited if the OOB channel is not Ready, as defined in the eSPI Flash Channel Ready Register. Position */
#define ESPI_IO_FLASH_CH_CONTROL_FLASH_START_Msk (0x1U << ESPI_IO_FLASH_CH_CONTROL_FLASH_START_Pos)  /**< (ESPI_IO_FLASH_CH_CONTROL) A write of '1' to this bit starts the transmission and sets the Busy status bit. A write of '0' has no effect.\n      The transmission will be inhibited if the OOB channel is not Ready, as defined in the eSPI Flash Channel Ready Register. Mask */
#define ESPI_IO_FLASH_CH_CONTROL_FUNCTION_Pos (2)                                            /**< (ESPI_IO_FLASH_CH_CONTROL) This bit selects the requested Flash function as follows:\n      11=Erase Flash Range=Larger of two ranges, if a choice exists\n      10=Erase Flash Range=Smaller of two ranges, if a choice exists\n      01=Write to Flash\n      00=Read from Flash. Position */
#define ESPI_IO_FLASH_CH_CONTROL_FUNCTION_Msk (0x3U << ESPI_IO_FLASH_CH_CONTROL_FUNCTION_Pos)  /**< (ESPI_IO_FLASH_CH_CONTROL) This bit selects the requested Flash function as follows:\n      11=Erase Flash Range=Larger of two ranges, if a choice exists\n      10=Erase Flash Range=Smaller of two ranges, if a choice exists\n      01=Write to Flash\n      00=Read from Flash. Mask */
#define ESPI_IO_FLASH_CH_CONTROL_FUNCTION(value) (ESPI_IO_FLASH_CH_CONTROL_FUNCTION_Msk & ((value) << ESPI_IO_FLASH_CH_CONTROL_FUNCTION_Pos))
#define ESPI_IO_FLASH_CH_CONTROL_TAG_Pos      (4)                                            /**< (ESPI_IO_FLASH_CH_CONTROL) This field should always be written to zero, which is the only expected Tag value for Flash Access traffic. It provides\n      the 4-bit TAG value in the eSPI Transaction Header sent by the EC. Completion traffic from the Master is required to match this field also. Position */
#define ESPI_IO_FLASH_CH_CONTROL_TAG_Msk      (0xFU << ESPI_IO_FLASH_CH_CONTROL_TAG_Pos)     /**< (ESPI_IO_FLASH_CH_CONTROL) This field should always be written to zero, which is the only expected Tag value for Flash Access traffic. It provides\n      the 4-bit TAG value in the eSPI Transaction Header sent by the EC. Completion traffic from the Master is required to match this field also. Mask */
#define ESPI_IO_FLASH_CH_CONTROL_TAG(value)   (ESPI_IO_FLASH_CH_CONTROL_TAG_Msk & ((value) << ESPI_IO_FLASH_CH_CONTROL_TAG_Pos))
#define ESPI_IO_FLASH_CH_CONTROL_ABORT_ACCESS_Pos (16)                                           /**< (ESPI_IO_FLASH_CH_CONTROL) By writing '1' to this bit while Busy==1, the transaction sequence last triggered by the Start bit is terminated, and the\n      Busy bit is cleared, at the next protocol-compliant opportunity. The clearing of the Busy bit will set the DONE status bit and the\n      ABORTED_BY_SLAVE status bit is set to '1' to acknowledge this specific action as the cause. The action of writing '1' to this bit is\n      ignored while Busy==0. This bit reads as '0' always. Position */
#define ESPI_IO_FLASH_CH_CONTROL_ABORT_ACCESS_Msk (0x1U << ESPI_IO_FLASH_CH_CONTROL_ABORT_ACCESS_Pos)  /**< (ESPI_IO_FLASH_CH_CONTROL) By writing '1' to this bit while Busy==1, the transaction sequence last triggered by the Start bit is terminated, and the\n      Busy bit is cleared, at the next protocol-compliant opportunity. The clearing of the Busy bit will set the DONE status bit and the\n      ABORTED_BY_SLAVE status bit is set to '1' to acknowledge this specific action as the cause. The action of writing '1' to this bit is\n      ignored while Busy==0. This bit reads as '0' always. Mask */
#define ESPI_IO_FLASH_CH_CONTROL_Msk          (0x000100FDUL)                                 /**< (ESPI_IO_FLASH_CH_CONTROL) Register Mask  */

/* -------- ESPI_IO_FLASH_CH_INT_ENABLE : (ESPI_IO Offset: 0x298) (R/W 32) Flash Access Channel Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t DONE_INTERRUPT_ENABLE:1;   /**< bit:      0  When this bit is '1' an interrupt is generated when the bit DONE in the Flash Access Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. */
    uint32_t FLASH_ENABLE_STATUS_CHANGE_INTERRUPT_ENABLE:1;  /**< bit:      1  When this bit is '1' an interrupt is generated when the bit CHANNEL_ENABLE_CHANGE_STATUS in the Flash Access Channel\n      Status Register is 1. When this bit is '0', the status bit will not generate an interrupt. */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_FLASH_CH_INT_ENABLE_bits_t;
#define ESPI_IO_FLASH_CH_INT_ENABLE_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_FLASH_CH_INT_ENABLE) Flash Access Channel Interrupt Enable Register  Reset Value */

#define ESPI_IO_FLASH_CH_INT_ENABLE_DONE_INTERRUPT_ENABLE_Pos (0)                                            /**< (ESPI_IO_FLASH_CH_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit DONE in the Flash Access Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. Position */
#define ESPI_IO_FLASH_CH_INT_ENABLE_DONE_INTERRUPT_ENABLE_Msk (0x1U << ESPI_IO_FLASH_CH_INT_ENABLE_DONE_INTERRUPT_ENABLE_Pos)  /**< (ESPI_IO_FLASH_CH_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit DONE in the Flash Access Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. Mask */
#define ESPI_IO_FLASH_CH_INT_ENABLE_FLASH_ENABLE_STATUS_CHANGE_INTERRUPT_ENABLE_Pos (1)                                            /**< (ESPI_IO_FLASH_CH_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit CHANNEL_ENABLE_CHANGE_STATUS in the Flash Access Channel\n      Status Register is 1. When this bit is '0', the status bit will not generate an interrupt. Position */
#define ESPI_IO_FLASH_CH_INT_ENABLE_FLASH_ENABLE_STATUS_CHANGE_INTERRUPT_ENABLE_Msk (0x1U << ESPI_IO_FLASH_CH_INT_ENABLE_FLASH_ENABLE_STATUS_CHANGE_INTERRUPT_ENABLE_Pos)  /**< (ESPI_IO_FLASH_CH_INT_ENABLE) When this bit is '1' an interrupt is generated when the bit CHANNEL_ENABLE_CHANGE_STATUS in the Flash Access Channel\n      Status Register is 1. When this bit is '0', the status bit will not generate an interrupt. Mask */
#define ESPI_IO_FLASH_CH_INT_ENABLE_Msk       (0x00000003UL)                                 /**< (ESPI_IO_FLASH_CH_INT_ENABLE) Register Mask  */

/* -------- ESPI_IO_FLASH_CH_CONFIG : (ESPI_IO Offset: 0x29c) (R/ 32) Flash Access Channel Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t BUSY:1;                    /**< bit:      0  This bit is set to '1' when a '1' is written to the FLASH_START bit, and cleared either by hardware completion of the\n      requested operation or by firmware writing '1' to the ABORT_ACCESS bit. 1=The Channel is busy. 0=The Channel is not busy. */
    uint32_t :1;                        /**< bit:      1  Reserved                                      */
    uint32_t ERASE_BLOCK_SIZE:3;        /**< bit:   2..4  This is a read-only image of the equivalent field of the eSPI Configuration register. This field is set by the Master to\n      define what the Erase block size is for the Flash being used, and whether there is a choice available to firmware.\n      111b = Reserved\n      110b = Reserved\n      101b = 256K\n      100b = 128K\n      010b = 64K\n      011b = Both 4K and 64K allowed (see FUNCTION field)\n      001b = 4K\n      000b = Reserved. */
    uint32_t :3;                        /**< bit:   5..7  Reserved                                      */
    uint32_t FLASH_MAXIMUM_PAYLOAD_SELECTED:3;  /**< bit:  8..10  This is a read-only image of the equivalent field of the eSPI Configuration register, set by the Master to declare the\n      maximum number of bytes that can be used in a single Flash payload, in either direction. It will never be set greater than the value\n      provided by the EC in the FLASH_MAXIMUM_PAYLOAD_SIZE_SUPPORTED field in the eSPI Flash Channel Capabilities Register.\n      100b -- 111b = Reserved\n      011b = 256 bytes\n      010b = 128 bytes\n      001b = 64 bytes\n      000b = Reserved. */
    uint32_t :1;                        /**< bit:     11  Reserved                                      */
    uint32_t FLASH_MAXIMUM_READ_REQUEST_SIZE:3;  /**< bit: 12..14  This comes read-only from the eSPI Configuration register, set by the Master to declare the maximum number of bytes\n      that can be requested by the EC in a single Flash Read request packet.\n      111b = 4K bytes\n      110b = 2K bytes\n      101b = 1K bytes\n      100b = 512 bytes\n      011b = 256 bytes\n      010b = 128 bytes\n      001b = 64 bytes\n      000b = Reserved. */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_FLASH_CH_CONFIG_bits_t;
#define ESPI_IO_FLASH_CH_CONFIG_RESETVALUE  (0x00U)                                       /**<  (ESPI_IO_FLASH_CH_CONFIG) Flash Access Channel Configuration Register  Reset Value */

#define ESPI_IO_FLASH_CH_CONFIG_BUSY_Pos      (0)                                            /**< (ESPI_IO_FLASH_CH_CONFIG) This bit is set to '1' when a '1' is written to the FLASH_START bit, and cleared either by hardware completion of the\n      requested operation or by firmware writing '1' to the ABORT_ACCESS bit. 1=The Channel is busy. 0=The Channel is not busy. Position */
#define ESPI_IO_FLASH_CH_CONFIG_BUSY_Msk      (0x1U << ESPI_IO_FLASH_CH_CONFIG_BUSY_Pos)     /**< (ESPI_IO_FLASH_CH_CONFIG) This bit is set to '1' when a '1' is written to the FLASH_START bit, and cleared either by hardware completion of the\n      requested operation or by firmware writing '1' to the ABORT_ACCESS bit. 1=The Channel is busy. 0=The Channel is not busy. Mask */
#define ESPI_IO_FLASH_CH_CONFIG_ERASE_BLOCK_SIZE_Pos (2)                                            /**< (ESPI_IO_FLASH_CH_CONFIG) This is a read-only image of the equivalent field of the eSPI Configuration register. This field is set by the Master to\n      define what the Erase block size is for the Flash being used, and whether there is a choice available to firmware.\n      111b = Reserved\n      110b = Reserved\n      101b = 256K\n      100b = 128K\n      010b = 64K\n      011b = Both 4K and 64K allowed (see FUNCTION field)\n      001b = 4K\n      000b = Reserved. Position */
#define ESPI_IO_FLASH_CH_CONFIG_ERASE_BLOCK_SIZE_Msk (0x7U << ESPI_IO_FLASH_CH_CONFIG_ERASE_BLOCK_SIZE_Pos)  /**< (ESPI_IO_FLASH_CH_CONFIG) This is a read-only image of the equivalent field of the eSPI Configuration register. This field is set by the Master to\n      define what the Erase block size is for the Flash being used, and whether there is a choice available to firmware.\n      111b = Reserved\n      110b = Reserved\n      101b = 256K\n      100b = 128K\n      010b = 64K\n      011b = Both 4K and 64K allowed (see FUNCTION field)\n      001b = 4K\n      000b = Reserved. Mask */
#define ESPI_IO_FLASH_CH_CONFIG_ERASE_BLOCK_SIZE(value) (ESPI_IO_FLASH_CH_CONFIG_ERASE_BLOCK_SIZE_Msk & ((value) << ESPI_IO_FLASH_CH_CONFIG_ERASE_BLOCK_SIZE_Pos))
#define ESPI_IO_FLASH_CH_CONFIG_FLASH_MAXIMUM_PAYLOAD_SELECTED_Pos (8)                                            /**< (ESPI_IO_FLASH_CH_CONFIG) This is a read-only image of the equivalent field of the eSPI Configuration register, set by the Master to declare the\n      maximum number of bytes that can be used in a single Flash payload, in either direction. It will never be set greater than the value\n      provided by the EC in the FLASH_MAXIMUM_PAYLOAD_SIZE_SUPPORTED field in the eSPI Flash Channel Capabilities Register.\n      100b -- 111b = Reserved\n      011b = 256 bytes\n      010b = 128 bytes\n      001b = 64 bytes\n      000b = Reserved. Position */
#define ESPI_IO_FLASH_CH_CONFIG_FLASH_MAXIMUM_PAYLOAD_SELECTED_Msk (0x7U << ESPI_IO_FLASH_CH_CONFIG_FLASH_MAXIMUM_PAYLOAD_SELECTED_Pos)  /**< (ESPI_IO_FLASH_CH_CONFIG) This is a read-only image of the equivalent field of the eSPI Configuration register, set by the Master to declare the\n      maximum number of bytes that can be used in a single Flash payload, in either direction. It will never be set greater than the value\n      provided by the EC in the FLASH_MAXIMUM_PAYLOAD_SIZE_SUPPORTED field in the eSPI Flash Channel Capabilities Register.\n      100b -- 111b = Reserved\n      011b = 256 bytes\n      010b = 128 bytes\n      001b = 64 bytes\n      000b = Reserved. Mask */
#define ESPI_IO_FLASH_CH_CONFIG_FLASH_MAXIMUM_PAYLOAD_SELECTED(value) (ESPI_IO_FLASH_CH_CONFIG_FLASH_MAXIMUM_PAYLOAD_SELECTED_Msk & ((value) << ESPI_IO_FLASH_CH_CONFIG_FLASH_MAXIMUM_PAYLOAD_SELECTED_Pos))
#define ESPI_IO_FLASH_CH_CONFIG_FLASH_MAXIMUM_READ_REQUEST_SIZE_Pos (12)                                           /**< (ESPI_IO_FLASH_CH_CONFIG) This comes read-only from the eSPI Configuration register, set by the Master to declare the maximum number of bytes\n      that can be requested by the EC in a single Flash Read request packet.\n      111b = 4K bytes\n      110b = 2K bytes\n      101b = 1K bytes\n      100b = 512 bytes\n      011b = 256 bytes\n      010b = 128 bytes\n      001b = 64 bytes\n      000b = Reserved. Position */
#define ESPI_IO_FLASH_CH_CONFIG_FLASH_MAXIMUM_READ_REQUEST_SIZE_Msk (0x7U << ESPI_IO_FLASH_CH_CONFIG_FLASH_MAXIMUM_READ_REQUEST_SIZE_Pos)  /**< (ESPI_IO_FLASH_CH_CONFIG) This comes read-only from the eSPI Configuration register, set by the Master to declare the maximum number of bytes\n      that can be requested by the EC in a single Flash Read request packet.\n      111b = 4K bytes\n      110b = 2K bytes\n      101b = 1K bytes\n      100b = 512 bytes\n      011b = 256 bytes\n      010b = 128 bytes\n      001b = 64 bytes\n      000b = Reserved. Mask */
#define ESPI_IO_FLASH_CH_CONFIG_FLASH_MAXIMUM_READ_REQUEST_SIZE(value) (ESPI_IO_FLASH_CH_CONFIG_FLASH_MAXIMUM_READ_REQUEST_SIZE_Msk & ((value) << ESPI_IO_FLASH_CH_CONFIG_FLASH_MAXIMUM_READ_REQUEST_SIZE_Pos))
#define ESPI_IO_FLASH_CH_CONFIG_Msk           (0x0000771DUL)                                 /**< (ESPI_IO_FLASH_CH_CONFIG) Register Mask  */

/* -------- ESPI_IO_FLASH_CH_STATUS : (ESPI_IO Offset: 0x2a0) (R/W 32) Flash Access Channel Status Register -------- */

typedef union
{
  struct
  {
    uint32_t CHANNEL_ENABLE_STATUS:1;   /**< bit:      0  This bit is a Read-only image of the bit Flash Access Channel Enable in the eSPI Configuration space. Rising or\n      falling edges of this bit will set the CHANNEL_ENABLE_CHANGE_STATUS bit to 1, and may be used to trigger interrupts. A falling edge\n      on this bit, while Busy==1, will also clear the Busy bit and set the DONE bit, with DISABLED_BY_MASTER status.\n      1=Flash Access Channel Enable bit = 1. 0=Flash Access Channel Enable bit = 0. */
    uint32_t CHANNEL_ENABLE_CHANGE_STATUS:1;  /**< bit:      1  0=Flash Access Enable bit in eSPI Configuration space has not been changed since this bit was last cleared.\n      1=Flash Access Enable bit in eSPI Configuration space has been changed since this bit was last cleared.\n      The current state of the Flash Access Enable bit can be seen as the read-only bit CHANNEL_ENABLE_STATUS in this register.\n      This bit is cleared by writing '1'. (R/WC) */
    uint32_t DONE:1;                    /**< bit:      2  1=Channel is done=Busy bit has been cleared since this bit was last cleared. It is cleared by writing '1'. (R/WC)\n      0=Channel is not done=Busy bit has not been cleared since this bit was last cleared. */
    uint32_t DISABLED_BY_MASTER:1;      /**< bit:      3  This bit is set to '1' if the Flash Channel is disabled by the Master while the Busy bit is '1'. It is cleared by writing '1'. (R/WC)      1=The command finished because the Enable bit became 0. 0=The command finished without a change in the Enable bit. */
    uint32_t INTERNAL_BUS_ERROR:1;      /**< bit:      4  This bit is set to '1' if the internal bus master associated with the Flash Access Channel encounters a Bus Fault condition.\n      It is cleared by writing '1'. (R/WC)\n      1=Bus Error detected. 0=The command finished without a Bus Error. */
    uint32_t ABORTED_BY_SLAVE:1;        /**< bit:      5  This bit is set to '1' if the Abort bit is set to '1' by firmware while the Busy bit is '1', thereby clearing Busy status.\n      It is cleared by writing '1'. (R/WC)\n      1=The command finished because of the Abort bit. 0=The command finished without an Abort bit activation. */
    uint32_t DATA_OVERRUN:1;            /**< bit:      6  This bit is set to '1' by a SUCCESSFUL COMPLETION response by the eSPI Master to a Read sequence, but either without\n      indicating Final Completion when the requested byte count is reached or with too many bytes provided while indicating Final Completion.\n      It is cleared by writing '1'. (R/WC)\n      1=The eSPI Master finished with too much data. 0=The eSPI Master finished without too much data. */
    uint32_t INCOMPLETE:1;              /**< bit:      7  This bit is set to '1' by a SUCCESSFUL COMPLETION Read response from the eSPI Master, indicating a Final Completion, but\n      with too few bytes provided for the Transaction step that was issued by the eSPI Slave. It is cleared by writing '1'.\n      This bit is cleared by writing '1'. (R/WC)\n      1=The eSPI Master finished with too little data. 0=The eSPI Master finished with at least enough data. */
    uint32_t FAIL:1;                    /**< bit:      8  This bit is set to '1' by an explicit UNSUCCESSFUL COMPLETION response from the eSPI Master, which also terminates\n      the transaction sequence. This may occur if an invalid or illegal section of Flash memory is accessed, and only at Runtime (post-boot).\n      This bit is cleared by writing '1'. (R/WC)\n      1=The eSPI Master indicated unsuccessful completion.\n      0=The eSPI Master indicated successful completion. */
    uint32_t START_OVERFLOW:1;          /**< bit:      9  This bit is set if a command (initiated by setting the Start bit) has been ignored because the Busy bit was already on.\n      The transfer in progress is also brought to the Done state at the next opportunity allowed by the eSPI protocol, as if the Abort bit\n      had been set by the firmware, so that this bit will be present at a Done interrupt. This bit is cleared by writing '1'. (R/WC)\n      This flag represents a serious mis-communication between the firmware and hardware, and should be handled cautiously as a\n      special case by firmware.\n      1=Start Overflow. Firmware has attempted to trigger a transaction sequence before allowing the previous sequence to finish and\n      without using the Abort bit to terminate it first\n      0=No Start Overflow detected. */
    uint32_t :1;                        /**< bit:     10  Reserved                                      */
    uint32_t BAD_REQUEST:1;             /**< bit:     11  This bit is set to '1' when a firmware Flash Access request is invalid. For example, this bit is set for a request\n      to Read or Write 0 bytes. This bit is cleared by writing '1'. (R/WC) */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_IO_FLASH_CH_STATUS_bits_t;
#define ESPI_IO_FLASH_CH_STATUS_RESETVALUE  (0x00U)                                       /**<  (ESPI_IO_FLASH_CH_STATUS) Flash Access Channel Status Register  Reset Value */

