ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
#define ESPI_IO_FLASH_CH_STATUS_CHANNEL_ENABLE_STATUS_Pos (0)                                            /**< (ESPI_IO_FLASH_CH_STATUS) This bit is a Read-only image of the bit Flash Access Channel Enable in the eSPI Configuration space. Rising or\n      falling edges of this bit will set the CHANNEL_ENABLE_CHANGE_STATUS bit to 1, and may be used to trigger interrupts. A falling edge\n      on this bit, while Busy==1, will also clear the Busy bit and set the DONE bit, with DISABLED_BY_MASTER status.\n      1=Flash Access Channel Enable bit = 1. 0=Flash Access Channel Enable bit = 0. Position */
#define ESPI_IO_FLASH_CH_STATUS_CHANNEL_ENABLE_STATUS_Msk (0x1U << ESPI_IO_FLASH_CH_STATUS_CHANNEL_ENABLE_STATUS_Pos)  /**< (ESPI_IO_FLASH_CH_STATUS) This bit is a Read-only image of the bit Flash Access Channel Enable in the eSPI Configuration space. Rising or\n      falling edges of this bit will set the CHANNEL_ENABLE_CHANGE_STATUS bit to 1, and may be used to trigger interrupts. A falling edge\n      on this bit, while Busy==1, will also clear the Busy bit and set the DONE bit, with DISABLED_BY_MASTER status.\n      1=Flash Access Channel Enable bit = 1. 0=Flash Access Channel Enable bit = 0. Mask */
#define ESPI_IO_FLASH_CH_STATUS_CHANNEL_ENABLE_CHANGE_STATUS_Pos (1)                                            /**< (ESPI_IO_FLASH_CH_STATUS) 0=Flash Access Enable bit in eSPI Configuration space has not been changed since this bit was last cleared.\n      1=Flash Access Enable bit in eSPI Configuration space has been changed since this bit was last cleared.\n      The current state of the Flash Access Enable bit can be seen as the read-only bit CHANNEL_ENABLE_STATUS in this register.\n      This bit is cleared by writing '1'. (R/WC) Position */
#define ESPI_IO_FLASH_CH_STATUS_CHANNEL_ENABLE_CHANGE_STATUS_Msk (0x1U << ESPI_IO_FLASH_CH_STATUS_CHANNEL_ENABLE_CHANGE_STATUS_Pos)  /**< (ESPI_IO_FLASH_CH_STATUS) 0=Flash Access Enable bit in eSPI Configuration space has not been changed since this bit was last cleared.\n      1=Flash Access Enable bit in eSPI Configuration space has been changed since this bit was last cleared.\n      The current state of the Flash Access Enable bit can be seen as the read-only bit CHANNEL_ENABLE_STATUS in this register.\n      This bit is cleared by writing '1'. (R/WC) Mask */
#define ESPI_IO_FLASH_CH_STATUS_DONE_Pos      (2)                                            /**< (ESPI_IO_FLASH_CH_STATUS) 1=Channel is done=Busy bit has been cleared since this bit was last cleared. It is cleared by writing '1'. (R/WC)\n      0=Channel is not done=Busy bit has not been cleared since this bit was last cleared. Position */
#define ESPI_IO_FLASH_CH_STATUS_DONE_Msk      (0x1U << ESPI_IO_FLASH_CH_STATUS_DONE_Pos)     /**< (ESPI_IO_FLASH_CH_STATUS) 1=Channel is done=Busy bit has been cleared since this bit was last cleared. It is cleared by writing '1'. (R/WC)\n      0=Channel is not done=Busy bit has not been cleared since this bit was last cleared. Mask */
#define ESPI_IO_FLASH_CH_STATUS_DISABLED_BY_MASTER_Pos (3)                                            /**< (ESPI_IO_FLASH_CH_STATUS) This bit is set to '1' if the Flash Channel is disabled by the Master while the Busy bit is '1'. It is cleared by writing '1'. (R/WC)      1=The command finished because the Enable bit became 0. 0=The command finished without a change in the Enable bit. Position */
#define ESPI_IO_FLASH_CH_STATUS_DISABLED_BY_MASTER_Msk (0x1U << ESPI_IO_FLASH_CH_STATUS_DISABLED_BY_MASTER_Pos)  /**< (ESPI_IO_FLASH_CH_STATUS) This bit is set to '1' if the Flash Channel is disabled by the Master while the Busy bit is '1'. It is cleared by writing '1'. (R/WC)      1=The command finished because the Enable bit became 0. 0=The command finished without a change in the Enable bit. Mask */
#define ESPI_IO_FLASH_CH_STATUS_INTERNAL_BUS_ERROR_Pos (4)                                            /**< (ESPI_IO_FLASH_CH_STATUS) This bit is set to '1' if the internal bus master associated with the Flash Access Channel encounters a Bus Fault condition.\n      It is cleared by writing '1'. (R/WC)\n      1=Bus Error detected. 0=The command finished without a Bus Error. Position */
#define ESPI_IO_FLASH_CH_STATUS_INTERNAL_BUS_ERROR_Msk (0x1U << ESPI_IO_FLASH_CH_STATUS_INTERNAL_BUS_ERROR_Pos)  /**< (ESPI_IO_FLASH_CH_STATUS) This bit is set to '1' if the internal bus master associated with the Flash Access Channel encounters a Bus Fault condition.\n      It is cleared by writing '1'. (R/WC)\n      1=Bus Error detected. 0=The command finished without a Bus Error. Mask */
#define ESPI_IO_FLASH_CH_STATUS_ABORTED_BY_SLAVE_Pos (5)                                            /**< (ESPI_IO_FLASH_CH_STATUS) This bit is set to '1' if the Abort bit is set to '1' by firmware while the Busy bit is '1', thereby clearing Busy status.\n      It is cleared by writing '1'. (R/WC)\n      1=The command finished because of the Abort bit. 0=The command finished without an Abort bit activation. Position */
#define ESPI_IO_FLASH_CH_STATUS_ABORTED_BY_SLAVE_Msk (0x1U << ESPI_IO_FLASH_CH_STATUS_ABORTED_BY_SLAVE_Pos)  /**< (ESPI_IO_FLASH_CH_STATUS) This bit is set to '1' if the Abort bit is set to '1' by firmware while the Busy bit is '1', thereby clearing Busy status.\n      It is cleared by writing '1'. (R/WC)\n      1=The command finished because of the Abort bit. 0=The command finished without an Abort bit activation. Mask */
#define ESPI_IO_FLASH_CH_STATUS_DATA_OVERRUN_Pos (6)                                            /**< (ESPI_IO_FLASH_CH_STATUS) This bit is set to '1' by a SUCCESSFUL COMPLETION response by the eSPI Master to a Read sequence, but either without\n      indicating Final Completion when the requested byte count is reached or with too many bytes provided while indicating Final Completion.\n      It is cleared by writing '1'. (R/WC)\n      1=The eSPI Master finished with too much data. 0=The eSPI Master finished without too much data. Position */
#define ESPI_IO_FLASH_CH_STATUS_DATA_OVERRUN_Msk (0x1U << ESPI_IO_FLASH_CH_STATUS_DATA_OVERRUN_Pos)  /**< (ESPI_IO_FLASH_CH_STATUS) This bit is set to '1' by a SUCCESSFUL COMPLETION response by the eSPI Master to a Read sequence, but either without\n      indicating Final Completion when the requested byte count is reached or with too many bytes provided while indicating Final Completion.\n      It is cleared by writing '1'. (R/WC)\n      1=The eSPI Master finished with too much data. 0=The eSPI Master finished without too much data. Mask */
#define ESPI_IO_FLASH_CH_STATUS_INCOMPLETE_Pos (7)                                            /**< (ESPI_IO_FLASH_CH_STATUS) This bit is set to '1' by a SUCCESSFUL COMPLETION Read response from the eSPI Master, indicating a Final Completion, but\n      with too few bytes provided for the Transaction step that was issued by the eSPI Slave. It is cleared by writing '1'.\n      This bit is cleared by writing '1'. (R/WC)\n      1=The eSPI Master finished with too little data. 0=The eSPI Master finished with at least enough data. Position */
#define ESPI_IO_FLASH_CH_STATUS_INCOMPLETE_Msk (0x1U << ESPI_IO_FLASH_CH_STATUS_INCOMPLETE_Pos)  /**< (ESPI_IO_FLASH_CH_STATUS) This bit is set to '1' by a SUCCESSFUL COMPLETION Read response from the eSPI Master, indicating a Final Completion, but\n      with too few bytes provided for the Transaction step that was issued by the eSPI Slave. It is cleared by writing '1'.\n      This bit is cleared by writing '1'. (R/WC)\n      1=The eSPI Master finished with too little data. 0=The eSPI Master finished with at least enough data. Mask */
#define ESPI_IO_FLASH_CH_STATUS_FAIL_Pos      (8)                                            /**< (ESPI_IO_FLASH_CH_STATUS) This bit is set to '1' by an explicit UNSUCCESSFUL COMPLETION response from the eSPI Master, which also terminates\n      the transaction sequence. This may occur if an invalid or illegal section of Flash memory is accessed, and only at Runtime (post-boot).\n      This bit is cleared by writing '1'. (R/WC)\n      1=The eSPI Master indicated unsuccessful completion.\n      0=The eSPI Master indicated successful completion. Position */
#define ESPI_IO_FLASH_CH_STATUS_FAIL_Msk      (0x1U << ESPI_IO_FLASH_CH_STATUS_FAIL_Pos)     /**< (ESPI_IO_FLASH_CH_STATUS) This bit is set to '1' by an explicit UNSUCCESSFUL COMPLETION response from the eSPI Master, which also terminates\n      the transaction sequence. This may occur if an invalid or illegal section of Flash memory is accessed, and only at Runtime (post-boot).\n      This bit is cleared by writing '1'. (R/WC)\n      1=The eSPI Master indicated unsuccessful completion.\n      0=The eSPI Master indicated successful completion. Mask */
#define ESPI_IO_FLASH_CH_STATUS_START_OVERFLOW_Pos (9)                                            /**< (ESPI_IO_FLASH_CH_STATUS) This bit is set if a command (initiated by setting the Start bit) has been ignored because the Busy bit was already on.\n      The transfer in progress is also brought to the Done state at the next opportunity allowed by the eSPI protocol, as if the Abort bit\n      had been set by the firmware, so that this bit will be present at a Done interrupt. This bit is cleared by writing '1'. (R/WC)\n      This flag represents a serious mis-communication between the firmware and hardware, and should be handled cautiously as a\n      special case by firmware.\n      1=Start Overflow. Firmware has attempted to trigger a transaction sequence before allowing the previous sequence to finish and\n      without using the Abort bit to terminate it first\n      0=No Start Overflow detected. Position */
#define ESPI_IO_FLASH_CH_STATUS_START_OVERFLOW_Msk (0x1U << ESPI_IO_FLASH_CH_STATUS_START_OVERFLOW_Pos)  /**< (ESPI_IO_FLASH_CH_STATUS) This bit is set if a command (initiated by setting the Start bit) has been ignored because the Busy bit was already on.\n      The transfer in progress is also brought to the Done state at the next opportunity allowed by the eSPI protocol, as if the Abort bit\n      had been set by the firmware, so that this bit will be present at a Done interrupt. This bit is cleared by writing '1'. (R/WC)\n      This flag represents a serious mis-communication between the firmware and hardware, and should be handled cautiously as a\n      special case by firmware.\n      1=Start Overflow. Firmware has attempted to trigger a transaction sequence before allowing the previous sequence to finish and\n      without using the Abort bit to terminate it first\n      0=No Start Overflow detected. Mask */
#define ESPI_IO_FLASH_CH_STATUS_BAD_REQUEST_Pos (11)                                           /**< (ESPI_IO_FLASH_CH_STATUS) This bit is set to '1' when a firmware Flash Access request is invalid. For example, this bit is set for a request\n      to Read or Write 0 bytes. This bit is cleared by writing '1'. (R/WC) Position */
#define ESPI_IO_FLASH_CH_STATUS_BAD_REQUEST_Msk (0x1U << ESPI_IO_FLASH_CH_STATUS_BAD_REQUEST_Pos)  /**< (ESPI_IO_FLASH_CH_STATUS) This bit is set to '1' when a firmware Flash Access request is invalid. For example, this bit is set for a request\n      to Read or Write 0 bytes. This bit is cleared by writing '1'. (R/WC) Mask */
#define ESPI_IO_FLASH_CH_STATUS_Msk           (0x00000BFFUL)                                 /**< (ESPI_IO_FLASH_CH_STATUS) Register Mask  */

/* -------- ESPI_IO_VWIRE_STATUS : (ESPI_IO Offset: 0x2b0) (R/ 8) Virtual Wire Status Register -------- */

typedef union
{
  struct
  {
    uint8_t  CHANNEL_ENABLE_STATUS:1;   /**< bit:      0  This bit is a Read-only image of the bit Virtual Wire Channel Enable in the eSPI Configuration space.\n      1=Virtual Wire Channel Enable bit = 1; 0=Virtual Wire Channel Enable bit = 0. */
    uint8_t  :7;                        /**< bit:   1..7  Reserved                                      */
  };
  uint8_t  w;
} __ESPI_IO_VWIRE_STATUS_bits_t;
#define ESPI_IO_VWIRE_STATUS_RESETVALUE     (0x00U)                                       /**<  (ESPI_IO_VWIRE_STATUS) Virtual Wire Status Register  Reset Value */

