ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
#define ESPI_IO_VWIRE_STATUS_CHANNEL_ENABLE_STATUS_Pos (0)                                            /**< (ESPI_IO_VWIRE_STATUS) This bit is a Read-only image of the bit Virtual Wire Channel Enable in the eSPI Configuration space.\n      1=Virtual Wire Channel Enable bit = 1; 0=Virtual Wire Channel Enable bit = 0. Position */
#define ESPI_IO_VWIRE_STATUS_CHANNEL_ENABLE_STATUS_Msk (0x1U << ESPI_IO_VWIRE_STATUS_CHANNEL_ENABLE_STATUS_Pos)  /**< (ESPI_IO_VWIRE_STATUS) This bit is a Read-only image of the bit Virtual Wire Channel Enable in the eSPI Configuration space.\n      1=Virtual Wire Channel Enable bit = 1; 0=Virtual Wire Channel Enable bit = 0. Mask */
#define ESPI_IO_VWIRE_STATUS_Msk              (0x00000001UL)                                 /**< (ESPI_IO_VWIRE_STATUS) Register Mask  */

/* -------- ESPI_IO_ESPI_CAPABILITIES_ID : (ESPI_IO Offset: 0x2e0) (R/W 8) eSPI Capabilities ID Register -------- */

typedef union
{
  struct
  {
    uint8_t  ESPI_DEVICE_ID:8;          /**< bit:   0..7  The default value should not be changed.      */
  };
  uint8_t  w;
} __ESPI_IO_ESPI_CAPABILITIES_ID_bits_t;
#define ESPI_IO_ESPI_CAPABILITIES_ID_RESETVALUE (0x01U)                                       /**<  (ESPI_IO_ESPI_CAPABILITIES_ID) eSPI Capabilities ID Register  Reset Value */

#define ESPI_IO_ESPI_CAPABILITIES_ID_ESPI_DEVICE_ID_Pos (0)                                            /**< (ESPI_IO_ESPI_CAPABILITIES_ID) The default value should not be changed. Position */
#define ESPI_IO_ESPI_CAPABILITIES_ID_ESPI_DEVICE_ID_Msk (0xFFU << ESPI_IO_ESPI_CAPABILITIES_ID_ESPI_DEVICE_ID_Pos)  /**< (ESPI_IO_ESPI_CAPABILITIES_ID) The default value should not be changed. Mask */
#define ESPI_IO_ESPI_CAPABILITIES_ID_ESPI_DEVICE_ID(value) (ESPI_IO_ESPI_CAPABILITIES_ID_ESPI_DEVICE_ID_Msk & ((value) << ESPI_IO_ESPI_CAPABILITIES_ID_ESPI_DEVICE_ID_Pos))
#define ESPI_IO_ESPI_CAPABILITIES_ID_Msk      (0x000000FFUL)                                 /**< (ESPI_IO_ESPI_CAPABILITIES_ID) Register Mask  */

/* -------- ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0 : (ESPI_IO Offset: 0x2e1) (R/W 8) eSPI Capabilities Global Capabilities 0 Register -------- */

typedef union
{
  struct
  {
    uint8_t  PERIPHERAL_CHANNEL_SUPPORTED:1;  /**< bit:      0  1=Peripheral Channel is supported by the slave; 0=Peripheral Channel not supported by the slave. */
    uint8_t  VIRTUAL_WIRE_CHANNEL_SUPPORTED:1;  /**< bit:      1  1=Virtual Wire Channel is supported by the slave; 0=Virtual Wire Channel Channel not supported by the slave. */
    uint8_t  OOB_MESSAGE_CHANNEL_SUPPORTED:1;  /**< bit:      2  1=OOB Message Channel is supported by the slave; 0=OOB Message Channel not supported by the slave. */
    uint8_t  FLASH_ACCESS_CHANNEL_SUPPORTED:1;  /**< bit:      3  1=Flash Access Channel is supported by the slave; 0=Flash Access Channel not supported by the slave. */
    uint8_t  :4;                        /**< bit:   4..7  Reserved                                      */
  };
  uint8_t  w;
} __ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0_bits_t;
#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0_RESETVALUE (0x0FU)                                       /**<  (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0) eSPI Capabilities Global Capabilities 0 Register  Reset Value */

#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0_PERIPHERAL_CHANNEL_SUPPORTED_Pos (0)                                            /**< (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0) 1=Peripheral Channel is supported by the slave; 0=Peripheral Channel not supported by the slave. Position */
#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0_PERIPHERAL_CHANNEL_SUPPORTED_Msk (0x1U << ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0_PERIPHERAL_CHANNEL_SUPPORTED_Pos)  /**< (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0) 1=Peripheral Channel is supported by the slave; 0=Peripheral Channel not supported by the slave. Mask */
#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0_VIRTUAL_WIRE_CHANNEL_SUPPORTED_Pos (1)                                            /**< (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0) 1=Virtual Wire Channel is supported by the slave; 0=Virtual Wire Channel Channel not supported by the slave. Position */
#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0_VIRTUAL_WIRE_CHANNEL_SUPPORTED_Msk (0x1U << ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0_VIRTUAL_WIRE_CHANNEL_SUPPORTED_Pos)  /**< (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0) 1=Virtual Wire Channel is supported by the slave; 0=Virtual Wire Channel Channel not supported by the slave. Mask */
#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0_OOB_MESSAGE_CHANNEL_SUPPORTED_Pos (2)                                            /**< (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0) 1=OOB Message Channel is supported by the slave; 0=OOB Message Channel not supported by the slave. Position */
#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0_OOB_MESSAGE_CHANNEL_SUPPORTED_Msk (0x1U << ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0_OOB_MESSAGE_CHANNEL_SUPPORTED_Pos)  /**< (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0) 1=OOB Message Channel is supported by the slave; 0=OOB Message Channel not supported by the slave. Mask */
#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0_FLASH_ACCESS_CHANNEL_SUPPORTED_Pos (3)                                            /**< (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0) 1=Flash Access Channel is supported by the slave; 0=Flash Access Channel not supported by the slave. Position */
#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0_FLASH_ACCESS_CHANNEL_SUPPORTED_Msk (0x1U << ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0_FLASH_ACCESS_CHANNEL_SUPPORTED_Pos)  /**< (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0) 1=Flash Access Channel is supported by the slave; 0=Flash Access Channel not supported by the slave. Mask */
#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0_Msk (0x0000000FUL)                                 /**< (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0) Register Mask  */

/* -------- ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1 : (ESPI_IO Offset: 0x2e2) (R/W 8) eSPI Capabilities Global Capabilities 1 Register -------- */

typedef union
{
  struct
  {
    uint8_t  MAXIMUM_FREQUENCY_SUPPORTED:3;  /**< bit:   0..2  This field identifies the maximum frequency of operation supported by the slave. It corresponds to the field\n      Maximum Frequency Supported, bits [18:16] of the eSPI General Capabilities and Configurations register.\n      111b - 101b=Reserved\n      100b=66 MHz\n      011b=50 MHz\n      010b=33 MHz\n      001b=25 MHz\n      000b=20 MHz (default). */
    uint8_t  ALERT_MODE:1;              /**< bit:      3  This field is a read-only copy of the ALERT Mode field, bit 28 of the Config Offset 8h=General Capabilities\n      and Configurations Register. */
    uint8_t  IO_MODE_SUPPORTED:2;       /**< bit:   4..5  This field identifies the I/O modes supported by the slave. It corresponds to the field I/O Mode Support,\n      bits [25:24] of the eSPI General Capabilities and Configurations register.\n      11b=Single, Dual and Quad I/O\n      10b=Single and Quad I/O\n      01b=Single and Dual I/O\n      00b=Single I/O (default). */
    uint8_t  :2;                        /**< bit:   6..7  Reserved                                      */
  };
  uint8_t  w;
} __ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1_bits_t;
#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1_RESETVALUE (0x0FU)                                       /**<  (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1) eSPI Capabilities Global Capabilities 1 Register  Reset Value */

#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1_MAXIMUM_FREQUENCY_SUPPORTED_Pos (0)                                            /**< (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1) This field identifies the maximum frequency of operation supported by the slave. It corresponds to the field\n      Maximum Frequency Supported, bits [18:16] of the eSPI General Capabilities and Configurations register.\n      111b - 101b=Reserved\n      100b=66 MHz\n      011b=50 MHz\n      010b=33 MHz\n      001b=25 MHz\n      000b=20 MHz (default). Position */
#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1_MAXIMUM_FREQUENCY_SUPPORTED_Msk (0x7U << ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1_MAXIMUM_FREQUENCY_SUPPORTED_Pos)  /**< (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1) This field identifies the maximum frequency of operation supported by the slave. It corresponds to the field\n      Maximum Frequency Supported, bits [18:16] of the eSPI General Capabilities and Configurations register.\n      111b - 101b=Reserved\n      100b=66 MHz\n      011b=50 MHz\n      010b=33 MHz\n      001b=25 MHz\n      000b=20 MHz (default). Mask */
#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1_MAXIMUM_FREQUENCY_SUPPORTED(value) (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1_MAXIMUM_FREQUENCY_SUPPORTED_Msk & ((value) << ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1_MAXIMUM_FREQUENCY_SUPPORTED_Pos))
#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1_ALERT_MODE_Pos (3)                                            /**< (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1) This field is a read-only copy of the ALERT Mode field, bit 28 of the Config Offset 8h=General Capabilities\n      and Configurations Register. Position */
#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1_ALERT_MODE_Msk (0x1U << ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1_ALERT_MODE_Pos)  /**< (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1) This field is a read-only copy of the ALERT Mode field, bit 28 of the Config Offset 8h=General Capabilities\n      and Configurations Register. Mask */
#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1_IO_MODE_SUPPORTED_Pos (4)                                            /**< (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1) This field identifies the I/O modes supported by the slave. It corresponds to the field I/O Mode Support,\n      bits [25:24] of the eSPI General Capabilities and Configurations register.\n      11b=Single, Dual and Quad I/O\n      10b=Single and Quad I/O\n      01b=Single and Dual I/O\n      00b=Single I/O (default). Position */
#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1_IO_MODE_SUPPORTED_Msk (0x3U << ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1_IO_MODE_SUPPORTED_Pos)  /**< (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1) This field identifies the I/O modes supported by the slave. It corresponds to the field I/O Mode Support,\n      bits [25:24] of the eSPI General Capabilities and Configurations register.\n      11b=Single, Dual and Quad I/O\n      10b=Single and Quad I/O\n      01b=Single and Dual I/O\n      00b=Single I/O (default). Mask */
#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1_IO_MODE_SUPPORTED(value) (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1_IO_MODE_SUPPORTED_Msk & ((value) << ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1_IO_MODE_SUPPORTED_Pos))
#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1_Msk (0x0000003FUL)                                 /**< (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1) Register Mask  */

/* -------- ESPI_IO_ESPI_PC_CAPABILITIES : (ESPI_IO Offset: 0x2e3) (R/W 8) eSPI Peripheral Channel Capabilities Register -------- */

typedef union
{
  struct
  {
    uint8_t  PC_MAXIMUM_PAYLOAD_SIZE_SUPPORTED:3;  /**< bit:   0..2  This field identifies the maximum payload size supported by the slave. It corresponds to the field\n      Peripheral Channel Maximum Payload Size Supported, bits [6:4] of the Peripheral Channel Capabilities and Configurations Register.\n      111b - 100b=Reserved\n      011b=256 bytes address aligned max payload size\n      010b=128 bytes address aligned max payload size\n      001b=64 bytes address aligned max payload size\n      000b=Reserved. */
    uint8_t  :5;                        /**< bit:   3..7  Reserved                                      */
  };
  uint8_t  w;
} __ESPI_IO_ESPI_PC_CAPABILITIES_bits_t;
#define ESPI_IO_ESPI_PC_CAPABILITIES_RESETVALUE (0x01U)                                       /**<  (ESPI_IO_ESPI_PC_CAPABILITIES) eSPI Peripheral Channel Capabilities Register  Reset Value */

