ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
#define ESPI_IO_ESPI_PC_CAPABILITIES_PC_MAXIMUM_PAYLOAD_SIZE_SUPPORTED_Pos (0)                                            /**< (ESPI_IO_ESPI_PC_CAPABILITIES) This field identifies the maximum payload size supported by the slave. It corresponds to the field\n      Peripheral Channel Maximum Payload Size Supported, bits [6:4] of the Peripheral Channel Capabilities and Configurations Register.\n      111b - 100b=Reserved\n      011b=256 bytes address aligned max payload size\n      010b=128 bytes address aligned max payload size\n      001b=64 bytes address aligned max payload size\n      000b=Reserved. Position */
#define ESPI_IO_ESPI_PC_CAPABILITIES_PC_MAXIMUM_PAYLOAD_SIZE_SUPPORTED_Msk (0x7U << ESPI_IO_ESPI_PC_CAPABILITIES_PC_MAXIMUM_PAYLOAD_SIZE_SUPPORTED_Pos)  /**< (ESPI_IO_ESPI_PC_CAPABILITIES) This field identifies the maximum payload size supported by the slave. It corresponds to the field\n      Peripheral Channel Maximum Payload Size Supported, bits [6:4] of the Peripheral Channel Capabilities and Configurations Register.\n      111b - 100b=Reserved\n      011b=256 bytes address aligned max payload size\n      010b=128 bytes address aligned max payload size\n      001b=64 bytes address aligned max payload size\n      000b=Reserved. Mask */
#define ESPI_IO_ESPI_PC_CAPABILITIES_PC_MAXIMUM_PAYLOAD_SIZE_SUPPORTED(value) (ESPI_IO_ESPI_PC_CAPABILITIES_PC_MAXIMUM_PAYLOAD_SIZE_SUPPORTED_Msk & ((value) << ESPI_IO_ESPI_PC_CAPABILITIES_PC_MAXIMUM_PAYLOAD_SIZE_SUPPORTED_Pos))
#define ESPI_IO_ESPI_PC_CAPABILITIES_Msk      (0x00000007UL)                                 /**< (ESPI_IO_ESPI_PC_CAPABILITIES) Register Mask  */

/* -------- ESPI_IO_ESPI_VWIRE_CAPABILITIES : (ESPI_IO Offset: 0x2e4) (R/W 8) eSPI Virtual Wire Channel Capabilities Register -------- */

typedef union
{
  struct
  {
    uint8_t  MAXIMUM_VIRTUAL_WIRE_COUNT_SUPPORTED:6;  /**< bit:   0..5  This field identifies the maximum Virtual Wire Count supported by the slave. It corresponds to the field\n      Maximum Virtual Wire Count Supported, bits [13:8] of the Virtual Wire Channel Capabilities and Configurations Register.\n      This field must be set to a number greater than or equal to 7h. */
    uint8_t  :2;                        /**< bit:   6..7  Reserved                                      */
  };
  uint8_t  w;
} __ESPI_IO_ESPI_VWIRE_CAPABILITIES_bits_t;
#define ESPI_IO_ESPI_VWIRE_CAPABILITIES_RESETVALUE (0x3FU)                                       /**<  (ESPI_IO_ESPI_VWIRE_CAPABILITIES) eSPI Virtual Wire Channel Capabilities Register  Reset Value */

#define ESPI_IO_ESPI_VWIRE_CAPABILITIES_MAXIMUM_VIRTUAL_WIRE_COUNT_SUPPORTED_Pos (0)                                            /**< (ESPI_IO_ESPI_VWIRE_CAPABILITIES) This field identifies the maximum Virtual Wire Count supported by the slave. It corresponds to the field\n      Maximum Virtual Wire Count Supported, bits [13:8] of the Virtual Wire Channel Capabilities and Configurations Register.\n      This field must be set to a number greater than or equal to 7h. Position */
#define ESPI_IO_ESPI_VWIRE_CAPABILITIES_MAXIMUM_VIRTUAL_WIRE_COUNT_SUPPORTED_Msk (0x3FU << ESPI_IO_ESPI_VWIRE_CAPABILITIES_MAXIMUM_VIRTUAL_WIRE_COUNT_SUPPORTED_Pos)  /**< (ESPI_IO_ESPI_VWIRE_CAPABILITIES) This field identifies the maximum Virtual Wire Count supported by the slave. It corresponds to the field\n      Maximum Virtual Wire Count Supported, bits [13:8] of the Virtual Wire Channel Capabilities and Configurations Register.\n      This field must be set to a number greater than or equal to 7h. Mask */
#define ESPI_IO_ESPI_VWIRE_CAPABILITIES_MAXIMUM_VIRTUAL_WIRE_COUNT_SUPPORTED(value) (ESPI_IO_ESPI_VWIRE_CAPABILITIES_MAXIMUM_VIRTUAL_WIRE_COUNT_SUPPORTED_Msk & ((value) << ESPI_IO_ESPI_VWIRE_CAPABILITIES_MAXIMUM_VIRTUAL_WIRE_COUNT_SUPPORTED_Pos))
#define ESPI_IO_ESPI_VWIRE_CAPABILITIES_Msk   (0x0000003FUL)                                 /**< (ESPI_IO_ESPI_VWIRE_CAPABILITIES) Register Mask  */

/* -------- ESPI_IO_ESPI_OOB_CAPABILITIES : (ESPI_IO Offset: 0x2e5) (R/W 8) eSPI OOB Channel Capabilities Register -------- */

typedef union
{
  struct
  {
    uint8_t  OOB_MAXIMUM_PAYLOAD_SIZE_SUPPORTED:3;  /**< bit:   0..2  This field identifies the maximum payload size supported by the slave. It corresponds to the field OOB Message\n      Channel Maximum Payload Size Supported, bits [6:4] of the OOB Channel Capabilities and Configurations Register.\n      111b - 100b=Reserved\n      011b=265 bytes address max payload size\n      010b=137 bytes address max payload size\n      001b=73 bytes address max payload size\n      000b=Reserved. */
    uint8_t  :5;                        /**< bit:   3..7  Reserved                                      */
  };
  uint8_t  w;
} __ESPI_IO_ESPI_OOB_CAPABILITIES_bits_t;
#define ESPI_IO_ESPI_OOB_CAPABILITIES_RESETVALUE (0x01U)                                       /**<  (ESPI_IO_ESPI_OOB_CAPABILITIES) eSPI OOB Channel Capabilities Register  Reset Value */

#define ESPI_IO_ESPI_OOB_CAPABILITIES_OOB_MAXIMUM_PAYLOAD_SIZE_SUPPORTED_Pos (0)                                            /**< (ESPI_IO_ESPI_OOB_CAPABILITIES) This field identifies the maximum payload size supported by the slave. It corresponds to the field OOB Message\n      Channel Maximum Payload Size Supported, bits [6:4] of the OOB Channel Capabilities and Configurations Register.\n      111b - 100b=Reserved\n      011b=265 bytes address max payload size\n      010b=137 bytes address max payload size\n      001b=73 bytes address max payload size\n      000b=Reserved. Position */
#define ESPI_IO_ESPI_OOB_CAPABILITIES_OOB_MAXIMUM_PAYLOAD_SIZE_SUPPORTED_Msk (0x7U << ESPI_IO_ESPI_OOB_CAPABILITIES_OOB_MAXIMUM_PAYLOAD_SIZE_SUPPORTED_Pos)  /**< (ESPI_IO_ESPI_OOB_CAPABILITIES) This field identifies the maximum payload size supported by the slave. It corresponds to the field OOB Message\n      Channel Maximum Payload Size Supported, bits [6:4] of the OOB Channel Capabilities and Configurations Register.\n      111b - 100b=Reserved\n      011b=265 bytes address max payload size\n      010b=137 bytes address max payload size\n      001b=73 bytes address max payload size\n      000b=Reserved. Mask */
#define ESPI_IO_ESPI_OOB_CAPABILITIES_OOB_MAXIMUM_PAYLOAD_SIZE_SUPPORTED(value) (ESPI_IO_ESPI_OOB_CAPABILITIES_OOB_MAXIMUM_PAYLOAD_SIZE_SUPPORTED_Msk & ((value) << ESPI_IO_ESPI_OOB_CAPABILITIES_OOB_MAXIMUM_PAYLOAD_SIZE_SUPPORTED_Pos))
#define ESPI_IO_ESPI_OOB_CAPABILITIES_Msk     (0x00000007UL)                                 /**< (ESPI_IO_ESPI_OOB_CAPABILITIES) Register Mask  */

