ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
/* -------- ESPI_IO_ESPI_FLASH_CAPABILITIES : (ESPI_IO Offset: 0x2e6) (R/W 8) eSPI Flash Channel Capabilities Register -------- */

typedef union
{
  struct
  {
    uint8_t  FLASH_MAXIMUM_PAYLOAD_SIZE_SUPPORTED:3;  /**< bit:   0..2  This field identifies the maximum payload size supported by the slave. It corresponds to the field Flash Access\n      Channel Maximum Payload Size Supported, bits [7:0] of the Flash Channel Capabilities and Configurations Register.\n      111b - 100b=Reserved\n      011b=256 bytes address aligned max payload size\n      010b=128 bytes address aligned max payload size\n      001b=64 bytes address aligned max payload size\n      000b=Reserved. */
    uint8_t  :1;                        /**< bit:      3  Reserved                                      */
    uint8_t  SHARING_MODE_SUPPORTED:1;  /**< bit:      4  This field identifies the flash sharing scheme supported by the slave. It corresponds to the field Flash Sharing Mode,\n      bit [11] of the Flash Channel Capabilities and Configurations Register.\n      1=Slave attached flash sharing\n      0=Master attached flash sharing */
    uint8_t  :3;                        /**< bit:   5..7  Reserved                                      */
  };
  uint8_t  w;
} __ESPI_IO_ESPI_FLASH_CAPABILITIES_bits_t;
#define ESPI_IO_ESPI_FLASH_CAPABILITIES_RESETVALUE (0x01U)                                       /**<  (ESPI_IO_ESPI_FLASH_CAPABILITIES) eSPI Flash Channel Capabilities Register  Reset Value */

#define ESPI_IO_ESPI_FLASH_CAPABILITIES_FLASH_MAXIMUM_PAYLOAD_SIZE_SUPPORTED_Pos (0)                                            /**< (ESPI_IO_ESPI_FLASH_CAPABILITIES) This field identifies the maximum payload size supported by the slave. It corresponds to the field Flash Access\n      Channel Maximum Payload Size Supported, bits [7:0] of the Flash Channel Capabilities and Configurations Register.\n      111b - 100b=Reserved\n      011b=256 bytes address aligned max payload size\n      010b=128 bytes address aligned max payload size\n      001b=64 bytes address aligned max payload size\n      000b=Reserved. Position */
#define ESPI_IO_ESPI_FLASH_CAPABILITIES_FLASH_MAXIMUM_PAYLOAD_SIZE_SUPPORTED_Msk (0x7U << ESPI_IO_ESPI_FLASH_CAPABILITIES_FLASH_MAXIMUM_PAYLOAD_SIZE_SUPPORTED_Pos)  /**< (ESPI_IO_ESPI_FLASH_CAPABILITIES) This field identifies the maximum payload size supported by the slave. It corresponds to the field Flash Access\n      Channel Maximum Payload Size Supported, bits [7:0] of the Flash Channel Capabilities and Configurations Register.\n      111b - 100b=Reserved\n      011b=256 bytes address aligned max payload size\n      010b=128 bytes address aligned max payload size\n      001b=64 bytes address aligned max payload size\n      000b=Reserved. Mask */
#define ESPI_IO_ESPI_FLASH_CAPABILITIES_FLASH_MAXIMUM_PAYLOAD_SIZE_SUPPORTED(value) (ESPI_IO_ESPI_FLASH_CAPABILITIES_FLASH_MAXIMUM_PAYLOAD_SIZE_SUPPORTED_Msk & ((value) << ESPI_IO_ESPI_FLASH_CAPABILITIES_FLASH_MAXIMUM_PAYLOAD_SIZE_SUPPORTED_Pos))
#define ESPI_IO_ESPI_FLASH_CAPABILITIES_SHARING_MODE_SUPPORTED_Pos (4)                                            /**< (ESPI_IO_ESPI_FLASH_CAPABILITIES) This field identifies the flash sharing scheme supported by the slave. It corresponds to the field Flash Sharing Mode,\n      bit [11] of the Flash Channel Capabilities and Configurations Register.\n      1=Slave attached flash sharing\n      0=Master attached flash sharing Position */
#define ESPI_IO_ESPI_FLASH_CAPABILITIES_SHARING_MODE_SUPPORTED_Msk (0x1U << ESPI_IO_ESPI_FLASH_CAPABILITIES_SHARING_MODE_SUPPORTED_Pos)  /**< (ESPI_IO_ESPI_FLASH_CAPABILITIES) This field identifies the flash sharing scheme supported by the slave. It corresponds to the field Flash Sharing Mode,\n      bit [11] of the Flash Channel Capabilities and Configurations Register.\n      1=Slave attached flash sharing\n      0=Master attached flash sharing Mask */
#define ESPI_IO_ESPI_FLASH_CAPABILITIES_Msk   (0x00000017UL)                                 /**< (ESPI_IO_ESPI_FLASH_CAPABILITIES) Register Mask  */

/* -------- ESPI_IO_ESPI_PERIPHERAL_READY : (ESPI_IO Offset: 0x2e7) (R/W 8) eSPI Peripheral Channel Ready Register -------- */

typedef union
{
  struct
  {
    uint8_t  PERIPHERAL_CHANNEL_READY:1;  /**< bit:      0  Firmware sets this bit to '1' to inform the Master than the Peripheral channel is ready for transactions. It corresponds to\n      the field Peripheral Channel Ready, bit 1 of the Config Offset 10h=Peripheral Channel Capabilities and Configurations Register. It is\n      forced to '0' while the Peripheral Channel Enabled bit in the Capabilities and Configurations register is 0. Once set to '1' it cannot\n      be set to '0' by firmware. It is only set to '0' by a reset, or when the Master changes the Enabled bit to '0'.\n      While this bit is '0' all Bus Master and LTR transactions initiated by the Slave are inhibited. */
    uint8_t  :7;                        /**< bit:   1..7  Reserved                                      */
  };
  uint8_t  w;
} __ESPI_IO_ESPI_PERIPHERAL_READY_bits_t;
#define ESPI_IO_ESPI_PERIPHERAL_READY_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_ESPI_PERIPHERAL_READY) eSPI Peripheral Channel Ready Register  Reset Value */

#define ESPI_IO_ESPI_PERIPHERAL_READY_PERIPHERAL_CHANNEL_READY_Pos (0)                                            /**< (ESPI_IO_ESPI_PERIPHERAL_READY) Firmware sets this bit to '1' to inform the Master than the Peripheral channel is ready for transactions. It corresponds to\n      the field Peripheral Channel Ready, bit 1 of the Config Offset 10h=Peripheral Channel Capabilities and Configurations Register. It is\n      forced to '0' while the Peripheral Channel Enabled bit in the Capabilities and Configurations register is 0. Once set to '1' it cannot\n      be set to '0' by firmware. It is only set to '0' by a reset, or when the Master changes the Enabled bit to '0'.\n      While this bit is '0' all Bus Master and LTR transactions initiated by the Slave are inhibited. Position */
#define ESPI_IO_ESPI_PERIPHERAL_READY_PERIPHERAL_CHANNEL_READY_Msk (0x1U << ESPI_IO_ESPI_PERIPHERAL_READY_PERIPHERAL_CHANNEL_READY_Pos)  /**< (ESPI_IO_ESPI_PERIPHERAL_READY) Firmware sets this bit to '1' to inform the Master than the Peripheral channel is ready for transactions. It corresponds to\n      the field Peripheral Channel Ready, bit 1 of the Config Offset 10h=Peripheral Channel Capabilities and Configurations Register. It is\n      forced to '0' while the Peripheral Channel Enabled bit in the Capabilities and Configurations register is 0. Once set to '1' it cannot\n      be set to '0' by firmware. It is only set to '0' by a reset, or when the Master changes the Enabled bit to '0'.\n      While this bit is '0' all Bus Master and LTR transactions initiated by the Slave are inhibited. Mask */
#define ESPI_IO_ESPI_PERIPHERAL_READY_Msk     (0x00000001UL)                                 /**< (ESPI_IO_ESPI_PERIPHERAL_READY) Register Mask  */

/* -------- ESPI_IO_ESPI_OOB_READY : (ESPI_IO Offset: 0x2e8) (R/W 8) eSPI OOB Channel Ready Register -------- */

typedef union
{
  struct
  {
    uint8_t  OOB_CHANNEL_READY:1;       /**< bit:      0  Firmware sets this bit to '1' to inform the Master that the OOB channel is ready for transactions. It corresponds to\n      the field OOB Message Channel Ready, bit 1 of Config Offset 30h=OOB ChannelCapabilities and Configurations Register. It is\n      forced to '0' while the OOB Message Channel Enabled bit in the Capabilities and Configurations register is 0. Once set to '1'\n      it cannot be set to '0' by firmware. It is only set to '0' by a reset, or when the Master changes the Enabled bit to '0'.\n      While this bit is '0' all OOB up transactions initiated by the Slave are inhibited. */
    uint8_t  :7;                        /**< bit:   1..7  Reserved                                      */
  };
  uint8_t  w;
} __ESPI_IO_ESPI_OOB_READY_bits_t;
