ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
#define ESPI_IO_ESPI_OOB_READY_RESETVALUE   (0x00U)                                       /**<  (ESPI_IO_ESPI_OOB_READY) eSPI OOB Channel Ready Register  Reset Value */

#define ESPI_IO_ESPI_OOB_READY_OOB_CHANNEL_READY_Pos (0)                                            /**< (ESPI_IO_ESPI_OOB_READY) Firmware sets this bit to '1' to inform the Master that the OOB channel is ready for transactions. It corresponds to\n      the field OOB Message Channel Ready, bit 1 of Config Offset 30h=OOB ChannelCapabilities and Configurations Register. It is\n      forced to '0' while the OOB Message Channel Enabled bit in the Capabilities and Configurations register is 0. Once set to '1'\n      it cannot be set to '0' by firmware. It is only set to '0' by a reset, or when the Master changes the Enabled bit to '0'.\n      While this bit is '0' all OOB up transactions initiated by the Slave are inhibited. Position */
#define ESPI_IO_ESPI_OOB_READY_OOB_CHANNEL_READY_Msk (0x1U << ESPI_IO_ESPI_OOB_READY_OOB_CHANNEL_READY_Pos)  /**< (ESPI_IO_ESPI_OOB_READY) Firmware sets this bit to '1' to inform the Master that the OOB channel is ready for transactions. It corresponds to\n      the field OOB Message Channel Ready, bit 1 of Config Offset 30h=OOB ChannelCapabilities and Configurations Register. It is\n      forced to '0' while the OOB Message Channel Enabled bit in the Capabilities and Configurations register is 0. Once set to '1'\n      it cannot be set to '0' by firmware. It is only set to '0' by a reset, or when the Master changes the Enabled bit to '0'.\n      While this bit is '0' all OOB up transactions initiated by the Slave are inhibited. Mask */
#define ESPI_IO_ESPI_OOB_READY_Msk            (0x00000001UL)                                 /**< (ESPI_IO_ESPI_OOB_READY) Register Mask  */

/* -------- ESPI_IO_ESPI_FLASH_READY : (ESPI_IO Offset: 0x2e9) (R/W 8) eSPI Flash Channel Ready Register -------- */

typedef union
{
  struct
  {
    uint8_t  FLASH_CHANNEL_READY:1;     /**< bit:      0  Firmware sets this bit to '1' to inform the Master that the Flash channel is ready for transactions. It corresponds to\n      the field Flash Channel Ready, bit 1 of Config Offset 40h=Flash Channel Capabilities and Configurations Register. It is\n      forced to '0' while the Flash Channel Enabled bit in the Capabilities and Configurations register is 0. Once set to '1'\n      it cannot be set to '0' by firmware. It is only set to '0'by a reset, or when the Master changes the Enabled bit to '0'.\n      While this bit is '0' all Flash transactions initiated by the Slave are inhibited. */
    uint8_t  :7;                        /**< bit:   1..7  Reserved                                      */
  };
  uint8_t  w;
} __ESPI_IO_ESPI_FLASH_READY_bits_t;
#define ESPI_IO_ESPI_FLASH_READY_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_ESPI_FLASH_READY) eSPI Flash Channel Ready Register  Reset Value */

#define ESPI_IO_ESPI_FLASH_READY_FLASH_CHANNEL_READY_Pos (0)                                            /**< (ESPI_IO_ESPI_FLASH_READY) Firmware sets this bit to '1' to inform the Master that the Flash channel is ready for transactions. It corresponds to\n      the field Flash Channel Ready, bit 1 of Config Offset 40h=Flash Channel Capabilities and Configurations Register. It is\n      forced to '0' while the Flash Channel Enabled bit in the Capabilities and Configurations register is 0. Once set to '1'\n      it cannot be set to '0' by firmware. It is only set to '0'by a reset, or when the Master changes the Enabled bit to '0'.\n      While this bit is '0' all Flash transactions initiated by the Slave are inhibited. Position */
#define ESPI_IO_ESPI_FLASH_READY_FLASH_CHANNEL_READY_Msk (0x1U << ESPI_IO_ESPI_FLASH_READY_FLASH_CHANNEL_READY_Pos)  /**< (ESPI_IO_ESPI_FLASH_READY) Firmware sets this bit to '1' to inform the Master that the Flash channel is ready for transactions. It corresponds to\n      the field Flash Channel Ready, bit 1 of Config Offset 40h=Flash Channel Capabilities and Configurations Register. It is\n      forced to '0' while the Flash Channel Enabled bit in the Capabilities and Configurations register is 0. Once set to '1'\n      it cannot be set to '0' by firmware. It is only set to '0'by a reset, or when the Master changes the Enabled bit to '0'.\n      While this bit is '0' all Flash transactions initiated by the Slave are inhibited. Mask */
#define ESPI_IO_ESPI_FLASH_READY_Msk          (0x00000001UL)                                 /**< (ESPI_IO_ESPI_FLASH_READY) Register Mask  */

/* -------- ESPI_IO_ESPI_RESET_INT_STATUS : (ESPI_IO Offset: 0x2ea) (R/W 8) eSPI Reset Interrupt Status Register -------- */

typedef union
{
  struct
  {
    uint8_t  ESPI_RESET_INTERRUPT_STATUS:1;  /**< bit:      0  This bit is set to '1' whenever the ESPI_RESET_PIN_STATE bit in this register changes state. It is cleared to\n      '0' whenever it is written with a '1'. Writes of a '0' have no effect. (R/WC) This bit is the source for the eSPI_RESET Interrupt.\n      The interrupt is asserted when both this bit and the ESPI_RESET_INTERRUPT_ENABLE bit in the eSPI Reset Interrupt Enable Register are '1'. */
    uint8_t  ESPI_RESET_PIN_STATE:1;    /**< bit:      1  This field reflects the current state of the eSPI_RESET# pin. */
    uint8_t  :6;                        /**< bit:   2..7  Reserved                                      */
  };
  uint8_t  w;
} __ESPI_IO_ESPI_RESET_INT_STATUS_bits_t;
#define ESPI_IO_ESPI_RESET_INT_STATUS_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_ESPI_RESET_INT_STATUS) eSPI Reset Interrupt Status Register  Reset Value */

#define ESPI_IO_ESPI_RESET_INT_STATUS_ESPI_RESET_INTERRUPT_STATUS_Pos (0)                                            /**< (ESPI_IO_ESPI_RESET_INT_STATUS) This bit is set to '1' whenever the ESPI_RESET_PIN_STATE bit in this register changes state. It is cleared to\n      '0' whenever it is written with a '1'. Writes of a '0' have no effect. (R/WC) This bit is the source for the eSPI_RESET Interrupt.\n      The interrupt is asserted when both this bit and the ESPI_RESET_INTERRUPT_ENABLE bit in the eSPI Reset Interrupt Enable Register are '1'. Position */
#define ESPI_IO_ESPI_RESET_INT_STATUS_ESPI_RESET_INTERRUPT_STATUS_Msk (0x1U << ESPI_IO_ESPI_RESET_INT_STATUS_ESPI_RESET_INTERRUPT_STATUS_Pos)  /**< (ESPI_IO_ESPI_RESET_INT_STATUS) This bit is set to '1' whenever the ESPI_RESET_PIN_STATE bit in this register changes state. It is cleared to\n      '0' whenever it is written with a '1'. Writes of a '0' have no effect. (R/WC) This bit is the source for the eSPI_RESET Interrupt.\n      The interrupt is asserted when both this bit and the ESPI_RESET_INTERRUPT_ENABLE bit in the eSPI Reset Interrupt Enable Register are '1'. Mask */
#define ESPI_IO_ESPI_RESET_INT_STATUS_ESPI_RESET_PIN_STATE_Pos (1)                                            /**< (ESPI_IO_ESPI_RESET_INT_STATUS) This field reflects the current state of the eSPI_RESET# pin. Position */
#define ESPI_IO_ESPI_RESET_INT_STATUS_ESPI_RESET_PIN_STATE_Msk (0x1U << ESPI_IO_ESPI_RESET_INT_STATUS_ESPI_RESET_PIN_STATE_Pos)  /**< (ESPI_IO_ESPI_RESET_INT_STATUS) This field reflects the current state of the eSPI_RESET# pin. Mask */
#define ESPI_IO_ESPI_RESET_INT_STATUS_Msk     (0x00000003UL)                                 /**< (ESPI_IO_ESPI_RESET_INT_STATUS) Register Mask  */

/* -------- ESPI_IO_ESPI_RESET_INT_ENABLE : (ESPI_IO Offset: 0x2eb) (R/W 8) eSPI Reset Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint8_t  ESPI_RESET_INTERRUPT_ENABLE:1;  /**< bit:      0  1=The RESET_ESPI Interrupt will be asserted when the ESPI_RESET_INTERRUPT_STATUS bit in the eSPI Reset Interrupt\n      Status Register register is '1'\n      0=The RESET_ESPI Interrupt will not be asserted. */
    uint8_t  :7;                        /**< bit:   1..7  Reserved                                      */
  };
  uint8_t  w;
} __ESPI_IO_ESPI_RESET_INT_ENABLE_bits_t;
#define ESPI_IO_ESPI_RESET_INT_ENABLE_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_ESPI_RESET_INT_ENABLE) eSPI Reset Interrupt Enable Register  Reset Value */

#define ESPI_IO_ESPI_RESET_INT_ENABLE_ESPI_RESET_INTERRUPT_ENABLE_Pos (0)                                            /**< (ESPI_IO_ESPI_RESET_INT_ENABLE) 1=The RESET_ESPI Interrupt will be asserted when the ESPI_RESET_INTERRUPT_STATUS bit in the eSPI Reset Interrupt\n      Status Register register is '1'\n      0=The RESET_ESPI Interrupt will not be asserted. Position */
#define ESPI_IO_ESPI_RESET_INT_ENABLE_ESPI_RESET_INTERRUPT_ENABLE_Msk (0x1U << ESPI_IO_ESPI_RESET_INT_ENABLE_ESPI_RESET_INTERRUPT_ENABLE_Pos)  /**< (ESPI_IO_ESPI_RESET_INT_ENABLE) 1=The RESET_ESPI Interrupt will be asserted when the ESPI_RESET_INTERRUPT_STATUS bit in the eSPI Reset Interrupt\n      Status Register register is '1'\n      0=The RESET_ESPI Interrupt will not be asserted. Mask */
#define ESPI_IO_ESPI_RESET_INT_ENABLE_Msk     (0x00000001UL)                                 /**< (ESPI_IO_ESPI_RESET_INT_ENABLE) Register Mask  */

/* -------- ESPI_IO_PLTRST_SOURCE : (ESPI_IO Offset: 0x2ec) (R/W 8) PLTRST Source Register -------- */

typedef union
{
  struct
  {
    uint8_t  PLTRST_SRC:1;              /**< bit:      0  1=The PLTRST reset signal is determined a signal external to the eSPI block. The PLTRST# virtual wire is ignored\n      0=The PLTRST reset signal is determined by the PLTRST# virtual wire. */
    uint8_t  :7;                        /**< bit:   1..7  Reserved                                      */
  };
  uint8_t  w;
} __ESPI_IO_PLTRST_SOURCE_bits_t;
#define ESPI_IO_PLTRST_SOURCE_RESETVALUE    (0x00U)                                       /**<  (ESPI_IO_PLTRST_SOURCE) PLTRST Source Register  Reset Value */

#define ESPI_IO_PLTRST_SOURCE_PLTRST_SRC_Pos  (0)                                            /**< (ESPI_IO_PLTRST_SOURCE) 1=The PLTRST reset signal is determined a signal external to the eSPI block. The PLTRST# virtual wire is ignored\n      0=The PLTRST reset signal is determined by the PLTRST# virtual wire. Position */
#define ESPI_IO_PLTRST_SOURCE_PLTRST_SRC_Msk  (0x1U << ESPI_IO_PLTRST_SOURCE_PLTRST_SRC_Pos)  /**< (ESPI_IO_PLTRST_SOURCE) 1=The PLTRST reset signal is determined a signal external to the eSPI block. The PLTRST# virtual wire is ignored\n      0=The PLTRST reset signal is determined by the PLTRST# virtual wire. Mask */
#define ESPI_IO_PLTRST_SOURCE_Msk             (0x00000001UL)                                 /**< (ESPI_IO_PLTRST_SOURCE) Register Mask  */

/* -------- ESPI_IO_ESPI_VWIRE_READY : (ESPI_IO Offset: 0x2ed) (R/W 8) eSPI Virtual Wire Channel Ready Register -------- */

typedef union
{
  struct
  {
    uint8_t  VWIRE_CHANNEL_READY:1;     /**< bit:      0  Firmware sets this bit to '1' to inform the Master than the Virtual Wire channel is ready for transactions. It corresponds to\n      the field Virtual Wire Channel Ready, bit 1 of the Config Offset 20h=Channel 1 Capabilities and Configurations Register. It is\n      forced to '0' while the Virtual Wire Channel Enable bit in the Capabilities and Configurations register is 0. Once set to '1' it cannot\n      be set to '0' by firmware. It is only set to '0' by a reset, or when the Master changes the Enabled bit to '0'.\n      While this bit is '0' all Virtual Wire transactions initiated by the Slave are inhibited. */
    uint8_t  :7;                        /**< bit:   1..7  Reserved                                      */
  };
  uint8_t  w;
} __ESPI_IO_ESPI_VWIRE_READY_bits_t;
