ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
#define ESPI_IO_ESPI_VWIRE_READY_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_ESPI_VWIRE_READY) eSPI Virtual Wire Channel Ready Register  Reset Value */

#define ESPI_IO_ESPI_VWIRE_READY_VWIRE_CHANNEL_READY_Pos (0)                                            /**< (ESPI_IO_ESPI_VWIRE_READY) Firmware sets this bit to '1' to inform the Master than the Virtual Wire channel is ready for transactions. It corresponds to\n      the field Virtual Wire Channel Ready, bit 1 of the Config Offset 20h=Channel 1 Capabilities and Configurations Register. It is\n      forced to '0' while the Virtual Wire Channel Enable bit in the Capabilities and Configurations register is 0. Once set to '1' it cannot\n      be set to '0' by firmware. It is only set to '0' by a reset, or when the Master changes the Enabled bit to '0'.\n      While this bit is '0' all Virtual Wire transactions initiated by the Slave are inhibited. Position */
#define ESPI_IO_ESPI_VWIRE_READY_VWIRE_CHANNEL_READY_Msk (0x1U << ESPI_IO_ESPI_VWIRE_READY_VWIRE_CHANNEL_READY_Pos)  /**< (ESPI_IO_ESPI_VWIRE_READY) Firmware sets this bit to '1' to inform the Master than the Virtual Wire channel is ready for transactions. It corresponds to\n      the field Virtual Wire Channel Ready, bit 1 of the Config Offset 20h=Channel 1 Capabilities and Configurations Register. It is\n      forced to '0' while the Virtual Wire Channel Enable bit in the Capabilities and Configurations register is 0. Once set to '1' it cannot\n      be set to '0' by firmware. It is only set to '0' by a reset, or when the Master changes the Enabled bit to '0'.\n      While this bit is '0' all Virtual Wire transactions initiated by the Slave are inhibited. Mask */
#define ESPI_IO_ESPI_VWIRE_READY_Msk          (0x00000001UL)                                 /**< (ESPI_IO_ESPI_VWIRE_READY) Register Mask  */

/* -------- ESPI_IO_ESPI_ACTIVATE : (ESPI_IO Offset: 0x330) (R/W 8) eSPI Activate Register -------- */

typedef union
{
  struct
  {
    uint8_t  ACTIVATE:1;                /**< bit:      0  1=Activate. When this bit is '1', the eSPI Logical Device is powered and functional.\n      0=Deactivate. When this bit is 0, the logical device is powered down and inactive.\n      Except for the eSPI Activate Register itself, clocks to the block are gated and the eSPI Logical Device will permit the\n      main oscillator to be shut down. */
    uint8_t  :7;                        /**< bit:   1..7  Reserved                                      */
  };
  uint8_t  w;
} __ESPI_IO_ESPI_ACTIVATE_bits_t;
#define ESPI_IO_ESPI_ACTIVATE_RESETVALUE    (0x00U)                                       /**<  (ESPI_IO_ESPI_ACTIVATE) eSPI Activate Register  Reset Value */

#define ESPI_IO_ESPI_ACTIVATE_ACTIVATE_Pos    (0)                                            /**< (ESPI_IO_ESPI_ACTIVATE) 1=Activate. When this bit is '1', the eSPI Logical Device is powered and functional.\n      0=Deactivate. When this bit is 0, the logical device is powered down and inactive.\n      Except for the eSPI Activate Register itself, clocks to the block are gated and the eSPI Logical Device will permit the\n      main oscillator to be shut down. Position */
#define ESPI_IO_ESPI_ACTIVATE_ACTIVATE_Msk    (0x1U << ESPI_IO_ESPI_ACTIVATE_ACTIVATE_Pos)   /**< (ESPI_IO_ESPI_ACTIVATE) 1=Activate. When this bit is '1', the eSPI Logical Device is powered and functional.\n      0=Deactivate. When this bit is 0, the logical device is powered down and inactive.\n      Except for the eSPI Activate Register itself, clocks to the block are gated and the eSPI Logical Device will permit the\n      main oscillator to be shut down. Mask */
#define ESPI_IO_ESPI_ACTIVATE_Msk             (0x00000001UL)                                 /**< (ESPI_IO_ESPI_ACTIVATE) Register Mask  */

/* -------- ESPI_IO_BAR_CONFIG_ADDRESS : (ESPI_IO Offset: 0x334) (R/W 32) eSPI I/O Base Address Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t VALID:1;                   /**< bit:      0  1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. */
    uint32_t :15;                       /**< bit:  1..15  Reserved                                      */
    uint32_t ESPI_HOST_ADDRESS:16;      /**< bit: 16..31  These 16 bits are used to match eSPI I/O addresses. */
  };
  uint32_t w;
} __ESPI_IO_BAR_CONFIG_ADDRESS_bits_t;
#define ESPI_IO_BAR_CONFIG_ADDRESS_RESETVALUE (0x2E0000U)                                   /**<  (ESPI_IO_BAR_CONFIG_ADDRESS) eSPI I/O Base Address Configuration Register  Reset Value */

#define ESPI_IO_BAR_CONFIG_ADDRESS_VALID_Pos  (0)                                            /**< (ESPI_IO_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Position */
#define ESPI_IO_BAR_CONFIG_ADDRESS_VALID_Msk  (0x1U << ESPI_IO_BAR_CONFIG_ADDRESS_VALID_Pos)  /**< (ESPI_IO_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Mask */
#define ESPI_IO_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos (16)                                           /**< (ESPI_IO_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Position */
#define ESPI_IO_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk (0xFFFFU << ESPI_IO_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos)  /**< (ESPI_IO_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Mask */
#define ESPI_IO_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS(value) (ESPI_IO_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk & ((value) << ESPI_IO_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos))
#define ESPI_IO_BAR_CONFIG_ADDRESS_Msk        (0xFFFF0001UL)                                 /**< (ESPI_IO_BAR_CONFIG_ADDRESS) Register Mask  */

/* -------- ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS : (ESPI_IO Offset: 0x338) (R/W 32) eSPI Memory Base Address Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t VALID:1;                   /**< bit:      0  1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. */
    uint32_t :15;                       /**< bit:  1..15  Reserved                                      */
    uint32_t ESPI_HOST_ADDRESS:16;      /**< bit: 16..31  These 16 bits are used to match eSPI I/O addresses. */
  };
  uint32_t w;
} __ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS_bits_t;
#define ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS) eSPI Memory Base Address Configuration Register  Reset Value */

#define ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS_VALID_Pos (0)                                            /**< (ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Position */
#define ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS_VALID_Msk (0x1U << ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS_VALID_Pos)  /**< (ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Mask */
#define ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos (16)                                           /**< (ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Position */
#define ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk (0xFFFFU << ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos)  /**< (ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Mask */
#define ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS(value) (ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk & ((value) << ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos))
#define ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS_Msk (0xFFFF0001UL)                                 /**< (ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS) Register Mask  */

