ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
/* -------- ESPI_IO_MBX_BAR_CONFIG_ADDRESS : (ESPI_IO Offset: 0x33c) (R/W 32) Mailbox Base Address Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t VALID:1;                   /**< bit:      0  1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. */
    uint32_t :15;                       /**< bit:  1..15  Reserved                                      */
    uint32_t ESPI_HOST_ADDRESS:16;      /**< bit: 16..31  These 16 bits are used to match eSPI I/O addresses. */
  };
  uint32_t w;
} __ESPI_IO_MBX_BAR_CONFIG_ADDRESS_bits_t;
#define ESPI_IO_MBX_BAR_CONFIG_ADDRESS_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_MBX_BAR_CONFIG_ADDRESS) Mailbox Base Address Configuration Register  Reset Value */

#define ESPI_IO_MBX_BAR_CONFIG_ADDRESS_VALID_Pos (0)                                            /**< (ESPI_IO_MBX_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Position */
#define ESPI_IO_MBX_BAR_CONFIG_ADDRESS_VALID_Msk (0x1U << ESPI_IO_MBX_BAR_CONFIG_ADDRESS_VALID_Pos)  /**< (ESPI_IO_MBX_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Mask */
#define ESPI_IO_MBX_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos (16)                                           /**< (ESPI_IO_MBX_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Position */
#define ESPI_IO_MBX_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk (0xFFFFU << ESPI_IO_MBX_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos)  /**< (ESPI_IO_MBX_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Mask */
#define ESPI_IO_MBX_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS(value) (ESPI_IO_MBX_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk & ((value) << ESPI_IO_MBX_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos))
#define ESPI_IO_MBX_BAR_CONFIG_ADDRESS_Msk    (0xFFFF0001UL)                                 /**< (ESPI_IO_MBX_BAR_CONFIG_ADDRESS) Register Mask  */

/* -------- ESPI_IO_EM8042_BAR_CONFIG_ADDRESS : (ESPI_IO Offset: 0x340) (R/W 32) 8042 Emulated Keyboard Controller Base Address Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t VALID:1;                   /**< bit:      0  1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. */
    uint32_t :15;                       /**< bit:  1..15  Reserved                                      */
    uint32_t ESPI_HOST_ADDRESS:16;      /**< bit: 16..31  These 16 bits are used to match eSPI I/O addresses. */
  };
  uint32_t w;
} __ESPI_IO_EM8042_BAR_CONFIG_ADDRESS_bits_t;
#define ESPI_IO_EM8042_BAR_CONFIG_ADDRESS_RESETVALUE (0x600000U)                                   /**<  (ESPI_IO_EM8042_BAR_CONFIG_ADDRESS) 8042 Emulated Keyboard Controller Base Address Configuration Register  Reset Value */

#define ESPI_IO_EM8042_BAR_CONFIG_ADDRESS_VALID_Pos (0)                                            /**< (ESPI_IO_EM8042_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Position */
#define ESPI_IO_EM8042_BAR_CONFIG_ADDRESS_VALID_Msk (0x1U << ESPI_IO_EM8042_BAR_CONFIG_ADDRESS_VALID_Pos)  /**< (ESPI_IO_EM8042_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Mask */
#define ESPI_IO_EM8042_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos (16)                                           /**< (ESPI_IO_EM8042_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Position */
#define ESPI_IO_EM8042_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk (0xFFFFU << ESPI_IO_EM8042_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos)  /**< (ESPI_IO_EM8042_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Mask */
#define ESPI_IO_EM8042_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS(value) (ESPI_IO_EM8042_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk & ((value) << ESPI_IO_EM8042_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos))
#define ESPI_IO_EM8042_BAR_CONFIG_ADDRESS_Msk (0xFFFF0001UL)                                 /**< (ESPI_IO_EM8042_BAR_CONFIG_ADDRESS) Register Mask  */

/* -------- ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS : (ESPI_IO Offset: 0x344) (R/W 32) ACPI EC 0 Base Address Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t VALID:1;                   /**< bit:      0  1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. */
    uint32_t :15;                       /**< bit:  1..15  Reserved                                      */
    uint32_t ESPI_HOST_ADDRESS:16;      /**< bit: 16..31  These 16 bits are used to match eSPI I/O addresses. */
  };
  uint32_t w;
} __ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS_bits_t;
#define ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS_RESETVALUE (0x620000U)                                   /**<  (ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS) ACPI EC 0 Base Address Configuration Register  Reset Value */

#define ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS_VALID_Pos (0)                                            /**< (ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Position */
#define ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS_VALID_Msk (0x1U << ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS_VALID_Pos)  /**< (ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Mask */
#define ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos (16)                                           /**< (ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Position */
#define ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk (0xFFFFU << ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos)  /**< (ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Mask */
#define ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS(value) (ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk & ((value) << ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos))
#define ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS_Msk (0xFFFF0001UL)                                 /**< (ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS) Register Mask  */

/* -------- ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS : (ESPI_IO Offset: 0x348) (R/W 32) ACPI EC 1 Base Address Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t VALID:1;                   /**< bit:      0  1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. */
    uint32_t :15;                       /**< bit:  1..15  Reserved                                      */
    uint32_t ESPI_HOST_ADDRESS:16;      /**< bit: 16..31  These 16 bits are used to match eSPI I/O addresses. */
  };
  uint32_t w;
} __ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS_bits_t;
#define ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS) ACPI EC 1 Base Address Configuration Register  Reset Value */

#define ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS_VALID_Pos (0)                                            /**< (ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Position */
#define ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS_VALID_Msk (0x1U << ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS_VALID_Pos)  /**< (ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Mask */
#define ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos (16)                                           /**< (ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Position */
#define ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk (0xFFFFU << ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos)  /**< (ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Mask */
#define ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS(value) (ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk & ((value) << ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos))
#define ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS_Msk (0xFFFF0001UL)                                 /**< (ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS) Register Mask  */

/* -------- ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS : (ESPI_IO Offset: 0x34c) (R/W 32) ACPI EC 2 Base Address Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t VALID:1;                   /**< bit:      0  1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. */
    uint32_t :15;                       /**< bit:  1..15  Reserved                                      */
    uint32_t ESPI_HOST_ADDRESS:16;      /**< bit: 16..31  These 16 bits are used to match eSPI I/O addresses. */
  };
  uint32_t w;
} __ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS_bits_t;
#define ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS) ACPI EC 2 Base Address Configuration Register  Reset Value */

#define ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS_VALID_Pos (0)                                            /**< (ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Position */
#define ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS_VALID_Msk (0x1U << ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS_VALID_Pos)  /**< (ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Mask */
#define ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos (16)                                           /**< (ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Position */
#define ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk (0xFFFFU << ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos)  /**< (ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Mask */
#define ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS(value) (ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk & ((value) << ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos))
#define ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS_Msk (0xFFFF0001UL)                                 /**< (ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS) Register Mask  */

/* -------- ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS : (ESPI_IO Offset: 0x350) (R/W 32) ACPI EC 3 Base Address Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t VALID:1;                   /**< bit:      0  1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. */
    uint32_t :15;                       /**< bit:  1..15  Reserved                                      */
    uint32_t ESPI_HOST_ADDRESS:16;      /**< bit: 16..31  These 16 bits are used to match eSPI I/O addresses. */
  };
  uint32_t w;
} __ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS_bits_t;
