ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
#define ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS) ACPI EC 3 Base Address Configuration Register  Reset Value */

#define ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS_VALID_Pos (0)                                            /**< (ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Position */
#define ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS_VALID_Msk (0x1U << ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS_VALID_Pos)  /**< (ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Mask */
#define ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos (16)                                           /**< (ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Position */
#define ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk (0xFFFFU << ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos)  /**< (ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Mask */
#define ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS(value) (ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk & ((value) << ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos))
#define ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS_Msk (0xFFFF0001UL)                                 /**< (ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS) Register Mask  */

/* -------- ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS : (ESPI_IO Offset: 0x358) (R/W 32) ACPI PM1 Base Address Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t VALID:1;                   /**< bit:      0  1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. */
    uint32_t :15;                       /**< bit:  1..15  Reserved                                      */
    uint32_t ESPI_HOST_ADDRESS:16;      /**< bit: 16..31  These 16 bits are used to match eSPI I/O addresses. */
  };
  uint32_t w;
} __ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS_bits_t;
#define ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS) ACPI PM1 Base Address Configuration Register  Reset Value */

#define ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS_VALID_Pos (0)                                            /**< (ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Position */
#define ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS_VALID_Msk (0x1U << ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS_VALID_Pos)  /**< (ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Mask */
#define ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos (16)                                           /**< (ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Position */
#define ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk (0xFFFFU << ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos)  /**< (ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Mask */
#define ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS(value) (ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk & ((value) << ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos))
#define ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS_Msk (0xFFFF0001UL)                                 /**< (ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS) Register Mask  */

/* -------- ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS : (ESPI_IO Offset: 0x35c) (R/W 32) I/O Base Address Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t VALID:1;                   /**< bit:      0  1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. */
    uint32_t :15;                       /**< bit:  1..15  Reserved                                      */
    uint32_t ESPI_HOST_ADDRESS:16;      /**< bit: 16..31  These 16 bits are used to match eSPI I/O addresses. */
  };
  uint32_t w;
} __ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS_bits_t;
#define ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS_RESETVALUE (0x920000U)                                   /**<  (ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS) I/O Base Address Configuration Register  Reset Value */

#define ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS_VALID_Pos (0)                                            /**< (ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Position */
#define ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS_VALID_Msk (0x1U << ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS_VALID_Pos)  /**< (ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Mask */
#define ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos (16)                                           /**< (ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Position */
#define ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk (0xFFFFU << ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos)  /**< (ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Mask */
#define ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS(value) (ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk & ((value) << ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos))
#define ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS_Msk (0xFFFF0001UL)                                 /**< (ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS) Register Mask  */

/* -------- ESPI_IO_UART_0_BAR_CONFIG_ADDRESS : (ESPI_IO Offset: 0x360) (R/W 32) UART 0 Base Address Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t VALID:1;                   /**< bit:      0  1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. */
    uint32_t :15;                       /**< bit:  1..15  Reserved                                      */
    uint32_t ESPI_HOST_ADDRESS:16;      /**< bit: 16..31  These 16 bits are used to match eSPI I/O addresses. */
  };
  uint32_t w;
} __ESPI_IO_UART_0_BAR_CONFIG_ADDRESS_bits_t;
#define ESPI_IO_UART_0_BAR_CONFIG_ADDRESS_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_UART_0_BAR_CONFIG_ADDRESS) UART 0 Base Address Configuration Register  Reset Value */

#define ESPI_IO_UART_0_BAR_CONFIG_ADDRESS_VALID_Pos (0)                                            /**< (ESPI_IO_UART_0_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Position */
#define ESPI_IO_UART_0_BAR_CONFIG_ADDRESS_VALID_Msk (0x1U << ESPI_IO_UART_0_BAR_CONFIG_ADDRESS_VALID_Pos)  /**< (ESPI_IO_UART_0_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Mask */
#define ESPI_IO_UART_0_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos (16)                                           /**< (ESPI_IO_UART_0_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Position */
#define ESPI_IO_UART_0_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk (0xFFFFU << ESPI_IO_UART_0_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos)  /**< (ESPI_IO_UART_0_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Mask */
#define ESPI_IO_UART_0_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS(value) (ESPI_IO_UART_0_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk & ((value) << ESPI_IO_UART_0_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos))
#define ESPI_IO_UART_0_BAR_CONFIG_ADDRESS_Msk (0xFFFF0001UL)                                 /**< (ESPI_IO_UART_0_BAR_CONFIG_ADDRESS) Register Mask  */

/* -------- ESPI_IO_UART_1_BAR_CONFIG_ADDRESS : (ESPI_IO Offset: 0x364) (R/W 32) UART 1 Base Address Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t VALID:1;                   /**< bit:      0  1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. */
    uint32_t :15;                       /**< bit:  1..15  Reserved                                      */
    uint32_t ESPI_HOST_ADDRESS:16;      /**< bit: 16..31  These 16 bits are used to match eSPI I/O addresses. */
  };
  uint32_t w;
} __ESPI_IO_UART_1_BAR_CONFIG_ADDRESS_bits_t;
