ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
#define ESPI_IO_PORT80_0_BAR_CONFIG_ADDRESS_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_PORT80_0_BAR_CONFIG_ADDRESS) BIOS Debug Port (Port 80) 0 BAR Config Register  Reset Value */

#define ESPI_IO_PORT80_0_BAR_CONFIG_ADDRESS_VALID_Pos (0)                                            /**< (ESPI_IO_PORT80_0_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Position */
#define ESPI_IO_PORT80_0_BAR_CONFIG_ADDRESS_VALID_Msk (0x1U << ESPI_IO_PORT80_0_BAR_CONFIG_ADDRESS_VALID_Pos)  /**< (ESPI_IO_PORT80_0_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Mask */
#define ESPI_IO_PORT80_0_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos (16)                                           /**< (ESPI_IO_PORT80_0_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Position */
#define ESPI_IO_PORT80_0_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk (0xFFFFU << ESPI_IO_PORT80_0_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos)  /**< (ESPI_IO_PORT80_0_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Mask */
#define ESPI_IO_PORT80_0_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS(value) (ESPI_IO_PORT80_0_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk & ((value) << ESPI_IO_PORT80_0_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos))
#define ESPI_IO_PORT80_0_BAR_CONFIG_ADDRESS_Msk (0xFFFF0001UL)                                 /**< (ESPI_IO_PORT80_0_BAR_CONFIG_ADDRESS) Register Mask  */

/* -------- ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS : (ESPI_IO Offset: 0x378) (R/W 32) BIOS Debug Port (Port 80) 1 BAR Config Register -------- */

typedef union
{
  struct
  {
    uint32_t VALID:1;                   /**< bit:      0  1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. */
    uint32_t :15;                       /**< bit:  1..15  Reserved                                      */
    uint32_t ESPI_HOST_ADDRESS:16;      /**< bit: 16..31  These 16 bits are used to match eSPI I/O addresses. */
  };
  uint32_t w;
} __ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS_bits_t;
#define ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS) BIOS Debug Port (Port 80) 1 BAR Config Register  Reset Value */

#define ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS_VALID_Pos (0)                                            /**< (ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Position */
#define ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS_VALID_Msk (0x1U << ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS_VALID_Pos)  /**< (ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Mask */
#define ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos (16)                                           /**< (ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Position */
#define ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk (0xFFFFU << ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos)  /**< (ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Mask */
#define ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS(value) (ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk & ((value) << ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos))
#define ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS_Msk (0xFFFF0001UL)                                 /**< (ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS) Register Mask  */

/* -------- ESPI_IO_RTC_BAR_CONFIG_ADDRESS : (ESPI_IO Offset: 0x37c) (R/W 32) RTC BAR Config Register -------- */

typedef union
{
  struct
  {
    uint32_t VALID:1;                   /**< bit:      0  1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. */
    uint32_t :15;                       /**< bit:  1..15  Reserved                                      */
    uint32_t ESPI_HOST_ADDRESS:16;      /**< bit: 16..31  These 16 bits are used to match eSPI I/O addresses. */
  };
  uint32_t w;
} __ESPI_IO_RTC_BAR_CONFIG_ADDRESS_bits_t;
#define ESPI_IO_RTC_BAR_CONFIG_ADDRESS_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_RTC_BAR_CONFIG_ADDRESS) RTC BAR Config Register  Reset Value */

#define ESPI_IO_RTC_BAR_CONFIG_ADDRESS_VALID_Pos (0)                                            /**< (ESPI_IO_RTC_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Position */
#define ESPI_IO_RTC_BAR_CONFIG_ADDRESS_VALID_Msk (0x1U << ESPI_IO_RTC_BAR_CONFIG_ADDRESS_VALID_Pos)  /**< (ESPI_IO_RTC_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Mask */
#define ESPI_IO_RTC_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos (16)                                           /**< (ESPI_IO_RTC_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Position */
#define ESPI_IO_RTC_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk (0xFFFFU << ESPI_IO_RTC_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos)  /**< (ESPI_IO_RTC_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Mask */
#define ESPI_IO_RTC_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS(value) (ESPI_IO_RTC_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk & ((value) << ESPI_IO_RTC_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos))
#define ESPI_IO_RTC_BAR_CONFIG_ADDRESS_Msk    (0xFFFF0001UL)                                 /**< (ESPI_IO_RTC_BAR_CONFIG_ADDRESS) Register Mask  */

/* -------- ESPI_IO_UART_2_BAR_CONFIG_ADDRESS : (ESPI_IO Offset: 0x384) (R/W 32) UART 2 Base Address Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t VALID:1;                   /**< bit:      0  1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. */
    uint32_t :15;                       /**< bit:  1..15  Reserved                                      */
    uint32_t ESPI_HOST_ADDRESS:16;      /**< bit: 16..31  These 16 bits are used to match eSPI I/O addresses. */
  };
  uint32_t w;
} __ESPI_IO_UART_2_BAR_CONFIG_ADDRESS_bits_t;
#define ESPI_IO_UART_2_BAR_CONFIG_ADDRESS_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_UART_2_BAR_CONFIG_ADDRESS) UART 2 Base Address Configuration Register  Reset Value */

#define ESPI_IO_UART_2_BAR_CONFIG_ADDRESS_VALID_Pos (0)                                            /**< (ESPI_IO_UART_2_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Position */
#define ESPI_IO_UART_2_BAR_CONFIG_ADDRESS_VALID_Msk (0x1U << ESPI_IO_UART_2_BAR_CONFIG_ADDRESS_VALID_Pos)  /**< (ESPI_IO_UART_2_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Mask */
#define ESPI_IO_UART_2_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos (16)                                           /**< (ESPI_IO_UART_2_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Position */
#define ESPI_IO_UART_2_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk (0xFFFFU << ESPI_IO_UART_2_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos)  /**< (ESPI_IO_UART_2_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Mask */
#define ESPI_IO_UART_2_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS(value) (ESPI_IO_UART_2_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk & ((value) << ESPI_IO_UART_2_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos))
#define ESPI_IO_UART_2_BAR_CONFIG_ADDRESS_Msk (0xFFFF0001UL)                                 /**< (ESPI_IO_UART_2_BAR_CONFIG_ADDRESS) Register Mask  */

/* -------- ESPI_IO_GLUE_BAR_CONFIG_ADDRESS : (ESPI_IO Offset: 0x38c) (R/W 32) GLUE Base Address Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t VALID:1;                   /**< bit:      0  1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. */
    uint32_t :15;                       /**< bit:  1..15  Reserved                                      */
    uint32_t ESPI_HOST_ADDRESS:16;      /**< bit: 16..31  These 16 bits are used to match eSPI I/O addresses. */
  };
  uint32_t w;
} __ESPI_IO_GLUE_BAR_CONFIG_ADDRESS_bits_t;
