ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
#define ESPI_IO_GLUE_BAR_CONFIG_ADDRESS_RESETVALUE (0x00U)                                       /**<  (ESPI_IO_GLUE_BAR_CONFIG_ADDRESS) GLUE Base Address Configuration Register  Reset Value */

#define ESPI_IO_GLUE_BAR_CONFIG_ADDRESS_VALID_Pos (0)                                            /**< (ESPI_IO_GLUE_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Position */
#define ESPI_IO_GLUE_BAR_CONFIG_ADDRESS_VALID_Msk (0x1U << ESPI_IO_GLUE_BAR_CONFIG_ADDRESS_VALID_Pos)  /**< (ESPI_IO_GLUE_BAR_CONFIG_ADDRESS) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Mask */
#define ESPI_IO_GLUE_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos (16)                                           /**< (ESPI_IO_GLUE_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Position */
#define ESPI_IO_GLUE_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk (0xFFFFU << ESPI_IO_GLUE_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos)  /**< (ESPI_IO_GLUE_BAR_CONFIG_ADDRESS) These 16 bits are used to match eSPI I/O addresses. Mask */
#define ESPI_IO_GLUE_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS(value) (ESPI_IO_GLUE_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Msk & ((value) << ESPI_IO_GLUE_BAR_CONFIG_ADDRESS_ESPI_HOST_ADDRESS_Pos))
#define ESPI_IO_GLUE_BAR_CONFIG_ADDRESS_Msk   (0xFFFF0001UL)                                 /**< (ESPI_IO_GLUE_BAR_CONFIG_ADDRESS) Register Mask  */

/* -------- ESPI_IO_MBX_HOST_SIRQ_IRQ__SELECT : (ESPI_IO Offset: 0x3ac) (R/W 8) Mailbox (MBX_Host_SIRQ Interrupt) Selection Register -------- */

typedef union
{
  struct
  {
    uint8_t  IRQ:8;                     /**< bit:   0..7  FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. */
  };
  uint8_t  w;
} __ESPI_IO_MBX_HOST_SIRQ_IRQ__SELECT_bits_t;
#define ESPI_IO_MBX_HOST_SIRQ_IRQ__SELECT_RESETVALUE (0xFFU)                                       /**<  (ESPI_IO_MBX_HOST_SIRQ_IRQ__SELECT) Mailbox (MBX_Host_SIRQ Interrupt) Selection Register  Reset Value */

#define ESPI_IO_MBX_HOST_SIRQ_IRQ__SELECT_IRQ_Pos (0)                                            /**< (ESPI_IO_MBX_HOST_SIRQ_IRQ__SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Position */
#define ESPI_IO_MBX_HOST_SIRQ_IRQ__SELECT_IRQ_Msk (0xFFU << ESPI_IO_MBX_HOST_SIRQ_IRQ__SELECT_IRQ_Pos)  /**< (ESPI_IO_MBX_HOST_SIRQ_IRQ__SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Mask */
#define ESPI_IO_MBX_HOST_SIRQ_IRQ__SELECT_IRQ(value) (ESPI_IO_MBX_HOST_SIRQ_IRQ__SELECT_IRQ_Msk & ((value) << ESPI_IO_MBX_HOST_SIRQ_IRQ__SELECT_IRQ_Pos))
#define ESPI_IO_MBX_HOST_SIRQ_IRQ__SELECT_Msk (0x000000FFUL)                                 /**< (ESPI_IO_MBX_HOST_SIRQ_IRQ__SELECT) Register Mask  */

/* -------- ESPI_IO_MBX_HOST_SMI_IRQ_SELECT : (ESPI_IO Offset: 0x3ad) (R/W 8) Mailbox (MBX_Host_SMI Interrupt) Selection Register -------- */

typedef union
{
  struct
  {
    uint8_t  IRQ:8;                     /**< bit:   0..7  FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. */
  };
  uint8_t  w;
} __ESPI_IO_MBX_HOST_SMI_IRQ_SELECT_bits_t;
#define ESPI_IO_MBX_HOST_SMI_IRQ_SELECT_RESETVALUE (0xFFU)                                       /**<  (ESPI_IO_MBX_HOST_SMI_IRQ_SELECT) Mailbox (MBX_Host_SMI Interrupt) Selection Register  Reset Value */

#define ESPI_IO_MBX_HOST_SMI_IRQ_SELECT_IRQ_Pos (0)                                            /**< (ESPI_IO_MBX_HOST_SMI_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Position */
#define ESPI_IO_MBX_HOST_SMI_IRQ_SELECT_IRQ_Msk (0xFFU << ESPI_IO_MBX_HOST_SMI_IRQ_SELECT_IRQ_Pos)  /**< (ESPI_IO_MBX_HOST_SMI_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Mask */
#define ESPI_IO_MBX_HOST_SMI_IRQ_SELECT_IRQ(value) (ESPI_IO_MBX_HOST_SMI_IRQ_SELECT_IRQ_Msk & ((value) << ESPI_IO_MBX_HOST_SMI_IRQ_SELECT_IRQ_Pos))
#define ESPI_IO_MBX_HOST_SMI_IRQ_SELECT_Msk   (0x000000FFUL)                                 /**< (ESPI_IO_MBX_HOST_SMI_IRQ_SELECT) Register Mask  */

/* -------- ESPI_IO_KIRQ_8042_IRQ_SELECT : (ESPI_IO Offset: 0x3ae) (R/W 8) 8042 (KIRQ Interrupt) Selection Register -------- */

typedef union
{
  struct
  {
    uint8_t  IRQ:8;                     /**< bit:   0..7  FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. */
  };
  uint8_t  w;
} __ESPI_IO_KIRQ_8042_IRQ_SELECT_bits_t;
#define ESPI_IO_KIRQ_8042_IRQ_SELECT_RESETVALUE (0xFFU)                                       /**<  (ESPI_IO_KIRQ_8042_IRQ_SELECT) 8042 (KIRQ Interrupt) Selection Register  Reset Value */

#define ESPI_IO_KIRQ_8042_IRQ_SELECT_IRQ_Pos  (0)                                            /**< (ESPI_IO_KIRQ_8042_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Position */
#define ESPI_IO_KIRQ_8042_IRQ_SELECT_IRQ_Msk  (0xFFU << ESPI_IO_KIRQ_8042_IRQ_SELECT_IRQ_Pos)  /**< (ESPI_IO_KIRQ_8042_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Mask */
#define ESPI_IO_KIRQ_8042_IRQ_SELECT_IRQ(value) (ESPI_IO_KIRQ_8042_IRQ_SELECT_IRQ_Msk & ((value) << ESPI_IO_KIRQ_8042_IRQ_SELECT_IRQ_Pos))
#define ESPI_IO_KIRQ_8042_IRQ_SELECT_Msk      (0x000000FFUL)                                 /**< (ESPI_IO_KIRQ_8042_IRQ_SELECT) Register Mask  */

/* -------- ESPI_IO_MIRQ_8042_IRQ_SELECT : (ESPI_IO Offset: 0x3af) (R/W 8) 8042 (MIRQ Interrupt) Selection Register -------- */

typedef union
{
  struct
  {
    uint8_t  IRQ:8;                     /**< bit:   0..7  FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. */
  };
  uint8_t  w;
} __ESPI_IO_MIRQ_8042_IRQ_SELECT_bits_t;
#define ESPI_IO_MIRQ_8042_IRQ_SELECT_RESETVALUE (0xFFU)                                       /**<  (ESPI_IO_MIRQ_8042_IRQ_SELECT) 8042 (MIRQ Interrupt) Selection Register  Reset Value */

#define ESPI_IO_MIRQ_8042_IRQ_SELECT_IRQ_Pos  (0)                                            /**< (ESPI_IO_MIRQ_8042_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Position */
#define ESPI_IO_MIRQ_8042_IRQ_SELECT_IRQ_Msk  (0xFFU << ESPI_IO_MIRQ_8042_IRQ_SELECT_IRQ_Pos)  /**< (ESPI_IO_MIRQ_8042_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Mask */
#define ESPI_IO_MIRQ_8042_IRQ_SELECT_IRQ(value) (ESPI_IO_MIRQ_8042_IRQ_SELECT_IRQ_Msk & ((value) << ESPI_IO_MIRQ_8042_IRQ_SELECT_IRQ_Pos))
#define ESPI_IO_MIRQ_8042_IRQ_SELECT_Msk      (0x000000FFUL)                                 /**< (ESPI_IO_MIRQ_8042_IRQ_SELECT) Register Mask  */

/* -------- ESPI_IO_ACPI_EC_0_OBF_IRQ_SELECT : (ESPI_IO Offset: 0x3b0) (R/W 8) ACPI EC 0 (EC_OBF Interrupt) Selection Register -------- */

typedef union
{
  struct
  {
    uint8_t  IRQ:8;                     /**< bit:   0..7  FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. */
  };
  uint8_t  w;
} __ESPI_IO_ACPI_EC_0_OBF_IRQ_SELECT_bits_t;
#define ESPI_IO_ACPI_EC_0_OBF_IRQ_SELECT_RESETVALUE (0xFFU)                                       /**<  (ESPI_IO_ACPI_EC_0_OBF_IRQ_SELECT) ACPI EC 0 (EC_OBF Interrupt) Selection Register  Reset Value */

