ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
#define ESPI_IO_ACPI_EC_0_OBF_IRQ_SELECT_IRQ_Pos (0)                                            /**< (ESPI_IO_ACPI_EC_0_OBF_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Position */
#define ESPI_IO_ACPI_EC_0_OBF_IRQ_SELECT_IRQ_Msk (0xFFU << ESPI_IO_ACPI_EC_0_OBF_IRQ_SELECT_IRQ_Pos)  /**< (ESPI_IO_ACPI_EC_0_OBF_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Mask */
#define ESPI_IO_ACPI_EC_0_OBF_IRQ_SELECT_IRQ(value) (ESPI_IO_ACPI_EC_0_OBF_IRQ_SELECT_IRQ_Msk & ((value) << ESPI_IO_ACPI_EC_0_OBF_IRQ_SELECT_IRQ_Pos))
#define ESPI_IO_ACPI_EC_0_OBF_IRQ_SELECT_Msk  (0x000000FFUL)                                 /**< (ESPI_IO_ACPI_EC_0_OBF_IRQ_SELECT) Register Mask  */

/* -------- ESPI_IO_ACPI_EC_1_OBF_IRQ_SELECT : (ESPI_IO Offset: 0x3b1) (R/W 8) ACPI EC 1 (EC_OBF Interrupt) Selection Register -------- */

typedef union
{
  struct
  {
    uint8_t  IRQ:8;                     /**< bit:   0..7  FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. */
  };
  uint8_t  w;
} __ESPI_IO_ACPI_EC_1_OBF_IRQ_SELECT_bits_t;
#define ESPI_IO_ACPI_EC_1_OBF_IRQ_SELECT_RESETVALUE (0xFFU)                                       /**<  (ESPI_IO_ACPI_EC_1_OBF_IRQ_SELECT) ACPI EC 1 (EC_OBF Interrupt) Selection Register  Reset Value */

#define ESPI_IO_ACPI_EC_1_OBF_IRQ_SELECT_IRQ_Pos (0)                                            /**< (ESPI_IO_ACPI_EC_1_OBF_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Position */
#define ESPI_IO_ACPI_EC_1_OBF_IRQ_SELECT_IRQ_Msk (0xFFU << ESPI_IO_ACPI_EC_1_OBF_IRQ_SELECT_IRQ_Pos)  /**< (ESPI_IO_ACPI_EC_1_OBF_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Mask */
#define ESPI_IO_ACPI_EC_1_OBF_IRQ_SELECT_IRQ(value) (ESPI_IO_ACPI_EC_1_OBF_IRQ_SELECT_IRQ_Msk & ((value) << ESPI_IO_ACPI_EC_1_OBF_IRQ_SELECT_IRQ_Pos))
#define ESPI_IO_ACPI_EC_1_OBF_IRQ_SELECT_Msk  (0x000000FFUL)                                 /**< (ESPI_IO_ACPI_EC_1_OBF_IRQ_SELECT) Register Mask  */

/* -------- ESPI_IO_ACPI_EC_2_OBF_IRQ_SELECT : (ESPI_IO Offset: 0x3b2) (R/W 8) ACPI EC 2 (EC_OBF Interrupt) Selection Register -------- */

typedef union
{
  struct
  {
    uint8_t  IRQ:8;                     /**< bit:   0..7  FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. */
  };
  uint8_t  w;
} __ESPI_IO_ACPI_EC_2_OBF_IRQ_SELECT_bits_t;
#define ESPI_IO_ACPI_EC_2_OBF_IRQ_SELECT_RESETVALUE (0xFFU)                                       /**<  (ESPI_IO_ACPI_EC_2_OBF_IRQ_SELECT) ACPI EC 2 (EC_OBF Interrupt) Selection Register  Reset Value */

#define ESPI_IO_ACPI_EC_2_OBF_IRQ_SELECT_IRQ_Pos (0)                                            /**< (ESPI_IO_ACPI_EC_2_OBF_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Position */
#define ESPI_IO_ACPI_EC_2_OBF_IRQ_SELECT_IRQ_Msk (0xFFU << ESPI_IO_ACPI_EC_2_OBF_IRQ_SELECT_IRQ_Pos)  /**< (ESPI_IO_ACPI_EC_2_OBF_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Mask */
#define ESPI_IO_ACPI_EC_2_OBF_IRQ_SELECT_IRQ(value) (ESPI_IO_ACPI_EC_2_OBF_IRQ_SELECT_IRQ_Msk & ((value) << ESPI_IO_ACPI_EC_2_OBF_IRQ_SELECT_IRQ_Pos))
#define ESPI_IO_ACPI_EC_2_OBF_IRQ_SELECT_Msk  (0x000000FFUL)                                 /**< (ESPI_IO_ACPI_EC_2_OBF_IRQ_SELECT) Register Mask  */

/* -------- ESPI_IO_ACPI_EC_3_OBF_IRQ_SELECT : (ESPI_IO Offset: 0x3b3) (R/W 8) ACPI EC 3 (EC_OBF Interrupt) Selection Register -------- */

typedef union
{
  struct
  {
    uint8_t  IRQ:8;                     /**< bit:   0..7  FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. */
  };
  uint8_t  w;
} __ESPI_IO_ACPI_EC_3_OBF_IRQ_SELECT_bits_t;
#define ESPI_IO_ACPI_EC_3_OBF_IRQ_SELECT_RESETVALUE (0xFFU)                                       /**<  (ESPI_IO_ACPI_EC_3_OBF_IRQ_SELECT) ACPI EC 3 (EC_OBF Interrupt) Selection Register  Reset Value */

#define ESPI_IO_ACPI_EC_3_OBF_IRQ_SELECT_IRQ_Pos (0)                                            /**< (ESPI_IO_ACPI_EC_3_OBF_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Position */
#define ESPI_IO_ACPI_EC_3_OBF_IRQ_SELECT_IRQ_Msk (0xFFU << ESPI_IO_ACPI_EC_3_OBF_IRQ_SELECT_IRQ_Pos)  /**< (ESPI_IO_ACPI_EC_3_OBF_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Mask */
#define ESPI_IO_ACPI_EC_3_OBF_IRQ_SELECT_IRQ(value) (ESPI_IO_ACPI_EC_3_OBF_IRQ_SELECT_IRQ_Msk & ((value) << ESPI_IO_ACPI_EC_3_OBF_IRQ_SELECT_IRQ_Pos))
#define ESPI_IO_ACPI_EC_3_OBF_IRQ_SELECT_Msk  (0x000000FFUL)                                 /**< (ESPI_IO_ACPI_EC_3_OBF_IRQ_SELECT) Register Mask  */

/* -------- ESPI_IO_UART_0_IRQ_SELECT : (ESPI_IO Offset: 0x3b5) (R/W 8) UART 0 (UART Interrupt) Selection Register -------- */

typedef union
{
  struct
  {
    uint8_t  IRQ:8;                     /**< bit:   0..7  FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. */
  };
  uint8_t  w;
} __ESPI_IO_UART_0_IRQ_SELECT_bits_t;
#define ESPI_IO_UART_0_IRQ_SELECT_RESETVALUE (0xFFU)                                       /**<  (ESPI_IO_UART_0_IRQ_SELECT) UART 0 (UART Interrupt) Selection Register  Reset Value */

