ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
#define ESPI_IO_UART_0_IRQ_SELECT_IRQ_Pos     (0)                                            /**< (ESPI_IO_UART_0_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Position */
#define ESPI_IO_UART_0_IRQ_SELECT_IRQ_Msk     (0xFFU << ESPI_IO_UART_0_IRQ_SELECT_IRQ_Pos)   /**< (ESPI_IO_UART_0_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Mask */
#define ESPI_IO_UART_0_IRQ_SELECT_IRQ(value)  (ESPI_IO_UART_0_IRQ_SELECT_IRQ_Msk & ((value) << ESPI_IO_UART_0_IRQ_SELECT_IRQ_Pos))
#define ESPI_IO_UART_0_IRQ_SELECT_Msk         (0x000000FFUL)                                 /**< (ESPI_IO_UART_0_IRQ_SELECT) Register Mask  */

/* -------- ESPI_IO_UART_1_IRQ_SELECT : (ESPI_IO Offset: 0x3b6) (R/W 8) UART 1 (UART Interrupt) Selection Register -------- */

typedef union
{
  struct
  {
    uint8_t  IRQ:8;                     /**< bit:   0..7  FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. */
  };
  uint8_t  w;
} __ESPI_IO_UART_1_IRQ_SELECT_bits_t;
#define ESPI_IO_UART_1_IRQ_SELECT_RESETVALUE (0xFFU)                                       /**<  (ESPI_IO_UART_1_IRQ_SELECT) UART 1 (UART Interrupt) Selection Register  Reset Value */

#define ESPI_IO_UART_1_IRQ_SELECT_IRQ_Pos     (0)                                            /**< (ESPI_IO_UART_1_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Position */
#define ESPI_IO_UART_1_IRQ_SELECT_IRQ_Msk     (0xFFU << ESPI_IO_UART_1_IRQ_SELECT_IRQ_Pos)   /**< (ESPI_IO_UART_1_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Mask */
#define ESPI_IO_UART_1_IRQ_SELECT_IRQ(value)  (ESPI_IO_UART_1_IRQ_SELECT_IRQ_Msk & ((value) << ESPI_IO_UART_1_IRQ_SELECT_IRQ_Pos))
#define ESPI_IO_UART_1_IRQ_SELECT_Msk         (0x000000FFUL)                                 /**< (ESPI_IO_UART_1_IRQ_SELECT) Register Mask  */

/* -------- ESPI_IO_EMI_0_HOST_IRQ_SELECT : (ESPI_IO Offset: 0x3b7) (R/W 8) EMI 0 (Host Event Interrupt) Selection Register -------- */

typedef union
{
  struct
  {
    uint8_t  IRQ:8;                     /**< bit:   0..7  FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. */
  };
  uint8_t  w;
} __ESPI_IO_EMI_0_HOST_IRQ_SELECT_bits_t;
#define ESPI_IO_EMI_0_HOST_IRQ_SELECT_RESETVALUE (0xFFU)                                       /**<  (ESPI_IO_EMI_0_HOST_IRQ_SELECT) EMI 0 (Host Event Interrupt) Selection Register  Reset Value */

#define ESPI_IO_EMI_0_HOST_IRQ_SELECT_IRQ_Pos (0)                                            /**< (ESPI_IO_EMI_0_HOST_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Position */
#define ESPI_IO_EMI_0_HOST_IRQ_SELECT_IRQ_Msk (0xFFU << ESPI_IO_EMI_0_HOST_IRQ_SELECT_IRQ_Pos)  /**< (ESPI_IO_EMI_0_HOST_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Mask */
#define ESPI_IO_EMI_0_HOST_IRQ_SELECT_IRQ(value) (ESPI_IO_EMI_0_HOST_IRQ_SELECT_IRQ_Msk & ((value) << ESPI_IO_EMI_0_HOST_IRQ_SELECT_IRQ_Pos))
#define ESPI_IO_EMI_0_HOST_IRQ_SELECT_Msk     (0x000000FFUL)                                 /**< (ESPI_IO_EMI_0_HOST_IRQ_SELECT) Register Mask  */

/* -------- ESPI_IO_EMI_0_EC_HOST_IRQ_SELECT : (ESPI_IO Offset: 0x3b8) (R/W 8) EMI 0 (EC-to-Host Interrupt) Selection Register -------- */

typedef union
{
  struct
  {
    uint8_t  IRQ:8;                     /**< bit:   0..7  FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. */
  };
  uint8_t  w;
} __ESPI_IO_EMI_0_EC_HOST_IRQ_SELECT_bits_t;
#define ESPI_IO_EMI_0_EC_HOST_IRQ_SELECT_RESETVALUE (0xFFU)                                       /**<  (ESPI_IO_EMI_0_EC_HOST_IRQ_SELECT) EMI 0 (EC-to-Host Interrupt) Selection Register  Reset Value */

#define ESPI_IO_EMI_0_EC_HOST_IRQ_SELECT_IRQ_Pos (0)                                            /**< (ESPI_IO_EMI_0_EC_HOST_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Position */
#define ESPI_IO_EMI_0_EC_HOST_IRQ_SELECT_IRQ_Msk (0xFFU << ESPI_IO_EMI_0_EC_HOST_IRQ_SELECT_IRQ_Pos)  /**< (ESPI_IO_EMI_0_EC_HOST_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Mask */
#define ESPI_IO_EMI_0_EC_HOST_IRQ_SELECT_IRQ(value) (ESPI_IO_EMI_0_EC_HOST_IRQ_SELECT_IRQ_Msk & ((value) << ESPI_IO_EMI_0_EC_HOST_IRQ_SELECT_IRQ_Pos))
#define ESPI_IO_EMI_0_EC_HOST_IRQ_SELECT_Msk  (0x000000FFUL)                                 /**< (ESPI_IO_EMI_0_EC_HOST_IRQ_SELECT) Register Mask  */

/* -------- ESPI_IO_EMI_1_HOST_IRQ_SELECT : (ESPI_IO Offset: 0x3b9) (R/W 8) EMI 1 (Host Event Interrupt) Selection Register -------- */

typedef union
{
  struct
  {
    uint8_t  IRQ:8;                     /**< bit:   0..7  FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. */
  };
  uint8_t  w;
} __ESPI_IO_EMI_1_HOST_IRQ_SELECT_bits_t;
#define ESPI_IO_EMI_1_HOST_IRQ_SELECT_RESETVALUE (0xFFU)                                       /**<  (ESPI_IO_EMI_1_HOST_IRQ_SELECT) EMI 1 (Host Event Interrupt) Selection Register  Reset Value */

#define ESPI_IO_EMI_1_HOST_IRQ_SELECT_IRQ_Pos (0)                                            /**< (ESPI_IO_EMI_1_HOST_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Position */
#define ESPI_IO_EMI_1_HOST_IRQ_SELECT_IRQ_Msk (0xFFU << ESPI_IO_EMI_1_HOST_IRQ_SELECT_IRQ_Pos)  /**< (ESPI_IO_EMI_1_HOST_IRQ_SELECT) FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. Mask */
#define ESPI_IO_EMI_1_HOST_IRQ_SELECT_IRQ(value) (ESPI_IO_EMI_1_HOST_IRQ_SELECT_IRQ_Msk & ((value) << ESPI_IO_EMI_1_HOST_IRQ_SELECT_IRQ_Pos))
#define ESPI_IO_EMI_1_HOST_IRQ_SELECT_Msk     (0x000000FFUL)                                 /**< (ESPI_IO_EMI_1_HOST_IRQ_SELECT) Register Mask  */

/* -------- ESPI_IO_EMI_1_EC_HOST_IRQ_SELECT : (ESPI_IO Offset: 0x3ba) (R/W 8) EMI 1 (EC-to-Host Interrupt) Selection Register -------- */

typedef union
{
  struct
  {
    uint8_t  IRQ:8;                     /**< bit:   0..7  FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h. */
  };
  uint8_t  w;
} __ESPI_IO_EMI_1_EC_HOST_IRQ_SELECT_bits_t;
#define ESPI_IO_EMI_1_EC_HOST_IRQ_SELECT_RESETVALUE (0xFFU)                                       /**<  (ESPI_IO_EMI_1_EC_HOST_IRQ_SELECT) EMI 1 (EC-to-Host Interrupt) Selection Register  Reset Value */

