ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
/* -------- ESPI_IO_ESPI_VWIRE_ERRORS : (ESPI_IO Offset: 0x3f0) (R/W 8) eSPI Virtual Wire Errors Register -------- */

typedef union
{
  struct
  {
    uint8_t  ERROR_FATAL_STATUS:1;      /**< bit:      0  This bit is a Master-readable copy of the Virtual Wire ERROR_FATAL (bit 1 in Slave-to-Master Virtual Wire Index 5h). */
    uint8_t  CLEAR_FATAL_ERROR_STATUS:1;  /**< bit:      1  When this field is written with a 1 the Virtual Wire ERROR_FATAL (bit 1 in Slave-to-Master Virtual Wire Index 5h)\n      is cleared to 0. Because clearing the status bit changes its state, a Virtual Wire packet reporting the new state will be sent\n      to the Master. Writes of 0 to this bit have no effect. Reads of this bit always return '0'. */
    uint8_t  :2;                        /**< bit:   2..3  Reserved                                      */
    uint8_t  ERROR_NON_FATAL_STATUS:1;  /**< bit:      4  This bit is a Master-readable copy of the Virtual Wire ERROR_NON_FATAL (bit 2 in Slave-to-Master Virtual Wire Index 5h). */
    uint8_t  CLEAR_NON_FATAL_ERROR_STATUS:1;  /**< bit:      5  When this field is written with a 1 the Virtual Wire ERROR_NON_- FATAL (bit 2 in Slave-to-Master Virtual Wire Index 5h)\n      is cleared to 0. Because clearing the status bit changes its state, a Virtual Wire packet reporting the new state will be sent to\n      the Master. Writes of 0 to this bit have no effect. Reads of this bit always return '0'. */
    uint8_t  :2;                        /**< bit:   6..7  Reserved                                      */
  };
  uint8_t  w;
} __ESPI_IO_ESPI_VWIRE_ERRORS_bits_t;
#define ESPI_IO_ESPI_VWIRE_ERRORS_RESETVALUE (0xFFU)                                       /**<  (ESPI_IO_ESPI_VWIRE_ERRORS) eSPI Virtual Wire Errors Register  Reset Value */

#define ESPI_IO_ESPI_VWIRE_ERRORS_ERROR_FATAL_STATUS_Pos (0)                                            /**< (ESPI_IO_ESPI_VWIRE_ERRORS) This bit is a Master-readable copy of the Virtual Wire ERROR_FATAL (bit 1 in Slave-to-Master Virtual Wire Index 5h). Position */
#define ESPI_IO_ESPI_VWIRE_ERRORS_ERROR_FATAL_STATUS_Msk (0x1U << ESPI_IO_ESPI_VWIRE_ERRORS_ERROR_FATAL_STATUS_Pos)  /**< (ESPI_IO_ESPI_VWIRE_ERRORS) This bit is a Master-readable copy of the Virtual Wire ERROR_FATAL (bit 1 in Slave-to-Master Virtual Wire Index 5h). Mask */
#define ESPI_IO_ESPI_VWIRE_ERRORS_CLEAR_FATAL_ERROR_STATUS_Pos (1)                                            /**< (ESPI_IO_ESPI_VWIRE_ERRORS) When this field is written with a 1 the Virtual Wire ERROR_FATAL (bit 1 in Slave-to-Master Virtual Wire Index 5h)\n      is cleared to 0. Because clearing the status bit changes its state, a Virtual Wire packet reporting the new state will be sent\n      to the Master. Writes of 0 to this bit have no effect. Reads of this bit always return '0'. Position */
#define ESPI_IO_ESPI_VWIRE_ERRORS_CLEAR_FATAL_ERROR_STATUS_Msk (0x1U << ESPI_IO_ESPI_VWIRE_ERRORS_CLEAR_FATAL_ERROR_STATUS_Pos)  /**< (ESPI_IO_ESPI_VWIRE_ERRORS) When this field is written with a 1 the Virtual Wire ERROR_FATAL (bit 1 in Slave-to-Master Virtual Wire Index 5h)\n      is cleared to 0. Because clearing the status bit changes its state, a Virtual Wire packet reporting the new state will be sent\n      to the Master. Writes of 0 to this bit have no effect. Reads of this bit always return '0'. Mask */
#define ESPI_IO_ESPI_VWIRE_ERRORS_ERROR_NON_FATAL_STATUS_Pos (4)                                            /**< (ESPI_IO_ESPI_VWIRE_ERRORS) This bit is a Master-readable copy of the Virtual Wire ERROR_NON_FATAL (bit 2 in Slave-to-Master Virtual Wire Index 5h). Position */
#define ESPI_IO_ESPI_VWIRE_ERRORS_ERROR_NON_FATAL_STATUS_Msk (0x1U << ESPI_IO_ESPI_VWIRE_ERRORS_ERROR_NON_FATAL_STATUS_Pos)  /**< (ESPI_IO_ESPI_VWIRE_ERRORS) This bit is a Master-readable copy of the Virtual Wire ERROR_NON_FATAL (bit 2 in Slave-to-Master Virtual Wire Index 5h). Mask */
#define ESPI_IO_ESPI_VWIRE_ERRORS_CLEAR_NON_FATAL_ERROR_STATUS_Pos (5)                                            /**< (ESPI_IO_ESPI_VWIRE_ERRORS) When this field is written with a 1 the Virtual Wire ERROR_NON_- FATAL (bit 2 in Slave-to-Master Virtual Wire Index 5h)\n      is cleared to 0. Because clearing the status bit changes its state, a Virtual Wire packet reporting the new state will be sent to\n      the Master. Writes of 0 to this bit have no effect. Reads of this bit always return '0'. Position */
#define ESPI_IO_ESPI_VWIRE_ERRORS_CLEAR_NON_FATAL_ERROR_STATUS_Msk (0x1U << ESPI_IO_ESPI_VWIRE_ERRORS_CLEAR_NON_FATAL_ERROR_STATUS_Pos)  /**< (ESPI_IO_ESPI_VWIRE_ERRORS) When this field is written with a 1 the Virtual Wire ERROR_NON_- FATAL (bit 2 in Slave-to-Master Virtual Wire Index 5h)\n      is cleared to 0. Because clearing the status bit changes its state, a Virtual Wire packet reporting the new state will be sent to\n      the Master. Writes of 0 to this bit have no effect. Reads of this bit always return '0'. Mask */
#define ESPI_IO_ESPI_VWIRE_ERRORS_Msk         (0x00000033UL)                                 /**< (ESPI_IO_ESPI_VWIRE_ERRORS) Register Mask  */

/** \brief ESPI_IO register offsets definitions */
#define ESPI_IO_INDEX_OFFSET         (0x00)         /**< (ESPI_IO_INDEX) The INDEX register, which is part of the Configuration Port, is used as a pointer to a Configuration Register Address. Offset */
#define ESPI_IO_DATA_REG_OFFSET      (0x01)         /**< (ESPI_IO_DATA_REG) The DATA register, which is part of the Configuration Port, is used to read or write data to the register currently being selected by the INDEX Register. Offset */
#define ESPI_IO_PC_LAST_CYCLE_DW0_OFFSET (0x100)        /**< (ESPI_IO_PC_LAST_CYCLE_DW0) Peripheral Channel Last Cycle Register (DWord 0) Offset */
#define ESPI_IO_PC_LAST_CYCLE_DW1_OFFSET (0x104)        /**< (ESPI_IO_PC_LAST_CYCLE_DW1) Peripheral Channel Last Cycle Register (DWord 1) Offset */
#define ESPI_IO_PC_LAST_CYCLE_DW2_OFFSET (0x108)        /**< (ESPI_IO_PC_LAST_CYCLE_DW2) Peripheral Channel Last Cycle Register (DWord 2) Offset */
#define ESPI_IO_PC_ERROR_ADDRESS_DW0_OFFSET (0x10C)        /**< (ESPI_IO_PC_ERROR_ADDRESS_DW0) Peripheral Channel Error Address Register (DWord 0) Offset */
#define ESPI_IO_PC_ERROR_ADDRESS_DW1_OFFSET (0x110)        /**< (ESPI_IO_PC_ERROR_ADDRESS_DW1) Peripheral Channel Error Address Register (DWord 1) Offset */
#define ESPI_IO_PC_STATUS_OFFSET     (0x114)        /**< (ESPI_IO_PC_STATUS) Peripheral Channel Status Register Offset */
#define ESPI_IO_PC_INT_ENABLE_OFFSET (0x118)        /**< (ESPI_IO_PC_INT_ENABLE) Peripheral Channel Interrupt Enable Register Offset */
#define ESPI_IO_BAR_INHIBIT_DW0_OFFSET (0x120)        /**< (ESPI_IO_BAR_INHIBIT_DW0) BAR Inhibit Register (DWord 0) Offset */
#define ESPI_IO_BAR_INHIBIT_DW1_OFFSET (0x124)        /**< (ESPI_IO_BAR_INHIBIT_DW1) BAR Inhibit Register (DWord 1) Offset */
#define ESPI_IO_ESPI_BAR_INIT_OFFSET (0x128)        /**< (ESPI_IO_ESPI_BAR_INIT) eSPI BAR Init Register Offset */
#define ESPI_IO_EC_IRQ_OFFSET        (0x12C)        /**< (ESPI_IO_EC_IRQ) EC IRQ Register Offset */
#define ESPI_IO_BASE_ADDRESS_OFFSET  (0x134)        /**< (ESPI_IO_BASE_ADDRESS) eSPI I/O Base Address Register Offset */
#define ESPI_IO_ESPI_MEM_BASE_ADDRESS_OFFSET (0x138)        /**< (ESPI_IO_ESPI_MEM_BASE_ADDRESS) eSPI Memory Base Address Register Offset */
#define ESPI_IO_MBX_BASE_ADDRESS_OFFSET (0x13C)        /**< (ESPI_IO_MBX_BASE_ADDRESS) Mailbox BAR  Register Offset */
#define ESPI_IO_EM8042_BASE_ADDRESS_OFFSET (0x140)        /**< (ESPI_IO_EM8042_BASE_ADDRESS) 8042 Emulated Keyboard Controller BAR Register Offset */
#define ESPI_IO_ACPI_EC_0_BASE_ADDRESS_OFFSET (0x144)        /**< (ESPI_IO_ACPI_EC_0_BASE_ADDRESS) ACPI EC Channel 0 Register Offset */
#define ESPI_IO_ACPI_EC_1_BASE_ADDRESS_OFFSET (0x148)        /**< (ESPI_IO_ACPI_EC_1_BASE_ADDRESS) ACPI EC Channel 1 BAR Register Offset */
#define ESPI_IO_ACPI_EC_2_BASE_ADDRESS_OFFSET (0x14C)        /**< (ESPI_IO_ACPI_EC_2_BASE_ADDRESS) I/O Base Address Register Offset */
#define ESPI_IO_ACPI_EC_3_BASE_ADDRESS_OFFSET (0x150)        /**< (ESPI_IO_ACPI_EC_3_BASE_ADDRESS) I/O Base Address Register Offset */
#define ESPI_IO_ACPI_PM1_BASE_ADDRESS_OFFSET (0x158)        /**< (ESPI_IO_ACPI_PM1_BASE_ADDRESS) I/O Base Address Register Offset */
#define ESPI_IO_FAST_KDB_BASE_ADDRESS_OFFSET (0x15C)        /**< (ESPI_IO_FAST_KDB_BASE_ADDRESS) I/O Base Address Register Offset */
#define ESPI_IO_UART_0_BASE_ADDRESS_OFFSET (0x160)        /**< (ESPI_IO_UART_0_BASE_ADDRESS) I/O Base Address Register Offset */
#define ESPI_IO_UART_1_BASE_ADDRESS_OFFSET (0x164)        /**< (ESPI_IO_UART_1_BASE_ADDRESS) I/O Base Address Register Offset */
#define ESPI_IO_EMI_0_BASE_ADDRESS_OFFSET (0x168)        /**< (ESPI_IO_EMI_0_BASE_ADDRESS) I/O Base Address Register Offset */
#define ESPI_IO_EMI_1_BASE_ADDRESS_OFFSET (0x16C)        /**< (ESPI_IO_EMI_1_BASE_ADDRESS) I/O Base Address Register Offset */
#define ESPI_IO_PORT80_0_BASE_ADDRESS_OFFSET (0x174)        /**< (ESPI_IO_PORT80_0_BASE_ADDRESS) I/O Base Address Register Offset */
#define ESPI_IO_PORT80_1_BASE_ADDRESS_OFFSET (0x178)        /**< (ESPI_IO_PORT80_1_BASE_ADDRESS) I/O Base Address Register Offset */
#define ESPI_IO_RTC_BASE_ADDRESS_OFFSET (0x17C)        /**< (ESPI_IO_RTC_BASE_ADDRESS) I/O Base Address Register Offset */
#define ESPI_IO_UART_2_BASE_ADDRESS_OFFSET (0x188)        /**< (ESPI_IO_UART_2_BASE_ADDRESS) I/O Base Address Register Offset */
#define ESPI_IO_GLUE_BASE_ADDRESS_OFFSET (0x18C)        /**< (ESPI_IO_GLUE_BASE_ADDRESS) I/O Base Address Register Offset */
#define ESPI_IO_LTR_PERIPHERAL_STATUS_OFFSET (0x220)        /**< (ESPI_IO_LTR_PERIPHERAL_STATUS) LTR Peripheral Status Register Offset */
#define ESPI_IO_LTR_PERIPHERAL_ENABLE_OFFSET (0x224)        /**< (ESPI_IO_LTR_PERIPHERAL_ENABLE) LTR Peripheral Enable Register Offset */
#define ESPI_IO_LTR_PERIPHERAL_CONTROL_OFFSET (0x228)        /**< (ESPI_IO_LTR_PERIPHERAL_CONTROL) LTR Peripheral Control Register Offset */
#define ESPI_IO_LTR_PERIPHERAL_MESSAGE_OFFSET (0x22C)        /**< (ESPI_IO_LTR_PERIPHERAL_MESSAGE) LTR Peripheral Message Register Offset */
#define ESPI_IO_OOB_RECEIVE_ADDRESS_OFFSET (0x240)        /**< (ESPI_IO_OOB_RECEIVE_ADDRESS) OOB Channel Receive Address Register Offset */
#define ESPI_IO_OOB_TRANSMIT_ADDRESS_OFFSET (0x248)        /**< (ESPI_IO_OOB_TRANSMIT_ADDRESS) OOB Channel Transmit Address Register Offset */
#define ESPI_IO_OOB_RECEIVE_LENGTH_OFFSET (0x250)        /**< (ESPI_IO_OOB_RECEIVE_LENGTH) OOB Channel Receive Length Register Offset */
#define ESPI_IO_OOB_TRANSMIT_LENGTH_OFFSET (0x254)        /**< (ESPI_IO_OOB_TRANSMIT_LENGTH) OOB Channel Transmit Length Register Offset */
#define ESPI_IO_OOB_RECEIVE_CONTROL_OFFSET (0x258)        /**< (ESPI_IO_OOB_RECEIVE_CONTROL) OOB Channel Receive Control Register Offset */
#define ESPI_IO_OOB_RECEIVE_INT_ENABLE_OFFSET (0x25C)        /**< (ESPI_IO_OOB_RECEIVE_INT_ENABLE) OOB Channel Receive Interrupt Enable Register Offset */
#define ESPI_IO_OOB_RECEIVE_STATUS_OFFSET (0x260)        /**< (ESPI_IO_OOB_RECEIVE_STATUS) OOB Channel Receive Status Register Offset */
#define ESPI_IO_OOB_TRANSMIT_CONTROL_OFFSET (0x264)        /**< (ESPI_IO_OOB_TRANSMIT_CONTROL) OOB Channel Transmit Control Register Offset */
#define ESPI_IO_OOB_TRANSMIT_INT_ENABLE_OFFSET (0x268)        /**< (ESPI_IO_OOB_TRANSMIT_INT_ENABLE) OOB Channel Transmit Interrupt Enable Register Offset */
#define ESPI_IO_OOB_TRANSMIT_STATUS_OFFSET (0x26C)        /**< (ESPI_IO_OOB_TRANSMIT_STATUS) OOB Channel Transmit Status Register Offset */
#define ESPI_IO_FLASH_CH_FLASH_ADDRESS_OFFSET (0x280)        /**< (ESPI_IO_FLASH_CH_FLASH_ADDRESS) Flash Access Channel Flash Address Register Offset */
#define ESPI_IO_FLASH_CH_BUFFER_ADDRESS_OFFSET (0x288)        /**< (ESPI_IO_FLASH_CH_BUFFER_ADDRESS) Flash Access Channel Buffer Address Register Offset */
#define ESPI_IO_FLASH_CH_TRANSFER_LENGTH_OFFSET (0x290)        /**< (ESPI_IO_FLASH_CH_TRANSFER_LENGTH) Flash Access Channel Transfer Length Register Offset */
#define ESPI_IO_FLASH_CH_CONTROL_OFFSET (0x294)        /**< (ESPI_IO_FLASH_CH_CONTROL) Flash Access Channel Control Register Offset */
#define ESPI_IO_FLASH_CH_INT_ENABLE_OFFSET (0x298)        /**< (ESPI_IO_FLASH_CH_INT_ENABLE) Flash Access Channel Interrupt Enable Register Offset */
#define ESPI_IO_FLASH_CH_CONFIG_OFFSET (0x29C)        /**< (ESPI_IO_FLASH_CH_CONFIG) Flash Access Channel Configuration Register Offset */
#define ESPI_IO_FLASH_CH_STATUS_OFFSET (0x2A0)        /**< (ESPI_IO_FLASH_CH_STATUS) Flash Access Channel Status Register Offset */
#define ESPI_IO_VWIRE_STATUS_OFFSET  (0x2B0)        /**< (ESPI_IO_VWIRE_STATUS) Virtual Wire Status Register Offset */
#define ESPI_IO_ESPI_CAPABILITIES_ID_OFFSET (0x2E0)        /**< (ESPI_IO_ESPI_CAPABILITIES_ID) eSPI Capabilities ID Register Offset */
#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0_OFFSET (0x2E1)        /**< (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0) eSPI Capabilities Global Capabilities 0 Register Offset */
#define ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1_OFFSET (0x2E2)        /**< (ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1) eSPI Capabilities Global Capabilities 1 Register Offset */
#define ESPI_IO_ESPI_PC_CAPABILITIES_OFFSET (0x2E3)        /**< (ESPI_IO_ESPI_PC_CAPABILITIES) eSPI Peripheral Channel Capabilities Register Offset */
#define ESPI_IO_ESPI_VWIRE_CAPABILITIES_OFFSET (0x2E4)        /**< (ESPI_IO_ESPI_VWIRE_CAPABILITIES) eSPI Virtual Wire Channel Capabilities Register Offset */
#define ESPI_IO_ESPI_OOB_CAPABILITIES_OFFSET (0x2E5)        /**< (ESPI_IO_ESPI_OOB_CAPABILITIES) eSPI OOB Channel Capabilities Register Offset */
#define ESPI_IO_ESPI_FLASH_CAPABILITIES_OFFSET (0x2E6)        /**< (ESPI_IO_ESPI_FLASH_CAPABILITIES) eSPI Flash Channel Capabilities Register Offset */
#define ESPI_IO_ESPI_PERIPHERAL_READY_OFFSET (0x2E7)        /**< (ESPI_IO_ESPI_PERIPHERAL_READY) eSPI Peripheral Channel Ready Register Offset */
#define ESPI_IO_ESPI_OOB_READY_OFFSET (0x2E8)        /**< (ESPI_IO_ESPI_OOB_READY) eSPI OOB Channel Ready Register Offset */
#define ESPI_IO_ESPI_FLASH_READY_OFFSET (0x2E9)        /**< (ESPI_IO_ESPI_FLASH_READY) eSPI Flash Channel Ready Register Offset */
#define ESPI_IO_ESPI_RESET_INT_STATUS_OFFSET (0x2EA)        /**< (ESPI_IO_ESPI_RESET_INT_STATUS) eSPI Reset Interrupt Status Register Offset */
#define ESPI_IO_ESPI_RESET_INT_ENABLE_OFFSET (0x2EB)        /**< (ESPI_IO_ESPI_RESET_INT_ENABLE) eSPI Reset Interrupt Enable Register Offset */
#define ESPI_IO_PLTRST_SOURCE_OFFSET (0x2EC)        /**< (ESPI_IO_PLTRST_SOURCE) PLTRST Source Register Offset */
#define ESPI_IO_ESPI_VWIRE_READY_OFFSET (0x2ED)        /**< (ESPI_IO_ESPI_VWIRE_READY) eSPI Virtual Wire Channel Ready Register Offset */
#define ESPI_IO_ESPI_ACTIVATE_OFFSET (0x330)        /**< (ESPI_IO_ESPI_ACTIVATE) eSPI Activate Register Offset */
#define ESPI_IO_BAR_CONFIG_ADDRESS_OFFSET (0x334)        /**< (ESPI_IO_BAR_CONFIG_ADDRESS) eSPI I/O Base Address Configuration Register Offset */
#define ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS_OFFSET (0x338)        /**< (ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS) eSPI Memory Base Address Configuration Register Offset */
#define ESPI_IO_MBX_BAR_CONFIG_ADDRESS_OFFSET (0x33C)        /**< (ESPI_IO_MBX_BAR_CONFIG_ADDRESS) Mailbox Base Address Configuration Register Offset */
#define ESPI_IO_EM8042_BAR_CONFIG_ADDRESS_OFFSET (0x340)        /**< (ESPI_IO_EM8042_BAR_CONFIG_ADDRESS) 8042 Emulated Keyboard Controller Base Address Configuration Register Offset */
#define ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS_OFFSET (0x344)        /**< (ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS) ACPI EC 0 Base Address Configuration Register Offset */
#define ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS_OFFSET (0x348)        /**< (ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS) ACPI EC 1 Base Address Configuration Register Offset */
#define ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS_OFFSET (0x34C)        /**< (ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS) ACPI EC 2 Base Address Configuration Register Offset */
#define ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS_OFFSET (0x350)        /**< (ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS) ACPI EC 3 Base Address Configuration Register Offset */
#define ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS_OFFSET (0x358)        /**< (ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS) ACPI PM1 Base Address Configuration Register Offset */
#define ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS_OFFSET (0x35C)        /**< (ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS) I/O Base Address Configuration Register Offset */
#define ESPI_IO_UART_0_BAR_CONFIG_ADDRESS_OFFSET (0x360)        /**< (ESPI_IO_UART_0_BAR_CONFIG_ADDRESS) UART 0 Base Address Configuration Register Offset */
#define ESPI_IO_UART_1_BAR_CONFIG_ADDRESS_OFFSET (0x364)        /**< (ESPI_IO_UART_1_BAR_CONFIG_ADDRESS) UART 1 Base Address Configuration Register Offset */
#define ESPI_IO_EMI_0_BAR_CONFIG_ADDRESS_OFFSET (0x368)        /**< (ESPI_IO_EMI_0_BAR_CONFIG_ADDRESS) Embedded Memory Interface (EMI) 2 BAR Config Register Offset */
#define ESPI_IO_EMI_1_BAR_CONFIG_ADDRESS_OFFSET (0x36C)        /**< (ESPI_IO_EMI_1_BAR_CONFIG_ADDRESS) Embedded Memory Interface (EMI) 1 BAR Config Register Offset */
#define ESPI_IO_PORT80_0_BAR_CONFIG_ADDRESS_OFFSET (0x374)        /**< (ESPI_IO_PORT80_0_BAR_CONFIG_ADDRESS) BIOS Debug Port (Port 80) 0 BAR Config Register Offset */
#define ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS_OFFSET (0x378)        /**< (ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS) BIOS Debug Port (Port 80) 1 BAR Config Register Offset */
#define ESPI_IO_RTC_BAR_CONFIG_ADDRESS_OFFSET (0x37C)        /**< (ESPI_IO_RTC_BAR_CONFIG_ADDRESS) RTC BAR Config Register Offset */
#define ESPI_IO_UART_2_BAR_CONFIG_ADDRESS_OFFSET (0x384)        /**< (ESPI_IO_UART_2_BAR_CONFIG_ADDRESS) UART 2 Base Address Configuration Register Offset */
#define ESPI_IO_GLUE_BAR_CONFIG_ADDRESS_OFFSET (0x38C)        /**< (ESPI_IO_GLUE_BAR_CONFIG_ADDRESS) GLUE Base Address Configuration Register Offset */
#define ESPI_IO_MBX_HOST_SIRQ_IRQ__SELECT_OFFSET (0x3AC)        /**< (ESPI_IO_MBX_HOST_SIRQ_IRQ__SELECT) Mailbox (MBX_Host_SIRQ Interrupt) Selection Register Offset */
#define ESPI_IO_MBX_HOST_SMI_IRQ_SELECT_OFFSET (0x3AD)        /**< (ESPI_IO_MBX_HOST_SMI_IRQ_SELECT) Mailbox (MBX_Host_SMI Interrupt) Selection Register Offset */
#define ESPI_IO_KIRQ_8042_IRQ_SELECT_OFFSET (0x3AE)        /**< (ESPI_IO_KIRQ_8042_IRQ_SELECT) 8042 (KIRQ Interrupt) Selection Register Offset */
#define ESPI_IO_MIRQ_8042_IRQ_SELECT_OFFSET (0x3AF)        /**< (ESPI_IO_MIRQ_8042_IRQ_SELECT) 8042 (MIRQ Interrupt) Selection Register Offset */
#define ESPI_IO_ACPI_EC_0_OBF_IRQ_SELECT_OFFSET (0x3B0)        /**< (ESPI_IO_ACPI_EC_0_OBF_IRQ_SELECT) ACPI EC 0 (EC_OBF Interrupt) Selection Register Offset */
#define ESPI_IO_ACPI_EC_1_OBF_IRQ_SELECT_OFFSET (0x3B1)        /**< (ESPI_IO_ACPI_EC_1_OBF_IRQ_SELECT) ACPI EC 1 (EC_OBF Interrupt) Selection Register Offset */
#define ESPI_IO_ACPI_EC_2_OBF_IRQ_SELECT_OFFSET (0x3B2)        /**< (ESPI_IO_ACPI_EC_2_OBF_IRQ_SELECT) ACPI EC 2 (EC_OBF Interrupt) Selection Register Offset */
#define ESPI_IO_ACPI_EC_3_OBF_IRQ_SELECT_OFFSET (0x3B3)        /**< (ESPI_IO_ACPI_EC_3_OBF_IRQ_SELECT) ACPI EC 3 (EC_OBF Interrupt) Selection Register Offset */
#define ESPI_IO_UART_0_IRQ_SELECT_OFFSET (0x3B5)        /**< (ESPI_IO_UART_0_IRQ_SELECT) UART 0 (UART Interrupt) Selection Register Offset */
#define ESPI_IO_UART_1_IRQ_SELECT_OFFSET (0x3B6)        /**< (ESPI_IO_UART_1_IRQ_SELECT) UART 1 (UART Interrupt) Selection Register Offset */
#define ESPI_IO_EMI_0_HOST_IRQ_SELECT_OFFSET (0x3B7)        /**< (ESPI_IO_EMI_0_HOST_IRQ_SELECT) EMI 0 (Host Event Interrupt) Selection Register Offset */
#define ESPI_IO_EMI_0_EC_HOST_IRQ_SELECT_OFFSET (0x3B8)        /**< (ESPI_IO_EMI_0_EC_HOST_IRQ_SELECT) EMI 0 (EC-to-Host Interrupt) Selection Register Offset */
#define ESPI_IO_EMI_1_HOST_IRQ_SELECT_OFFSET (0x3B9)        /**< (ESPI_IO_EMI_1_HOST_IRQ_SELECT) EMI 1 (Host Event Interrupt) Selection Register Offset */
#define ESPI_IO_EMI_1_EC_HOST_IRQ_SELECT_OFFSET (0x3BA)        /**< (ESPI_IO_EMI_1_EC_HOST_IRQ_SELECT) EMI 1 (EC-to-Host Interrupt) Selection Register Offset */
#define ESPI_IO_RTC_IRQ_SELECT_OFFSET (0x3BD)        /**< (ESPI_IO_RTC_IRQ_SELECT) RTC (RTC Interrupt) Selection Register Offset */
#define ESPI_IO_EC_IRQ_SELECT_OFFSET (0x3BE)        /**< (ESPI_IO_EC_IRQ_SELECT) EC (EC_IRQ Interrupt) Selection Register Offset */
#define ESPI_IO_UART_2_IRQ_SELECT_OFFSET (0x3BF)        /**< (ESPI_IO_UART_2_IRQ_SELECT) UART 2 (UART Interrupt) Selection Register Offset */
#define ESPI_IO_ESPI_VWIRE_ERRORS_OFFSET (0x3F0)        /**< (ESPI_IO_ESPI_VWIRE_ERRORS) eSPI Virtual Wire Errors Register Offset */

