ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_io.h
/** \brief ESPI_IO register API structure */
typedef struct
{  /* The Enhanced Serial Peripheral Interface (eSPI) is used by the system host to configure the chip and communicate\n    with the logical devices implemented in the design through a series of read/write registers. It is Intel's successor to the\n    Low Pin Count (LPC) bus, used in previous devices to provide System Host access to devices internal to the Embedded Controller.\n    The I/O Component is one of two Logical Devices (along with the Memory Component) that provide access to all the registers in the device. */
  __IO  __ESPI_IO_INDEX_bits_t         INDEX;         /**< Offset: 0x00 (R/W   8) The INDEX register, which is part of the Configuration Port, is used as a pointer to a Configuration Register Address. */
  __IO  __ESPI_IO_DATA_REG_bits_t      DATA_REG;      /**< Offset: 0x01 (R/W   8) The DATA register, which is part of the Configuration Port, is used to read or write data to the register currently being selected by the INDEX Register. */
  __I   __ESPI_IO_PC_LAST_CYCLE_DW0_bits_t PC_LAST_CYCLE_DW0; /**< Offset: 0x100 (R/   32) Peripheral Channel Last Cycle Register (DWord 0) */
  __I   __ESPI_IO_PC_LAST_CYCLE_DW1_bits_t PC_LAST_CYCLE_DW1; /**< Offset: 0x104 (R/   32) Peripheral Channel Last Cycle Register (DWord 1) */
  __I   __ESPI_IO_PC_LAST_CYCLE_DW2_bits_t PC_LAST_CYCLE_DW2; /**< Offset: 0x108 (R/   32) Peripheral Channel Last Cycle Register (DWord 2) */
  __I   __ESPI_IO_PC_ERROR_ADDRESS_DW0_bits_t PC_ERROR_ADDRESS_DW0; /**< Offset: 0x10C (R/   32) Peripheral Channel Error Address Register (DWord 0) */
  __I   __ESPI_IO_PC_ERROR_ADDRESS_DW1_bits_t PC_ERROR_ADDRESS_DW1; /**< Offset: 0x110 (R/   32) Peripheral Channel Error Address Register (DWord 1) */
  __IO  __ESPI_IO_PC_STATUS_bits_t     PC_STATUS;     /**< Offset: 0x114 (R/W  32) Peripheral Channel Status Register */
  __IO  __ESPI_IO_PC_INT_ENABLE_bits_t PC_INT_ENABLE; /**< Offset: 0x118 (R/W  32) Peripheral Channel Interrupt Enable Register */
  __IO  __ESPI_IO_BAR_INHIBIT_DW0_bits_t BAR_INHIBIT_DW0; /**< Offset: 0x120 (R/W  32) BAR Inhibit Register (DWord 0) */
  __IO  __ESPI_IO_BAR_INHIBIT_DW1_bits_t BAR_INHIBIT_DW1; /**< Offset: 0x124 (R/W  32) BAR Inhibit Register (DWord 1) */
  __IO  __ESPI_IO_ESPI_BAR_INIT_bits_t ESPI_BAR_INIT; /**< Offset: 0x128 (R/W  32) eSPI BAR Init Register */
  __IO  __ESPI_IO_EC_IRQ_bits_t        EC_IRQ;        /**< Offset: 0x12C (R/W  32) EC IRQ Register */
  __IO  __ESPI_IO_BASE_ADDRESS_bits_t  ESPI_IO_BASE_ADDRESS; /**< Offset: 0x134 (R/W  32) eSPI I/O Base Address Register */
  __IO  __ESPI_IO_ESPI_MEM_BASE_ADDRESS_bits_t ESPI_MEM_BASE_ADDRESS; /**< Offset: 0x138 (R/W  32) eSPI Memory Base Address Register */
  __IO  __ESPI_IO_MBX_BASE_ADDRESS_bits_t MBX_BASE_ADDRESS; /**< Offset: 0x13C (R/W  32) Mailbox BAR  Register */
  __IO  __ESPI_IO_EM8042_BASE_ADDRESS_bits_t EM8042_BASE_ADDRESS; /**< Offset: 0x140 (R/W  32) 8042 Emulated Keyboard Controller BAR Register */
  __IO  __ESPI_IO_ACPI_EC_0_BASE_ADDRESS_bits_t ACPI_EC_0_BASE_ADDRESS; /**< Offset: 0x144 (R/W  32) ACPI EC Channel 0 Register */
  __IO  __ESPI_IO_ACPI_EC_1_BASE_ADDRESS_bits_t ACPI_EC_1_BASE_ADDRESS; /**< Offset: 0x148 (R/W  32) ACPI EC Channel 1 BAR Register */
  __IO  __ESPI_IO_ACPI_EC_2_BASE_ADDRESS_bits_t ACPI_EC_2_BASE_ADDRESS; /**< Offset: 0x14C (R/W  32) I/O Base Address Register */
  __IO  __ESPI_IO_ACPI_EC_3_BASE_ADDRESS_bits_t ACPI_EC_3_BASE_ADDRESS; /**< Offset: 0x150 (R/W  32) I/O Base Address Register */
  __IO  __ESPI_IO_ACPI_PM1_BASE_ADDRESS_bits_t ACPI_PM1_BASE_ADDRESS; /**< Offset: 0x158 (R/W  32) I/O Base Address Register */
  __IO  __ESPI_IO_FAST_KDB_BASE_ADDRESS_bits_t FAST_KDB_BASE_ADDRESS; /**< Offset: 0x15C (R/W  32) I/O Base Address Register */
  __IO  __ESPI_IO_UART_0_BASE_ADDRESS_bits_t UART_0_BASE_ADDRESS; /**< Offset: 0x160 (R/W  32) I/O Base Address Register */
  __IO  __ESPI_IO_UART_1_BASE_ADDRESS_bits_t UART_1_BASE_ADDRESS; /**< Offset: 0x164 (R/W  32) I/O Base Address Register */
  __IO  __ESPI_IO_EMI_0_BASE_ADDRESS_bits_t EMI_0_BASE_ADDRESS; /**< Offset: 0x168 (R/W  32) I/O Base Address Register */
  __IO  __ESPI_IO_EMI_1_BASE_ADDRESS_bits_t EMI_1_BASE_ADDRESS; /**< Offset: 0x16C (R/W  32) I/O Base Address Register */
  __IO  __ESPI_IO_PORT80_0_BASE_ADDRESS_bits_t PORT80_0_BASE_ADDRESS; /**< Offset: 0x174 (R/W  32) I/O Base Address Register */
  __IO  __ESPI_IO_PORT80_1_BASE_ADDRESS_bits_t PORT80_1_BASE_ADDRESS; /**< Offset: 0x178 (R/W  32) I/O Base Address Register */
  __IO  __ESPI_IO_RTC_BASE_ADDRESS_bits_t RTC_BASE_ADDRESS; /**< Offset: 0x17C (R/W  32) I/O Base Address Register */
  __IO  __ESPI_IO_UART_2_BASE_ADDRESS_bits_t UART_2_BASE_ADDRESS; /**< Offset: 0x188 (R/W  32) I/O Base Address Register */
  __IO  __ESPI_IO_GLUE_BASE_ADDRESS_bits_t GLUE_BASE_ADDRESS; /**< Offset: 0x18C (R/W  32) I/O Base Address Register */
  __IO  __ESPI_IO_LTR_PERIPHERAL_STATUS_bits_t LTR_PERIPHERAL_STATUS; /**< Offset: 0x220 (R/W  32) LTR Peripheral Status Register */
  __IO  __ESPI_IO_LTR_PERIPHERAL_ENABLE_bits_t LTR_PERIPHERAL_ENABLE; /**< Offset: 0x224 (R/W  32) LTR Peripheral Enable Register */
  __IO  __ESPI_IO_LTR_PERIPHERAL_CONTROL_bits_t LTR_PERIPHERAL_CONTROL; /**< Offset: 0x228 (R/W  32) LTR Peripheral Control Register */
  __IO  __ESPI_IO_LTR_PERIPHERAL_MESSAGE_bits_t LTR_PERIPHERAL_MESSAGE; /**< Offset: 0x22C (R/W  32) LTR Peripheral Message Register */
  __IO  __ESPI_IO_OOB_RECEIVE_ADDRESS_bits_t OOB_RECEIVE_ADDRESS; /**< Offset: 0x240 (R/W  32) OOB Channel Receive Address Register */
  __IO  __ESPI_IO_OOB_TRANSMIT_ADDRESS_bits_t OOB_TRANSMIT_ADDRESS; /**< Offset: 0x248 (R/W  32) OOB Channel Transmit Address Register */
  __IO  __ESPI_IO_OOB_RECEIVE_LENGTH_bits_t OOB_RECEIVE_LENGTH; /**< Offset: 0x250 (R/W  32) OOB Channel Receive Length Register */
  __IO  __ESPI_IO_OOB_TRANSMIT_LENGTH_bits_t OOB_TRANSMIT_LENGTH; /**< Offset: 0x254 (R/W  32) OOB Channel Transmit Length Register */
  __IO  __ESPI_IO_OOB_RECEIVE_CONTROL_bits_t OOB_RECEIVE_CONTROL; /**< Offset: 0x258 (R/W  32) OOB Channel Receive Control Register */
  __IO  __ESPI_IO_OOB_RECEIVE_INT_ENABLE_bits_t OOB_RECEIVE_INT_ENABLE; /**< Offset: 0x25C (R/W  32) OOB Channel Receive Interrupt Enable Register */
  __IO  __ESPI_IO_OOB_RECEIVE_STATUS_bits_t OOB_RECEIVE_STATUS; /**< Offset: 0x260 (R/W  32) OOB Channel Receive Status Register */
  __IO  __ESPI_IO_OOB_TRANSMIT_CONTROL_bits_t OOB_TRANSMIT_CONTROL; /**< Offset: 0x264 (R/W  32) OOB Channel Transmit Control Register */
  __IO  __ESPI_IO_OOB_TRANSMIT_INT_ENABLE_bits_t OOB_TRANSMIT_INT_ENABLE; /**< Offset: 0x268 (R/W  32) OOB Channel Transmit Interrupt Enable Register */
  __IO  __ESPI_IO_OOB_TRANSMIT_STATUS_bits_t OOB_TRANSMIT_STATUS; /**< Offset: 0x26C (R/W  32) OOB Channel Transmit Status Register */
  __IO  __ESPI_IO_FLASH_CH_FLASH_ADDRESS_bits_t FLASH_CH_FLASH_ADDRESS; /**< Offset: 0x280 (R/W  32) Flash Access Channel Flash Address Register */
  __IO  __ESPI_IO_FLASH_CH_BUFFER_ADDRESS_bits_t FLASH_CH_BUFFER_ADDRESS; /**< Offset: 0x288 (R/W  32) Flash Access Channel Buffer Address Register */
  __IO  __ESPI_IO_FLASH_CH_TRANSFER_LENGTH_bits_t FLASH_CH_TRANSFER_LENGTH; /**< Offset: 0x290 (R/W  32) Flash Access Channel Transfer Length Register */
  __IO  __ESPI_IO_FLASH_CH_CONTROL_bits_t FLASH_CH_CONTROL; /**< Offset: 0x294 (R/W  32) Flash Access Channel Control Register */
  __IO  __ESPI_IO_FLASH_CH_INT_ENABLE_bits_t FLASH_CH_INT_ENABLE; /**< Offset: 0x298 (R/W  32) Flash Access Channel Interrupt Enable Register */
  __I   __ESPI_IO_FLASH_CH_CONFIG_bits_t FLASH_CH_CONFIG; /**< Offset: 0x29C (R/   32) Flash Access Channel Configuration Register */
  __IO  __ESPI_IO_FLASH_CH_STATUS_bits_t FLASH_CH_STATUS; /**< Offset: 0x2A0 (R/W  32) Flash Access Channel Status Register */
  __I   __ESPI_IO_VWIRE_STATUS_bits_t  VWIRE_STATUS;  /**< Offset: 0x2B0 (R/    8) Virtual Wire Status Register */
  __IO  __ESPI_IO_ESPI_CAPABILITIES_ID_bits_t ESPI_CAPABILITIES_ID; /**< Offset: 0x2E0 (R/W   8) eSPI Capabilities ID Register */
  __IO  __ESPI_IO_ESPI_GLOBAL_CAPABILITIES_0_bits_t ESPI_GLOBAL_CAPABILITIES_0; /**< Offset: 0x2E1 (R/W   8) eSPI Capabilities Global Capabilities 0 Register */
  __IO  __ESPI_IO_ESPI_GLOBAL_CAPABILITIES_1_bits_t ESPI_GLOBAL_CAPABILITIES_1; /**< Offset: 0x2E2 (R/W   8) eSPI Capabilities Global Capabilities 1 Register */
  __IO  __ESPI_IO_ESPI_PC_CAPABILITIES_bits_t ESPI_PC_CAPABILITIES; /**< Offset: 0x2E3 (R/W   8) eSPI Peripheral Channel Capabilities Register */
  __IO  __ESPI_IO_ESPI_VWIRE_CAPABILITIES_bits_t ESPI_VWIRE_CAPABILITIES; /**< Offset: 0x2E4 (R/W   8) eSPI Virtual Wire Channel Capabilities Register */
  __IO  __ESPI_IO_ESPI_OOB_CAPABILITIES_bits_t ESPI_OOB_CAPABILITIES; /**< Offset: 0x2E5 (R/W   8) eSPI OOB Channel Capabilities Register */
  __IO  __ESPI_IO_ESPI_FLASH_CAPABILITIES_bits_t ESPI_FLASH_CAPABILITIES; /**< Offset: 0x2E6 (R/W   8) eSPI Flash Channel Capabilities Register */
  __IO  __ESPI_IO_ESPI_PERIPHERAL_READY_bits_t ESPI_PERIPHERAL_READY; /**< Offset: 0x2E7 (R/W   8) eSPI Peripheral Channel Ready Register */
  __IO  __ESPI_IO_ESPI_OOB_READY_bits_t ESPI_OOB_READY; /**< Offset: 0x2E8 (R/W   8) eSPI OOB Channel Ready Register */
  __IO  __ESPI_IO_ESPI_FLASH_READY_bits_t ESPI_FLASH_READY; /**< Offset: 0x2E9 (R/W   8) eSPI Flash Channel Ready Register */
  __IO  __ESPI_IO_ESPI_RESET_INT_STATUS_bits_t ESPI_RESET_INT_STATUS; /**< Offset: 0x2EA (R/W   8) eSPI Reset Interrupt Status Register */
  __IO  __ESPI_IO_ESPI_RESET_INT_ENABLE_bits_t ESPI_RESET_INT_ENABLE; /**< Offset: 0x2EB (R/W   8) eSPI Reset Interrupt Enable Register */
  __IO  __ESPI_IO_PLTRST_SOURCE_bits_t PLTRST_SOURCE; /**< Offset: 0x2EC (R/W   8) PLTRST Source Register */
  __IO  __ESPI_IO_ESPI_VWIRE_READY_bits_t ESPI_VWIRE_READY; /**< Offset: 0x2ED (R/W   8) eSPI Virtual Wire Channel Ready Register */
  __IO  __ESPI_IO_ESPI_ACTIVATE_bits_t ESPI_ACTIVATE; /**< Offset: 0x330 (R/W   8) eSPI Activate Register */
  __IO  __ESPI_IO_BAR_CONFIG_ADDRESS_bits_t ESPI_IO_BAR_CONFIG_ADDRESS; /**< Offset: 0x334 (R/W  32) eSPI I/O Base Address Configuration Register */
  __IO  __ESPI_IO_ESPI_MEM_BAR_CONFIG_ADDRESS_bits_t ESPI_MEM_BAR_CONFIG_ADDRESS; /**< Offset: 0x338 (R/W  32) eSPI Memory Base Address Configuration Register */
  __IO  __ESPI_IO_MBX_BAR_CONFIG_ADDRESS_bits_t MBX_BAR_CONFIG_ADDRESS; /**< Offset: 0x33C (R/W  32) Mailbox Base Address Configuration Register */
  __IO  __ESPI_IO_EM8042_BAR_CONFIG_ADDRESS_bits_t EM8042_BAR_CONFIG_ADDRESS; /**< Offset: 0x340 (R/W  32) 8042 Emulated Keyboard Controller Base Address Configuration Register */
  __IO  __ESPI_IO_ACPI_EC_0_BAR_CONFIG_ADDRESS_bits_t ACPI_EC_0_BAR_CONFIG_ADDRESS; /**< Offset: 0x344 (R/W  32) ACPI EC 0 Base Address Configuration Register */
  __IO  __ESPI_IO_ACPI_EC_1_BAR_CONFIG_ADDRESS_bits_t ACPI_EC_1_BAR_CONFIG_ADDRESS; /**< Offset: 0x348 (R/W  32) ACPI EC 1 Base Address Configuration Register */
  __IO  __ESPI_IO_ACPI_EC_2_BAR_CONFIG_ADDRESS_bits_t ACPI_EC_2_BAR_CONFIG_ADDRESS; /**< Offset: 0x34C (R/W  32) ACPI EC 2 Base Address Configuration Register */
  __IO  __ESPI_IO_ACPI_EC_3_BAR_CONFIG_ADDRESS_bits_t ACPI_EC_3_BAR_CONFIG_ADDRESS; /**< Offset: 0x350 (R/W  32) ACPI EC 3 Base Address Configuration Register */
  __IO  __ESPI_IO_ACPI_PM1_BAR_CONFIG_ADDRESS_bits_t ACPI_PM1_BAR_CONFIG_ADDRESS; /**< Offset: 0x358 (R/W  32) ACPI PM1 Base Address Configuration Register */
  __IO  __ESPI_IO_FAST_KBD_BAR_CONFIG_ADDRESS_bits_t FAST_KBD_BAR_CONFIG_ADDRESS; /**< Offset: 0x35C (R/W  32) I/O Base Address Configuration Register */
  __IO  __ESPI_IO_UART_0_BAR_CONFIG_ADDRESS_bits_t UART_0_BAR_CONFIG_ADDRESS; /**< Offset: 0x360 (R/W  32) UART 0 Base Address Configuration Register */
  __IO  __ESPI_IO_UART_1_BAR_CONFIG_ADDRESS_bits_t UART_1_BAR_CONFIG_ADDRESS; /**< Offset: 0x364 (R/W  32) UART 1 Base Address Configuration Register */
  __IO  __ESPI_IO_EMI_0_BAR_CONFIG_ADDRESS_bits_t EMI_0_BAR_CONFIG_ADDRESS; /**< Offset: 0x368 (R/W  32) Embedded Memory Interface (EMI) 2 BAR Config Register */
  __IO  __ESPI_IO_EMI_1_BAR_CONFIG_ADDRESS_bits_t EMI_1_BAR_CONFIG_ADDRESS; /**< Offset: 0x36C (R/W  32) Embedded Memory Interface (EMI) 1 BAR Config Register */
  __IO  __ESPI_IO_PORT80_0_BAR_CONFIG_ADDRESS_bits_t PORT80_0_BAR_CONFIG_ADDRESS; /**< Offset: 0x374 (R/W  32) BIOS Debug Port (Port 80) 0 BAR Config Register */
  __IO  __ESPI_IO_PORT80_1_BAR_CONFIG_ADDRESS_bits_t PORT80_1_BAR_CONFIG_ADDRESS; /**< Offset: 0x378 (R/W  32) BIOS Debug Port (Port 80) 1 BAR Config Register */
  __IO  __ESPI_IO_RTC_BAR_CONFIG_ADDRESS_bits_t RTC_BAR_CONFIG_ADDRESS; /**< Offset: 0x37C (R/W  32) RTC BAR Config Register */
  __IO  __ESPI_IO_UART_2_BAR_CONFIG_ADDRESS_bits_t UART_2_BAR_CONFIG_ADDRESS; /**< Offset: 0x384 (R/W  32) UART 2 Base Address Configuration Register */
  __IO  __ESPI_IO_GLUE_BAR_CONFIG_ADDRESS_bits_t GLUE_BAR_CONFIG_ADDRESS; /**< Offset: 0x38C (R/W  32) GLUE Base Address Configuration Register */
  __IO  __ESPI_IO_MBX_HOST_SIRQ_IRQ__SELECT_bits_t MBX_HOST_SIRQ_IRQ__SELECT; /**< Offset: 0x3AC (R/W   8) Mailbox (MBX_Host_SIRQ Interrupt) Selection Register */
  __IO  __ESPI_IO_MBX_HOST_SMI_IRQ_SELECT_bits_t MBX_HOST_SMI_IRQ_SELECT; /**< Offset: 0x3AD (R/W   8) Mailbox (MBX_Host_SMI Interrupt) Selection Register */
  __IO  __ESPI_IO_KIRQ_8042_IRQ_SELECT_bits_t KIRQ_8042_IRQ_SELECT; /**< Offset: 0x3AE (R/W   8) 8042 (KIRQ Interrupt) Selection Register */
  __IO  __ESPI_IO_MIRQ_8042_IRQ_SELECT_bits_t MIRQ_8042_IRQ_SELECT; /**< Offset: 0x3AF (R/W   8) 8042 (MIRQ Interrupt) Selection Register */
  __IO  __ESPI_IO_ACPI_EC_0_OBF_IRQ_SELECT_bits_t ACPI_EC_0_OBF_IRQ_SELECT; /**< Offset: 0x3B0 (R/W   8) ACPI EC 0 (EC_OBF Interrupt) Selection Register */
  __IO  __ESPI_IO_ACPI_EC_1_OBF_IRQ_SELECT_bits_t ACPI_EC_1_OBF_IRQ_SELECT; /**< Offset: 0x3B1 (R/W   8) ACPI EC 1 (EC_OBF Interrupt) Selection Register */
  __IO  __ESPI_IO_ACPI_EC_2_OBF_IRQ_SELECT_bits_t ACPI_EC_2_OBF_IRQ_SELECT; /**< Offset: 0x3B2 (R/W   8) ACPI EC 2 (EC_OBF Interrupt) Selection Register */
  __IO  __ESPI_IO_ACPI_EC_3_OBF_IRQ_SELECT_bits_t ACPI_EC_3_OBF_IRQ_SELECT; /**< Offset: 0x3B3 (R/W   8) ACPI EC 3 (EC_OBF Interrupt) Selection Register */
  __IO  __ESPI_IO_UART_0_IRQ_SELECT_bits_t UART_0_IRQ_SELECT; /**< Offset: 0x3B5 (R/W   8) UART 0 (UART Interrupt) Selection Register */
  __IO  __ESPI_IO_UART_1_IRQ_SELECT_bits_t UART_1_IRQ_SELECT; /**< Offset: 0x3B6 (R/W   8) UART 1 (UART Interrupt) Selection Register */
  __IO  __ESPI_IO_EMI_0_HOST_IRQ_SELECT_bits_t EMI_0_HOST_IRQ_SELECT; /**< Offset: 0x3B7 (R/W   8) EMI 0 (Host Event Interrupt) Selection Register */
  __IO  __ESPI_IO_EMI_0_EC_HOST_IRQ_SELECT_bits_t EMI_0_EC_HOST_IRQ_SELECT; /**< Offset: 0x3B8 (R/W   8) EMI 0 (EC-to-Host Interrupt) Selection Register */
  __IO  __ESPI_IO_EMI_1_HOST_IRQ_SELECT_bits_t EMI_1_HOST_IRQ_SELECT; /**< Offset: 0x3B9 (R/W   8) EMI 1 (Host Event Interrupt) Selection Register */
  __IO  __ESPI_IO_EMI_1_EC_HOST_IRQ_SELECT_bits_t EMI_1_EC_HOST_IRQ_SELECT; /**< Offset: 0x3BA (R/W   8) EMI 1 (EC-to-Host Interrupt) Selection Register */
  __IO  __ESPI_IO_RTC_IRQ_SELECT_bits_t RTC_IRQ_SELECT; /**< Offset: 0x3BD (R/W   8) RTC (RTC Interrupt) Selection Register */
  __IO  __ESPI_IO_EC_IRQ_SELECT_bits_t EC_IRQ_SELECT; /**< Offset: 0x3BE (R/W   8) EC (EC_IRQ Interrupt) Selection Register */
  __IO  __ESPI_IO_UART_2_IRQ_SELECT_bits_t UART_2_IRQ_SELECT; /**< Offset: 0x3BF (R/W   8) UART 2 (UART Interrupt) Selection Register */
  __IO  __ESPI_IO_ESPI_VWIRE_ERRORS_bits_t ESPI_VWIRE_ERRORS; /**< Offset: 0x3F0 (R/W   8) eSPI Virtual Wire Errors Register */
} espiio_registers_t;
/** @}  end of The Enhanced Serial Peripheral Interface (eSPI) is used by the system host to configure the chip and communicate\n    with the logical devices implemented in the design through a series of read/write registers. It is Intel's successor to the\n    Low Pin Count (LPC) bus, used in previous devices to provide System Host access to devices internal to the Embedded Controller.\n    The I/O Component is one of two Logical Devices (along with the Memory Component) that provide access to all the registers in the device. */

#endif /* _PIC32CX_0525SG12_ESPI_IO_COMPONENT_H_ */
